; ModuleID = 'keyboard-macros.c'
source_filename = "keyboard-macros.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._XDisplay = type opaque
%union._XEvent = type { [24 x i64] }
%struct.anon = type { %struct._XExtData*, %struct._XPrivate*, i32, i32, i32, i32, i8*, i64, i64, i64, i32, i64 (%struct._XDisplay*)*, i32, i32, i32, i32, i32, %struct.ScreenFormat*, i32, i32, %struct._XPrivate*, %struct._XPrivate*, i32, i64, i64, i8*, i8*, i8*, i8*, i32, %struct._XrmHashBucketRec*, i32 (%struct._XDisplay*)*, i8*, i32, i32, %struct.Screen*, i64, i64, i32, i32, i8*, i8*, i32, i8* }
%struct._XExtData = type { i32, %struct._XExtData*, i32 (%struct._XExtData*)*, i8* }
%struct.ScreenFormat = type { %struct._XExtData*, i32, i32, i32 }
%struct._XPrivate = type opaque
%struct._XrmHashBucketRec = type opaque
%struct.Screen = type { %struct._XExtData*, %struct._XDisplay*, i64, i32, i32, i32, i32, i32, %struct.Depth*, i32, %struct.Visual*, %struct._XGC*, i64, i64, i64, i32, i32, i32, i32, i64 }
%struct.Depth = type { i32, i32, %struct.Visual* }
%struct.Visual = type { %struct._XExtData*, i64, i32, i64, i64, i64, i32, i32 }
%struct._XGC = type opaque
%struct.XKeyEvent = type { i32, i64, i32, %struct._XDisplay*, i64, i64, i64, i64, i32, i32, i32, i32, i32, i32, i32 }

@.str = private unnamed_addr constant [3 x i8] c"F7\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"F6\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git 078de928eea94413164fbdff5fab7bdcf0f60aa7)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "keyboard-macros.c", directory: "/scratch/yc0769/xstack_benchmark/rosetta/Keyboard-macros")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "_XPrivDisplay", file: !6, line: 550, baseType: !7)
!6 = !DIFile(filename: "/usr/include/X11/Xlib.h", directory: "")
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 493, size: 2368, elements: !9)
!9 = !{!10, !27, !30, !31, !32, !33, !34, !35, !39, !40, !41, !42, !48, !49, !50, !51, !52, !53, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !75, !78, !82, !83, !84, !85, !136, !137, !138, !139, !140, !141, !142, !143}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !8, file: !6, line: 498, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "XExtData", file: !6, line: 155, baseType: !13)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_XExtData", file: !6, line: 148, size: 256, elements: !14)
!14 = !{!15, !17, !19, !23}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !13, file: !6, line: 149, baseType: !16, size: 32)
!16 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !13, file: !6, line: 150, baseType: !18, size: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "free_private", scope: !13, file: !6, line: 151, baseType: !20, size: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DISubroutineType(types: !22)
!22 = !{!16, !18}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !13, file: !6, line: 154, baseType: !24, size: 64, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPointer", file: !6, line: 80, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "private1", scope: !8, file: !6, line: 499, baseType: !28, size: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XPrivate", file: !6, line: 490, flags: DIFlagFwdDecl)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !8, file: !6, line: 500, baseType: !16, size: 32, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "private2", scope: !8, file: !6, line: 501, baseType: !16, size: 32, offset: 160)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "proto_major_version", scope: !8, file: !6, line: 502, baseType: !16, size: 32, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "proto_minor_version", scope: !8, file: !6, line: 503, baseType: !16, size: 32, offset: 224)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !8, file: !6, line: 504, baseType: !25, size: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "private3", scope: !8, file: !6, line: 505, baseType: !36, size: 64, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "XID", file: !37, line: 66, baseType: !38)
!37 = !DIFile(filename: "/usr/include/X11/X.h", directory: "")
!38 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "private4", scope: !8, file: !6, line: 506, baseType: !36, size: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "private5", scope: !8, file: !6, line: 507, baseType: !36, size: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "private6", scope: !8, file: !6, line: 508, baseType: !16, size: 32, offset: 512)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "resource_alloc", scope: !8, file: !6, line: 509, baseType: !43, size: 64, offset: 576)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{!36, !46}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XDisplay", file: !6, line: 255, flags: DIFlagFwdDecl)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "byte_order", scope: !8, file: !6, line: 512, baseType: !16, size: 32, offset: 640)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_unit", scope: !8, file: !6, line: 513, baseType: !16, size: 32, offset: 672)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_pad", scope: !8, file: !6, line: 514, baseType: !16, size: 32, offset: 704)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_bit_order", scope: !8, file: !6, line: 515, baseType: !16, size: 32, offset: 736)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "nformats", scope: !8, file: !6, line: 516, baseType: !16, size: 32, offset: 768)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "pixmap_format", scope: !8, file: !6, line: 517, baseType: !54, size: 64, offset: 832)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScreenFormat", file: !6, line: 285, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 280, size: 192, elements: !57)
!57 = !{!58, !59, !60, !61}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !56, file: !6, line: 281, baseType: !11, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !56, file: !6, line: 282, baseType: !16, size: 32, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_pixel", scope: !56, file: !6, line: 283, baseType: !16, size: 32, offset: 96)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "scanline_pad", scope: !56, file: !6, line: 284, baseType: !16, size: 32, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "private8", scope: !8, file: !6, line: 518, baseType: !16, size: 32, offset: 896)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !8, file: !6, line: 519, baseType: !16, size: 32, offset: 928)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "private9", scope: !8, file: !6, line: 520, baseType: !28, size: 64, offset: 960)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "private10", scope: !8, file: !6, line: 520, baseType: !28, size: 64, offset: 1024)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "qlen", scope: !8, file: !6, line: 521, baseType: !16, size: 32, offset: 1088)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "last_request_read", scope: !8, file: !6, line: 522, baseType: !38, size: 64, offset: 1152)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !8, file: !6, line: 523, baseType: !38, size: 64, offset: 1216)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "private11", scope: !8, file: !6, line: 524, baseType: !24, size: 64, offset: 1280)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "private12", scope: !8, file: !6, line: 525, baseType: !24, size: 64, offset: 1344)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "private13", scope: !8, file: !6, line: 526, baseType: !24, size: 64, offset: 1408)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "private14", scope: !8, file: !6, line: 527, baseType: !24, size: 64, offset: 1472)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "max_request_size", scope: !8, file: !6, line: 528, baseType: !74, size: 32, offset: 1536)
!74 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !8, file: !6, line: 529, baseType: !76, size: 64, offset: 1600)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XrmHashBucketRec", file: !6, line: 491, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "private15", scope: !8, file: !6, line: 530, baseType: !79, size: 64, offset: 1664)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!16, !46}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "display_name", scope: !8, file: !6, line: 533, baseType: !25, size: 64, offset: 1728)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "default_screen", scope: !8, file: !6, line: 534, baseType: !16, size: 32, offset: 1792)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "nscreens", scope: !8, file: !6, line: 535, baseType: !16, size: 32, offset: 1824)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "screens", scope: !8, file: !6, line: 536, baseType: !86, size: 64, offset: 1856)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "Screen", file: !6, line: 275, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 257, size: 1024, elements: !89)
!89 = !{!90, !91, !92, !94, !95, !96, !97, !98, !99, !120, !121, !122, !126, !128, !129, !130, !131, !132, !133, !134}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !88, file: !6, line: 258, baseType: !11, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !88, file: !6, line: 259, baseType: !46, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !88, file: !6, line: 260, baseType: !93, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "Window", file: !37, line: 96, baseType: !36)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !88, file: !6, line: 261, baseType: !16, size: 32, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !88, file: !6, line: 261, baseType: !16, size: 32, offset: 224)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "mwidth", scope: !88, file: !6, line: 262, baseType: !16, size: 32, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "mheight", scope: !88, file: !6, line: 262, baseType: !16, size: 32, offset: 288)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ndepths", scope: !88, file: !6, line: 263, baseType: !16, size: 32, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "depths", scope: !88, file: !6, line: 264, baseType: !100, size: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "Depth", file: !6, line: 247, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 243, size: 128, elements: !103)
!103 = !{!104, !105, !106}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !102, file: !6, line: 244, baseType: !16, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "nvisuals", scope: !102, file: !6, line: 245, baseType: !16, size: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "visuals", scope: !102, file: !6, line: 246, baseType: !107, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "Visual", file: !6, line: 238, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 227, size: 448, elements: !110)
!110 = !{!111, !112, !114, !115, !116, !117, !118, !119}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !109, file: !6, line: 228, baseType: !11, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "visualid", scope: !109, file: !6, line: 229, baseType: !113, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "VisualID", file: !37, line: 76, baseType: !38)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !109, file: !6, line: 233, baseType: !16, size: 32, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "red_mask", scope: !109, file: !6, line: 235, baseType: !38, size: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "green_mask", scope: !109, file: !6, line: 235, baseType: !38, size: 64, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "blue_mask", scope: !109, file: !6, line: 235, baseType: !38, size: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_rgb", scope: !109, file: !6, line: 236, baseType: !16, size: 32, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "map_entries", scope: !109, file: !6, line: 237, baseType: !16, size: 32, offset: 416)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "root_depth", scope: !88, file: !6, line: 265, baseType: !16, size: 32, offset: 448)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "root_visual", scope: !88, file: !6, line: 266, baseType: !107, size: 64, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "default_gc", scope: !88, file: !6, line: 267, baseType: !123, size: 64, offset: 576)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "GC", file: !6, line: 222, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XGC", file: !6, line: 214, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !88, file: !6, line: 268, baseType: !127, size: 64, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "Colormap", file: !37, line: 104, baseType: !36)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "white_pixel", scope: !88, file: !6, line: 269, baseType: !38, size: 64, offset: 704)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "black_pixel", scope: !88, file: !6, line: 270, baseType: !38, size: 64, offset: 768)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "max_maps", scope: !88, file: !6, line: 271, baseType: !16, size: 32, offset: 832)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "min_maps", scope: !88, file: !6, line: 271, baseType: !16, size: 32, offset: 864)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "backing_store", scope: !88, file: !6, line: 272, baseType: !16, size: 32, offset: 896)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "save_unders", scope: !88, file: !6, line: 273, baseType: !16, size: 32, offset: 928)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "root_input_mask", scope: !88, file: !6, line: 274, baseType: !135, size: 64, offset: 960)
!135 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "motion_buffer", scope: !8, file: !6, line: 537, baseType: !38, size: 64, offset: 1920)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "private16", scope: !8, file: !6, line: 538, baseType: !38, size: 64, offset: 1984)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "min_keycode", scope: !8, file: !6, line: 539, baseType: !16, size: 32, offset: 2048)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "max_keycode", scope: !8, file: !6, line: 540, baseType: !16, size: 32, offset: 2080)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "private17", scope: !8, file: !6, line: 541, baseType: !24, size: 64, offset: 2112)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "private18", scope: !8, file: !6, line: 542, baseType: !24, size: 64, offset: 2176)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "private19", scope: !8, file: !6, line: 543, baseType: !16, size: 32, offset: 2240)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "xdefaults", scope: !8, file: !6, line: 544, baseType: !25, size: 64, offset: 2304)
!144 = !{i32 7, !"Dwarf Version", i32 4}
!145 = !{i32 2, !"Debug Info Version", i32 3}
!146 = !{i32 1, !"wchar_size", i32 4}
!147 = !{!"clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git 078de928eea94413164fbdff5fab7bdcf0f60aa7)"}
!148 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 6, type: !149, scopeLine: 7, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!149 = !DISubroutineType(types: !150)
!150 = !{!16}
!151 = !DILocalVariable(name: "d", scope: !148, file: !1, line: 8, type: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "Display", file: !6, line: 487, baseType: !47)
!154 = !DILocation(line: 8, column: 12, scope: !148)
!155 = !DILocalVariable(name: "event", scope: !148, file: !1, line: 9, type: !156)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "XEvent", file: !6, line: 1009, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_XEvent", file: !6, line: 973, size: 1536, elements: !158)
!158 = !{!159, !160, !169, !189, !208, !227, !248, !259, !273, !290, !301, !311, !327, !337, !348, !359, !369, !383, !400, !412, !423, !441, !452, !463, !476, !487, !501, !514, !526, !553, !565, !577, !590, !600, !612}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !157, file: !6, line: 974, baseType: !16, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "xany", scope: !157, file: !6, line: 975, baseType: !161, size: 320)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "XAnyEvent", file: !6, line: 940, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 934, size: 320, elements: !163)
!163 = !{!164, !165, !166, !167, !168}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !162, file: !6, line: 935, baseType: !16, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !162, file: !6, line: 936, baseType: !38, size: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !162, file: !6, line: 937, baseType: !16, size: 32, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !162, file: !6, line: 938, baseType: !152, size: 64, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !162, file: !6, line: 939, baseType: !93, size: 64, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "xkey", scope: !157, file: !6, line: 976, baseType: !170, size: 768)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "XKeyEvent", file: !6, line: 571, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 557, size: 768, elements: !172)
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180, !182, !183, !184, !185, !186, !187, !188}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !171, file: !6, line: 558, baseType: !16, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !171, file: !6, line: 559, baseType: !38, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !171, file: !6, line: 560, baseType: !16, size: 32, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !171, file: !6, line: 561, baseType: !152, size: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !171, file: !6, line: 562, baseType: !93, size: 64, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !171, file: !6, line: 563, baseType: !93, size: 64, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !171, file: !6, line: 564, baseType: !93, size: 64, offset: 384)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !171, file: !6, line: 565, baseType: !181, size: 64, offset: 448)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "Time", file: !37, line: 77, baseType: !38)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !171, file: !6, line: 566, baseType: !16, size: 32, offset: 512)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !171, file: !6, line: 566, baseType: !16, size: 32, offset: 544)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !171, file: !6, line: 567, baseType: !16, size: 32, offset: 576)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !171, file: !6, line: 567, baseType: !16, size: 32, offset: 608)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !171, file: !6, line: 568, baseType: !74, size: 32, offset: 640)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "keycode", scope: !171, file: !6, line: 569, baseType: !74, size: 32, offset: 672)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !171, file: !6, line: 570, baseType: !16, size: 32, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "xbutton", scope: !157, file: !6, line: 977, baseType: !190, size: 768)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "XButtonEvent", file: !6, line: 589, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 575, size: 768, elements: !192)
!192 = !{!193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !191, file: !6, line: 576, baseType: !16, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !191, file: !6, line: 577, baseType: !38, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !191, file: !6, line: 578, baseType: !16, size: 32, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !191, file: !6, line: 579, baseType: !152, size: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !191, file: !6, line: 580, baseType: !93, size: 64, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !191, file: !6, line: 581, baseType: !93, size: 64, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !191, file: !6, line: 582, baseType: !93, size: 64, offset: 384)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !191, file: !6, line: 583, baseType: !181, size: 64, offset: 448)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !191, file: !6, line: 584, baseType: !16, size: 32, offset: 512)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !191, file: !6, line: 584, baseType: !16, size: 32, offset: 544)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !191, file: !6, line: 585, baseType: !16, size: 32, offset: 576)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !191, file: !6, line: 585, baseType: !16, size: 32, offset: 608)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !191, file: !6, line: 586, baseType: !74, size: 32, offset: 640)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !191, file: !6, line: 587, baseType: !74, size: 32, offset: 672)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !191, file: !6, line: 588, baseType: !16, size: 32, offset: 704)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "xmotion", scope: !157, file: !6, line: 978, baseType: !209, size: 768)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMotionEvent", file: !6, line: 607, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 593, size: 768, elements: !211)
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !210, file: !6, line: 594, baseType: !16, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !210, file: !6, line: 595, baseType: !38, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !210, file: !6, line: 596, baseType: !16, size: 32, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !210, file: !6, line: 597, baseType: !152, size: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !210, file: !6, line: 598, baseType: !93, size: 64, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !210, file: !6, line: 599, baseType: !93, size: 64, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !210, file: !6, line: 600, baseType: !93, size: 64, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !210, file: !6, line: 601, baseType: !181, size: 64, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !210, file: !6, line: 602, baseType: !16, size: 32, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !210, file: !6, line: 602, baseType: !16, size: 32, offset: 544)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !210, file: !6, line: 603, baseType: !16, size: 32, offset: 576)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !210, file: !6, line: 603, baseType: !16, size: 32, offset: 608)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !210, file: !6, line: 604, baseType: !74, size: 32, offset: 640)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "is_hint", scope: !210, file: !6, line: 605, baseType: !26, size: 8, offset: 672)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !210, file: !6, line: 606, baseType: !16, size: 32, offset: 704)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "xcrossing", scope: !157, file: !6, line: 979, baseType: !228, size: 832)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCrossingEvent", file: !6, line: 630, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 610, size: 832, elements: !230)
!230 = !{!231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !229, file: !6, line: 611, baseType: !16, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !229, file: !6, line: 612, baseType: !38, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !229, file: !6, line: 613, baseType: !16, size: 32, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !229, file: !6, line: 614, baseType: !152, size: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !229, file: !6, line: 615, baseType: !93, size: 64, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !229, file: !6, line: 616, baseType: !93, size: 64, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !229, file: !6, line: 617, baseType: !93, size: 64, offset: 384)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !229, file: !6, line: 618, baseType: !181, size: 64, offset: 448)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !229, file: !6, line: 619, baseType: !16, size: 32, offset: 512)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !229, file: !6, line: 619, baseType: !16, size: 32, offset: 544)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !229, file: !6, line: 620, baseType: !16, size: 32, offset: 576)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !229, file: !6, line: 620, baseType: !16, size: 32, offset: 608)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !229, file: !6, line: 621, baseType: !16, size: 32, offset: 640)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "detail", scope: !229, file: !6, line: 622, baseType: !16, size: 32, offset: 672)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !229, file: !6, line: 627, baseType: !16, size: 32, offset: 704)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "focus", scope: !229, file: !6, line: 628, baseType: !16, size: 32, offset: 736)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !229, file: !6, line: 629, baseType: !74, size: 32, offset: 768)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "xfocus", scope: !157, file: !6, line: 980, baseType: !249, size: 384)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "XFocusChangeEvent", file: !6, line: 648, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 634, size: 384, elements: !251)
!251 = !{!252, !253, !254, !255, !256, !257, !258}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !250, file: !6, line: 635, baseType: !16, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !250, file: !6, line: 636, baseType: !38, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !250, file: !6, line: 637, baseType: !16, size: 32, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !250, file: !6, line: 638, baseType: !152, size: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !250, file: !6, line: 639, baseType: !93, size: 64, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !250, file: !6, line: 640, baseType: !16, size: 32, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "detail", scope: !250, file: !6, line: 642, baseType: !16, size: 32, offset: 352)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "xexpose", scope: !157, file: !6, line: 981, baseType: !260, size: 512)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "XExposeEvent", file: !6, line: 671, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 662, size: 512, elements: !262)
!262 = !{!263, !264, !265, !266, !267, !268, !269, !270, !271, !272}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !261, file: !6, line: 663, baseType: !16, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !261, file: !6, line: 664, baseType: !38, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !261, file: !6, line: 665, baseType: !16, size: 32, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !261, file: !6, line: 666, baseType: !152, size: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !261, file: !6, line: 667, baseType: !93, size: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !261, file: !6, line: 668, baseType: !16, size: 32, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !261, file: !6, line: 668, baseType: !16, size: 32, offset: 352)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !261, file: !6, line: 669, baseType: !16, size: 32, offset: 384)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !261, file: !6, line: 669, baseType: !16, size: 32, offset: 416)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !261, file: !6, line: 670, baseType: !16, size: 32, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "xgraphicsexpose", scope: !157, file: !6, line: 982, baseType: !274, size: 576)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "XGraphicsExposeEvent", file: !6, line: 684, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 673, size: 576, elements: !276)
!276 = !{!277, !278, !279, !280, !281, !283, !284, !285, !286, !287, !288, !289}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !275, file: !6, line: 674, baseType: !16, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !275, file: !6, line: 675, baseType: !38, size: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !275, file: !6, line: 676, baseType: !16, size: 32, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !275, file: !6, line: 677, baseType: !152, size: 64, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "drawable", scope: !275, file: !6, line: 678, baseType: !282, size: 64, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "Drawable", file: !37, line: 97, baseType: !36)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !275, file: !6, line: 679, baseType: !16, size: 32, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !275, file: !6, line: 679, baseType: !16, size: 32, offset: 352)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !275, file: !6, line: 680, baseType: !16, size: 32, offset: 384)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !275, file: !6, line: 680, baseType: !16, size: 32, offset: 416)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !275, file: !6, line: 681, baseType: !16, size: 32, offset: 448)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "major_code", scope: !275, file: !6, line: 682, baseType: !16, size: 32, offset: 480)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "minor_code", scope: !275, file: !6, line: 683, baseType: !16, size: 32, offset: 512)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "xnoexpose", scope: !157, file: !6, line: 983, baseType: !291, size: 384)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "XNoExposeEvent", file: !6, line: 694, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 686, size: 384, elements: !293)
!293 = !{!294, !295, !296, !297, !298, !299, !300}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !292, file: !6, line: 687, baseType: !16, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !292, file: !6, line: 688, baseType: !38, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !292, file: !6, line: 689, baseType: !16, size: 32, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !292, file: !6, line: 690, baseType: !152, size: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "drawable", scope: !292, file: !6, line: 691, baseType: !282, size: 64, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "major_code", scope: !292, file: !6, line: 692, baseType: !16, size: 32, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "minor_code", scope: !292, file: !6, line: 693, baseType: !16, size: 32, offset: 352)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "xvisibility", scope: !157, file: !6, line: 984, baseType: !302, size: 384)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "XVisibilityEvent", file: !6, line: 703, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 696, size: 384, elements: !304)
!304 = !{!305, !306, !307, !308, !309, !310}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !303, file: !6, line: 697, baseType: !16, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !303, file: !6, line: 698, baseType: !38, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !303, file: !6, line: 699, baseType: !16, size: 32, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !303, file: !6, line: 700, baseType: !152, size: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !303, file: !6, line: 701, baseType: !93, size: 64, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !303, file: !6, line: 702, baseType: !16, size: 32, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "xcreatewindow", scope: !157, file: !6, line: 985, baseType: !312, size: 576)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCreateWindowEvent", file: !6, line: 716, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 705, size: 576, elements: !314)
!314 = !{!315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !313, file: !6, line: 706, baseType: !16, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !313, file: !6, line: 707, baseType: !38, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !313, file: !6, line: 708, baseType: !16, size: 32, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !313, file: !6, line: 709, baseType: !152, size: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !313, file: !6, line: 710, baseType: !93, size: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !313, file: !6, line: 711, baseType: !93, size: 64, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !313, file: !6, line: 712, baseType: !16, size: 32, offset: 384)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !313, file: !6, line: 712, baseType: !16, size: 32, offset: 416)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !313, file: !6, line: 713, baseType: !16, size: 32, offset: 448)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !313, file: !6, line: 713, baseType: !16, size: 32, offset: 480)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !313, file: !6, line: 714, baseType: !16, size: 32, offset: 512)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !313, file: !6, line: 715, baseType: !16, size: 32, offset: 544)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "xdestroywindow", scope: !157, file: !6, line: 986, baseType: !328, size: 384)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "XDestroyWindowEvent", file: !6, line: 725, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 718, size: 384, elements: !330)
!330 = !{!331, !332, !333, !334, !335, !336}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !329, file: !6, line: 719, baseType: !16, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !329, file: !6, line: 720, baseType: !38, size: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !329, file: !6, line: 721, baseType: !16, size: 32, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !329, file: !6, line: 722, baseType: !152, size: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !329, file: !6, line: 723, baseType: !93, size: 64, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !329, file: !6, line: 724, baseType: !93, size: 64, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "xunmap", scope: !157, file: !6, line: 987, baseType: !338, size: 448)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "XUnmapEvent", file: !6, line: 735, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 727, size: 448, elements: !340)
!340 = !{!341, !342, !343, !344, !345, !346, !347}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !339, file: !6, line: 728, baseType: !16, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !339, file: !6, line: 729, baseType: !38, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !339, file: !6, line: 730, baseType: !16, size: 32, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !339, file: !6, line: 731, baseType: !152, size: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !339, file: !6, line: 732, baseType: !93, size: 64, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !339, file: !6, line: 733, baseType: !93, size: 64, offset: 320)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "from_configure", scope: !339, file: !6, line: 734, baseType: !16, size: 32, offset: 384)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "xmap", scope: !157, file: !6, line: 988, baseType: !349, size: 448)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMapEvent", file: !6, line: 745, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 737, size: 448, elements: !351)
!351 = !{!352, !353, !354, !355, !356, !357, !358}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !350, file: !6, line: 738, baseType: !16, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !350, file: !6, line: 739, baseType: !38, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !350, file: !6, line: 740, baseType: !16, size: 32, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !350, file: !6, line: 741, baseType: !152, size: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !350, file: !6, line: 742, baseType: !93, size: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !350, file: !6, line: 743, baseType: !93, size: 64, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !350, file: !6, line: 744, baseType: !16, size: 32, offset: 384)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "xmaprequest", scope: !157, file: !6, line: 989, baseType: !360, size: 384)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMapRequestEvent", file: !6, line: 754, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 747, size: 384, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !368}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !361, file: !6, line: 748, baseType: !16, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !361, file: !6, line: 749, baseType: !38, size: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !361, file: !6, line: 750, baseType: !16, size: 32, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !361, file: !6, line: 751, baseType: !152, size: 64, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !361, file: !6, line: 752, baseType: !93, size: 64, offset: 256)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !361, file: !6, line: 753, baseType: !93, size: 64, offset: 320)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "xreparent", scope: !157, file: !6, line: 990, baseType: !370, size: 576)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "XReparentEvent", file: !6, line: 766, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 756, size: 576, elements: !372)
!372 = !{!373, !374, !375, !376, !377, !378, !379, !380, !381, !382}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !371, file: !6, line: 757, baseType: !16, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !371, file: !6, line: 758, baseType: !38, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !371, file: !6, line: 759, baseType: !16, size: 32, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !371, file: !6, line: 760, baseType: !152, size: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !371, file: !6, line: 761, baseType: !93, size: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !371, file: !6, line: 762, baseType: !93, size: 64, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !371, file: !6, line: 763, baseType: !93, size: 64, offset: 384)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !371, file: !6, line: 764, baseType: !16, size: 32, offset: 448)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !371, file: !6, line: 764, baseType: !16, size: 32, offset: 480)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !371, file: !6, line: 765, baseType: !16, size: 32, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "xconfigure", scope: !157, file: !6, line: 991, baseType: !384, size: 704)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "XConfigureEvent", file: !6, line: 780, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 768, size: 704, elements: !386)
!386 = !{!387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !385, file: !6, line: 769, baseType: !16, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !385, file: !6, line: 770, baseType: !38, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !385, file: !6, line: 771, baseType: !16, size: 32, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !385, file: !6, line: 772, baseType: !152, size: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !385, file: !6, line: 773, baseType: !93, size: 64, offset: 256)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !385, file: !6, line: 774, baseType: !93, size: 64, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !385, file: !6, line: 775, baseType: !16, size: 32, offset: 384)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !385, file: !6, line: 775, baseType: !16, size: 32, offset: 416)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !385, file: !6, line: 776, baseType: !16, size: 32, offset: 448)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !385, file: !6, line: 776, baseType: !16, size: 32, offset: 480)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !385, file: !6, line: 777, baseType: !16, size: 32, offset: 512)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "above", scope: !385, file: !6, line: 778, baseType: !93, size: 64, offset: 576)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !385, file: !6, line: 779, baseType: !16, size: 32, offset: 640)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "xgravity", scope: !157, file: !6, line: 992, baseType: !401, size: 448)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "XGravityEvent", file: !6, line: 790, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 782, size: 448, elements: !403)
!403 = !{!404, !405, !406, !407, !408, !409, !410, !411}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !402, file: !6, line: 783, baseType: !16, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !402, file: !6, line: 784, baseType: !38, size: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !402, file: !6, line: 785, baseType: !16, size: 32, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !402, file: !6, line: 786, baseType: !152, size: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !402, file: !6, line: 787, baseType: !93, size: 64, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !402, file: !6, line: 788, baseType: !93, size: 64, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !402, file: !6, line: 789, baseType: !16, size: 32, offset: 384)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !402, file: !6, line: 789, baseType: !16, size: 32, offset: 416)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "xresizerequest", scope: !157, file: !6, line: 993, baseType: !413, size: 384)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "XResizeRequestEvent", file: !6, line: 799, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 792, size: 384, elements: !415)
!415 = !{!416, !417, !418, !419, !420, !421, !422}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !414, file: !6, line: 793, baseType: !16, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !414, file: !6, line: 794, baseType: !38, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !414, file: !6, line: 795, baseType: !16, size: 32, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !414, file: !6, line: 796, baseType: !152, size: 64, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !414, file: !6, line: 797, baseType: !93, size: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !414, file: !6, line: 798, baseType: !16, size: 32, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !414, file: !6, line: 798, baseType: !16, size: 32, offset: 352)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "xconfigurerequest", scope: !157, file: !6, line: 994, baseType: !424, size: 768)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "XConfigureRequestEvent", file: !6, line: 814, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 801, size: 768, elements: !426)
!426 = !{!427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !425, file: !6, line: 802, baseType: !16, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !425, file: !6, line: 803, baseType: !38, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !425, file: !6, line: 804, baseType: !16, size: 32, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !425, file: !6, line: 805, baseType: !152, size: 64, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !425, file: !6, line: 806, baseType: !93, size: 64, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !425, file: !6, line: 807, baseType: !93, size: 64, offset: 320)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !425, file: !6, line: 808, baseType: !16, size: 32, offset: 384)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !425, file: !6, line: 808, baseType: !16, size: 32, offset: 416)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !425, file: !6, line: 809, baseType: !16, size: 32, offset: 448)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !425, file: !6, line: 809, baseType: !16, size: 32, offset: 480)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !425, file: !6, line: 810, baseType: !16, size: 32, offset: 512)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "above", scope: !425, file: !6, line: 811, baseType: !93, size: 64, offset: 576)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "detail", scope: !425, file: !6, line: 812, baseType: !16, size: 32, offset: 640)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "value_mask", scope: !425, file: !6, line: 813, baseType: !38, size: 64, offset: 704)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "xcirculate", scope: !157, file: !6, line: 995, baseType: !442, size: 448)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCirculateEvent", file: !6, line: 824, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 816, size: 448, elements: !444)
!444 = !{!445, !446, !447, !448, !449, !450, !451}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !443, file: !6, line: 817, baseType: !16, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !443, file: !6, line: 818, baseType: !38, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !443, file: !6, line: 819, baseType: !16, size: 32, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !443, file: !6, line: 820, baseType: !152, size: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !443, file: !6, line: 821, baseType: !93, size: 64, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !443, file: !6, line: 822, baseType: !93, size: 64, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "place", scope: !443, file: !6, line: 823, baseType: !16, size: 32, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "xcirculaterequest", scope: !157, file: !6, line: 996, baseType: !453, size: 448)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCirculateRequestEvent", file: !6, line: 834, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 826, size: 448, elements: !455)
!455 = !{!456, !457, !458, !459, !460, !461, !462}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !454, file: !6, line: 827, baseType: !16, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !454, file: !6, line: 828, baseType: !38, size: 64, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !454, file: !6, line: 829, baseType: !16, size: 32, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !454, file: !6, line: 830, baseType: !152, size: 64, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !454, file: !6, line: 831, baseType: !93, size: 64, offset: 256)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !454, file: !6, line: 832, baseType: !93, size: 64, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "place", scope: !454, file: !6, line: 833, baseType: !16, size: 32, offset: 384)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "xproperty", scope: !157, file: !6, line: 997, baseType: !464, size: 512)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPropertyEvent", file: !6, line: 845, baseType: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 836, size: 512, elements: !466)
!466 = !{!467, !468, !469, !470, !471, !472, !474, !475}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !465, file: !6, line: 837, baseType: !16, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !465, file: !6, line: 838, baseType: !38, size: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !465, file: !6, line: 839, baseType: !16, size: 32, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !465, file: !6, line: 840, baseType: !152, size: 64, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !465, file: !6, line: 841, baseType: !93, size: 64, offset: 256)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !465, file: !6, line: 842, baseType: !473, size: 64, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atom", file: !37, line: 74, baseType: !38)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !465, file: !6, line: 843, baseType: !181, size: 64, offset: 384)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !465, file: !6, line: 844, baseType: !16, size: 32, offset: 448)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "xselectionclear", scope: !157, file: !6, line: 998, baseType: !477, size: 448)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSelectionClearEvent", file: !6, line: 855, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 847, size: 448, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485, !486}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !478, file: !6, line: 848, baseType: !16, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !478, file: !6, line: 849, baseType: !38, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !478, file: !6, line: 850, baseType: !16, size: 32, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !478, file: !6, line: 851, baseType: !152, size: 64, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !478, file: !6, line: 852, baseType: !93, size: 64, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "selection", scope: !478, file: !6, line: 853, baseType: !473, size: 64, offset: 320)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !478, file: !6, line: 854, baseType: !181, size: 64, offset: 384)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "xselectionrequest", scope: !157, file: !6, line: 999, baseType: !488, size: 640)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSelectionRequestEvent", file: !6, line: 868, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 857, size: 640, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499, !500}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !489, file: !6, line: 858, baseType: !16, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !489, file: !6, line: 859, baseType: !38, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !489, file: !6, line: 860, baseType: !16, size: 32, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !489, file: !6, line: 861, baseType: !152, size: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !489, file: !6, line: 862, baseType: !93, size: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "requestor", scope: !489, file: !6, line: 863, baseType: !93, size: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "selection", scope: !489, file: !6, line: 864, baseType: !473, size: 64, offset: 384)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !489, file: !6, line: 865, baseType: !473, size: 64, offset: 448)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "property", scope: !489, file: !6, line: 866, baseType: !473, size: 64, offset: 512)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !489, file: !6, line: 867, baseType: !181, size: 64, offset: 576)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "xselection", scope: !157, file: !6, line: 1000, baseType: !502, size: 576)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSelectionEvent", file: !6, line: 880, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 870, size: 576, elements: !504)
!504 = !{!505, !506, !507, !508, !509, !510, !511, !512, !513}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !503, file: !6, line: 871, baseType: !16, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !503, file: !6, line: 872, baseType: !38, size: 64, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !503, file: !6, line: 873, baseType: !16, size: 32, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !503, file: !6, line: 874, baseType: !152, size: 64, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "requestor", scope: !503, file: !6, line: 875, baseType: !93, size: 64, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "selection", scope: !503, file: !6, line: 876, baseType: !473, size: 64, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !503, file: !6, line: 877, baseType: !473, size: 64, offset: 384)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "property", scope: !503, file: !6, line: 878, baseType: !473, size: 64, offset: 448)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !503, file: !6, line: 879, baseType: !181, size: 64, offset: 512)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "xcolormap", scope: !157, file: !6, line: 1001, baseType: !515, size: 448)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "XColormapEvent", file: !6, line: 895, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 882, size: 448, elements: !517)
!517 = !{!518, !519, !520, !521, !522, !523, !524, !525}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !516, file: !6, line: 883, baseType: !16, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !516, file: !6, line: 884, baseType: !38, size: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !516, file: !6, line: 885, baseType: !16, size: 32, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !516, file: !6, line: 886, baseType: !152, size: 64, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !516, file: !6, line: 887, baseType: !93, size: 64, offset: 256)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !516, file: !6, line: 888, baseType: !127, size: 64, offset: 320)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "new", scope: !516, file: !6, line: 892, baseType: !16, size: 32, offset: 384)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !516, file: !6, line: 894, baseType: !16, size: 32, offset: 416)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "xclient", scope: !157, file: !6, line: 1002, baseType: !527, size: 768)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "XClientMessageEvent", file: !6, line: 910, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 897, size: 768, elements: !529)
!529 = !{!530, !531, !532, !533, !534, !535, !536, !537}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !528, file: !6, line: 898, baseType: !16, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !528, file: !6, line: 899, baseType: !38, size: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !528, file: !6, line: 900, baseType: !16, size: 32, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !528, file: !6, line: 901, baseType: !152, size: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !528, file: !6, line: 902, baseType: !93, size: 64, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "message_type", scope: !528, file: !6, line: 903, baseType: !473, size: 64, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !528, file: !6, line: 904, baseType: !16, size: 32, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !528, file: !6, line: 909, baseType: !538, size: 320, offset: 448)
!538 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !528, file: !6, line: 905, size: 320, elements: !539)
!539 = !{!540, !544, !549}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !538, file: !6, line: 906, baseType: !541, size: 160)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 160, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 20)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !538, file: !6, line: 907, baseType: !545, size: 160)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 160, elements: !547)
!546 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!547 = !{!548}
!548 = !DISubrange(count: 10)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !538, file: !6, line: 908, baseType: !550, size: 320)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 320, elements: !551)
!551 = !{!552}
!552 = !DISubrange(count: 5)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "xmapping", scope: !157, file: !6, line: 1003, baseType: !554, size: 448)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMappingEvent", file: !6, line: 922, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 912, size: 448, elements: !556)
!556 = !{!557, !558, !559, !560, !561, !562, !563, !564}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !555, file: !6, line: 913, baseType: !16, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !555, file: !6, line: 914, baseType: !38, size: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !555, file: !6, line: 915, baseType: !16, size: 32, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !555, file: !6, line: 916, baseType: !152, size: 64, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !555, file: !6, line: 917, baseType: !93, size: 64, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !555, file: !6, line: 918, baseType: !16, size: 32, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "first_keycode", scope: !555, file: !6, line: 920, baseType: !16, size: 32, offset: 352)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !555, file: !6, line: 921, baseType: !16, size: 32, offset: 384)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "xerror", scope: !157, file: !6, line: 1004, baseType: !566, size: 320)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "XErrorEvent", file: !6, line: 932, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 924, size: 320, elements: !568)
!568 = !{!569, !570, !571, !572, !573, !575, !576}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !567, file: !6, line: 925, baseType: !16, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !567, file: !6, line: 926, baseType: !152, size: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "resourceid", scope: !567, file: !6, line: 927, baseType: !36, size: 64, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !567, file: !6, line: 928, baseType: !38, size: 64, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "error_code", scope: !567, file: !6, line: 929, baseType: !574, size: 8, offset: 256)
!574 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "request_code", scope: !567, file: !6, line: 930, baseType: !574, size: 8, offset: 264)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "minor_code", scope: !567, file: !6, line: 931, baseType: !574, size: 8, offset: 272)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "xkeymap", scope: !157, file: !6, line: 1005, baseType: !578, size: 576)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "XKeymapEvent", file: !6, line: 660, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 653, size: 576, elements: !580)
!580 = !{!581, !582, !583, !584, !585, !586}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !579, file: !6, line: 654, baseType: !16, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !579, file: !6, line: 655, baseType: !38, size: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !579, file: !6, line: 656, baseType: !16, size: 32, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !579, file: !6, line: 657, baseType: !152, size: 64, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !579, file: !6, line: 658, baseType: !93, size: 64, offset: 256)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "key_vector", scope: !579, file: !6, line: 659, baseType: !587, size: 256, offset: 320)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 256, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "xgeneric", scope: !157, file: !6, line: 1006, baseType: !591, size: 320)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "XGenericEvent", file: !6, line: 956, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 948, size: 320, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !592, file: !6, line: 950, baseType: !16, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !592, file: !6, line: 951, baseType: !38, size: 64, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !592, file: !6, line: 952, baseType: !16, size: 32, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !592, file: !6, line: 953, baseType: !152, size: 64, offset: 192)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !592, file: !6, line: 954, baseType: !16, size: 32, offset: 256)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "evtype", scope: !592, file: !6, line: 955, baseType: !16, size: 32, offset: 288)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "xcookie", scope: !157, file: !6, line: 1007, baseType: !601, size: 448)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "XGenericEventCookie", file: !6, line: 967, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 958, size: 448, elements: !603)
!603 = !{!604, !605, !606, !607, !608, !609, !610, !611}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !602, file: !6, line: 959, baseType: !16, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !602, file: !6, line: 960, baseType: !38, size: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !602, file: !6, line: 961, baseType: !16, size: 32, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !602, file: !6, line: 962, baseType: !152, size: 64, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !602, file: !6, line: 963, baseType: !16, size: 32, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "evtype", scope: !602, file: !6, line: 964, baseType: !16, size: 32, offset: 288)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !602, file: !6, line: 965, baseType: !74, size: 32, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !602, file: !6, line: 966, baseType: !4, size: 64, offset: 384)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !157, file: !6, line: 1008, baseType: !613, size: 1536)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 1536, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 24)
!616 = !DILocation(line: 9, column: 10, scope: !148)
!617 = !DILocation(line: 11, column: 7, scope: !148)
!618 = !DILocation(line: 11, column: 5, scope: !148)
!619 = !DILocation(line: 12, column: 8, scope: !620)
!620 = distinct !DILexicalBlock(scope: !148, file: !1, line: 12, column: 8)
!621 = !DILocation(line: 12, column: 10, scope: !620)
!622 = !DILocation(line: 12, column: 8, scope: !148)
!623 = !{!"if"}
!624 = !DILocation(line: 14, column: 14, scope: !625)
!625 = distinct !DILexicalBlock(scope: !620, file: !1, line: 12, column: 20)
!626 = !DILocation(line: 14, column: 34, scope: !625)
!627 = !DILocation(line: 14, column: 37, scope: !625)
!628 = !DILocation(line: 14, column: 17, scope: !625)
!629 = !DILocation(line: 16, column: 7, scope: !625)
!630 = !DILocation(line: 14, column: 5, scope: !625)
!631 = !DILocation(line: 17, column: 14, scope: !625)
!632 = !DILocation(line: 17, column: 34, scope: !625)
!633 = !DILocation(line: 17, column: 37, scope: !625)
!634 = !DILocation(line: 17, column: 17, scope: !625)
!635 = !DILocation(line: 19, column: 7, scope: !625)
!636 = !DILocation(line: 17, column: 5, scope: !625)
!637 = !DILocation(line: 21, column: 5, scope: !625)
!638 = !DILocation(line: 23, column: 18, scope: !639)
!639 = distinct !DILexicalBlock(scope: !640, file: !1, line: 22, column: 5)
!640 = distinct !DILexicalBlock(scope: !641, file: !1, line: 21, column: 5)
!641 = distinct !DILexicalBlock(scope: !625, file: !1, line: 21, column: 5)
!642 = !DILocation(line: 23, column: 7, scope: !639)
!643 = !DILocation(line: 24, column: 18, scope: !644)
!644 = distinct !DILexicalBlock(scope: !639, file: !1, line: 24, column: 12)
!645 = !DILocation(line: 24, column: 23, scope: !644)
!646 = !DILocation(line: 24, column: 12, scope: !639)
!647 = !DILocalVariable(name: "s", scope: !648, file: !1, line: 25, type: !649)
!648 = distinct !DILexicalBlock(scope: !644, file: !1, line: 24, column: 37)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "KeySym", file: !37, line: 106, baseType: !36)
!650 = !DILocation(line: 25, column: 9, scope: !648)
!651 = !DILocation(line: 25, column: 34, scope: !648)
!652 = !DILocation(line: 25, column: 13, scope: !648)
!653 = !DILocation(line: 26, column: 7, scope: !654)
!654 = distinct !DILexicalBlock(scope: !648, file: !1, line: 26, column: 7)
!655 = !DILocation(line: 26, column: 9, scope: !654)
!656 = !DILocation(line: 26, column: 7, scope: !648)
!657 = !DILocation(line: 27, column: 4, scope: !658)
!658 = distinct !DILexicalBlock(scope: !654, file: !1, line: 26, column: 20)
!659 = !DILocation(line: 28, column: 2, scope: !658)
!660 = !DILocation(line: 28, column: 14, scope: !661)
!661 = distinct !DILexicalBlock(scope: !654, file: !1, line: 28, column: 14)
!662 = !DILocation(line: 28, column: 16, scope: !661)
!663 = !DILocation(line: 28, column: 14, scope: !654)
!664 = !DILocation(line: 29, column: 4, scope: !665)
!665 = distinct !DILexicalBlock(scope: !661, file: !1, line: 28, column: 27)
!666 = !DILocation(line: 31, column: 7, scope: !648)
!667 = !DILocation(line: 21, column: 5, scope: !640)
!668 = distinct !{!668, !669, !670}
!669 = !DILocation(line: 21, column: 5, scope: !641)
!670 = !DILocation(line: 32, column: 5, scope: !641)
!671 = !DILocation(line: 34, column: 16, scope: !625)
!672 = !DILocation(line: 34, column: 36, scope: !625)
!673 = !DILocation(line: 34, column: 39, scope: !625)
!674 = !DILocation(line: 34, column: 19, scope: !625)
!675 = !DILocation(line: 34, column: 73, scope: !625)
!676 = !DILocation(line: 34, column: 5, scope: !625)
!677 = !DILocation(line: 35, column: 16, scope: !625)
!678 = !DILocation(line: 35, column: 36, scope: !625)
