; ModuleID = 'bitmap-flood-fill-1.ll'
source_filename = "bitmap-flood-fill-1.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@height = internal global i32 0, align 4, !dbg !0
@width = internal global i32 0, align 4, !dbg !6
@bitmap = internal global [2048 x [2048 x i8]] zeroinitializer, align 16, !dbg !9
@oldColor = internal global i8 0, align 1, !dbg !15
@newColor = internal global i8 0, align 1, !dbg !17
@.str = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.1 = private unnamed_addr constant [4 x i8] c"%1d\00", align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"P1\0A\00", align 1
@.str.3 = private unnamed_addr constant [7 x i8] c"%d %d\0A\00", align 1
@.str.4 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1
@stdin = external dso_local global %struct._IO_FILE*, align 8
@stdout = external dso_local global %struct._IO_FILE*, align 8

; Function Attrs: noinline nounwind uwtable
define dso_local void @floodFill(i32 %i, i32 %j) #0 !dbg !23 {
entry:

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "height", scope: !2, file: !3, line: 27, type: !8, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "bitmap-flood-fill-1.c", directory: "/scratch/yc0769/xstack_benchmark/rosetta/Bitmap-Flood-fill")
!4 = !{}
!5 = !{!6, !0, !9, !15, !17}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "width", scope: !2, file: !3, line: 27, type: !8, isLocal: true, isDefinition: true)
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "bitmap", scope: !2, file: !3, line: 28, type: !11, isLocal: true, isDefinition: true)
!11 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 33554432, elements: !13)
!12 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!13 = !{!14, !14}
!14 = !DISubrange(count: 2048)
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "oldColor", scope: !2, file: !3, line: 29, type: !12, isLocal: true, isDefinition: true)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "newColor", scope: !2, file: !3, line: 30, type: !12, isLocal: true, isDefinition: true)
!19 = !{i32 7, !"Dwarf Version", i32 4}
!20 = !{i32 2, !"Debug Info Version", i32 3}
!21 = !{i32 1, !"wchar_size", i32 4}
!22 = !{!"clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!23 = distinct !DISubprogram(name: "floodFill", scope: !3, file: !3, line: 32, type: !24, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!24 = !DISubroutineType(types: !25)
!25 = !{null, !8, !8}
!26 = !DILocalVariable(name: "i", arg: 1, scope: !23, file: !3, line: 32, type: !8)
!27 = !DILocation(line: 0, scope: !23)
!28 = !DILocalVariable(name: "j", arg: 2, scope: !23, file: !3, line: 32, type: !8)
!29 = !DILocation(line: 34, column: 12, scope: !30)
!30 = distinct !DILexicalBlock(scope: !23, file: !3, line: 34, column: 10)
!31 = !DILocation(line: 34, column: 17, scope: !30)
!32 = !DILocation(line: 34, column: 24, scope: !30)
!33 = !DILocation(line: 34, column: 22, scope: !30)
!34 = !DILocation(line: 35, column: 5, scope: !30)
!35 = !DILocation(line: 35, column: 12, scope: !30)
!36 = !DILocation(line: 35, column: 17, scope: !30)
!37 = !DILocation(line: 35, column: 24, scope: !30)
!38 = !DILocation(line: 35, column: 22, scope: !30)
!39 = !DILocation(line: 36, column: 5, scope: !30)
!40 = !DILocation(line: 36, column: 10, scope: !30)
!41 = !DILocation(line: 36, column: 26, scope: !30)
!42 = !DILocation(line: 36, column: 23, scope: !30)
!43 = !DILocation(line: 34, column: 10, scope: !23)
!44 = !DILocation(line: 38, column: 24, scope: !45)
!45 = distinct !DILexicalBlock(scope: !30, file: !3, line: 37, column: 5)
!46 = !DILocation(line: 38, column: 9, scope: !45)
!47 = !DILocation(line: 38, column: 22, scope: !45)
!48 = !DILocation(line: 39, column: 20, scope: !45)
!49 = !DILocation(line: 39, column: 9, scope: !45)
!50 = !DILocation(line: 40, column: 20, scope: !45)
!51 = !DILocation(line: 40, column: 9, scope: !45)
!52 = !DILocation(line: 41, column: 22, scope: !45)
!53 = !DILocation(line: 41, column: 9, scope: !45)
!54 = !DILocation(line: 42, column: 22, scope: !45)
!55 = !DILocation(line: 42, column: 9, scope: !45)
!56 = !DILocation(line: 43, column: 5, scope: !45)
!57 = !DILocation(line: 44, column: 1, scope: !23)
!58 = distinct !DISubprogram(name: "skipLine", scope: !3, file: !3, line: 50, type: !59, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !61}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !63, line: 7, baseType: !64)
!63 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !65, line: 49, size: 1728, elements: !66)
!65 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!66 = !{!67, !68, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !84, !86, !87, !88, !92, !94, !96, !100, !103, !105, !108, !111, !112, !114, !118, !119}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !64, file: !65, line: 51, baseType: !8, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !64, file: !65, line: 54, baseType: !69, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !64, file: !65, line: 55, baseType: !69, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !64, file: !65, line: 56, baseType: !69, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !64, file: !65, line: 57, baseType: !69, size: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !64, file: !65, line: 58, baseType: !69, size: 64, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !64, file: !65, line: 59, baseType: !69, size: 64, offset: 384)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !64, file: !65, line: 60, baseType: !69, size: 64, offset: 448)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !64, file: !65, line: 61, baseType: !69, size: 64, offset: 512)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !64, file: !65, line: 64, baseType: !69, size: 64, offset: 576)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !64, file: !65, line: 65, baseType: !69, size: 64, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !64, file: !65, line: 66, baseType: !69, size: 64, offset: 704)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !64, file: !65, line: 68, baseType: !82, size: 64, offset: 768)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !65, line: 36, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !64, file: !65, line: 70, baseType: !85, size: 64, offset: 832)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !64, file: !65, line: 72, baseType: !8, size: 32, offset: 896)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !64, file: !65, line: 73, baseType: !8, size: 32, offset: 928)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !64, file: !65, line: 74, baseType: !89, size: 64, offset: 960)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !90, line: 152, baseType: !91)
!90 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!91 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !64, file: !65, line: 77, baseType: !93, size: 16, offset: 1024)
!93 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !64, file: !65, line: 78, baseType: !95, size: 8, offset: 1040)
!95 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !64, file: !65, line: 79, baseType: !97, size: 8, offset: 1048)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 8, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 1)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !64, file: !65, line: 81, baseType: !101, size: 64, offset: 1088)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !65, line: 43, baseType: null)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !64, file: !65, line: 89, baseType: !104, size: 64, offset: 1152)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !90, line: 153, baseType: !91)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !64, file: !65, line: 91, baseType: !106, size: 64, offset: 1216)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !65, line: 37, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !64, file: !65, line: 92, baseType: !109, size: 64, offset: 1280)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !65, line: 38, flags: DIFlagFwdDecl)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !64, file: !65, line: 93, baseType: !85, size: 64, offset: 1344)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !64, file: !65, line: 94, baseType: !113, size: 64, offset: 1408)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !64, file: !65, line: 95, baseType: !115, size: 64, offset: 1472)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !116, line: 46, baseType: !117)
!116 = !DIFile(filename: "/u/NAS_SCRATCH/yc0769/xstack/xstack-installs/llvm-install-debug/lib/clang/10.0.1/include/stddef.h", directory: "")
!117 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !64, file: !65, line: 96, baseType: !8, size: 32, offset: 1536)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !64, file: !65, line: 98, baseType: !120, size: 160, offset: 1568)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 160, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 20)
!123 = !DILocalVariable(name: "file", arg: 1, scope: !58, file: !3, line: 50, type: !61)
!124 = !DILocation(line: 0, scope: !58)
!125 = !DILocation(line: 52, column: 5, scope: !58)
!126 = !DILocation(line: 52, column: 12, scope: !58)
!127 = !DILocation(line: 52, column: 25, scope: !58)
!128 = !DILocation(line: 52, column: 29, scope: !58)
!129 = !DILocation(line: 52, column: 40, scope: !58)
!130 = !DILocation(line: 52, column: 43, scope: !58)
!131 = !DILocation(line: 52, column: 55, scope: !58)
!132 = distinct !{!132, !125, !133}
!133 = !DILocation(line: 53, column: 9, scope: !58)
!134 = !DILocation(line: 54, column: 1, scope: !58)
!135 = distinct !DISubprogram(name: "skipCommentLines", scope: !3, file: !3, line: 56, type: !59, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!136 = !DILocalVariable(name: "file", arg: 1, scope: !135, file: !3, line: 56, type: !61)
!137 = !DILocation(line: 0, scope: !135)
!138 = !DILocalVariable(name: "comment", scope: !135, file: !3, line: 59, type: !8)
!139 = !DILocation(line: 61, column: 5, scope: !135)
!140 = !DILocation(line: 61, column: 17, scope: !135)
!141 = !DILocalVariable(name: "c", scope: !135, file: !3, line: 58, type: !8)
!142 = !DILocation(line: 61, column: 30, scope: !135)
!143 = !DILocation(line: 62, column: 9, scope: !135)
!144 = distinct !{!144, !139, !145}
!145 = !DILocation(line: 62, column: 22, scope: !135)
!146 = !DILocation(line: 63, column: 5, scope: !135)
!147 = !DILocation(line: 64, column: 1, scope: !135)
!148 = distinct !DISubprogram(name: "readPortableBitMap", scope: !3, file: !3, line: 66, type: !149, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!149 = !DISubroutineType(types: !150)
!150 = !{!8, !61}
!151 = !DILocalVariable(name: "file", arg: 1, scope: !148, file: !3, line: 66, type: !61)
!152 = !DILocation(line: 0, scope: !148)
!153 = !DILocation(line: 70, column: 5, scope: !148)
!154 = !DILocation(line: 71, column: 5, scope: !148)
!155 = !DILocation(line: 71, column: 30, scope: !148)
!156 = !DILocation(line: 72, column: 5, scope: !148)
!157 = !DILocation(line: 72, column: 30, scope: !148)
!158 = !DILocation(line: 73, column: 5, scope: !148)
!159 = !DILocation(line: 75, column: 10, scope: !160)
!160 = distinct !DILexicalBlock(scope: !148, file: !3, line: 75, column: 10)
!161 = !DILocation(line: 75, column: 16, scope: !160)
!162 = !DILocation(line: 75, column: 27, scope: !160)
!163 = !DILocation(line: 75, column: 30, scope: !160)
!164 = !DILocation(line: 75, column: 37, scope: !160)
!165 = !DILocation(line: 75, column: 10, scope: !148)
!166 = !DILocalVariable(name: "i", scope: !148, file: !3, line: 68, type: !8)
!167 = !DILocation(line: 76, column: 15, scope: !168)
!168 = distinct !DILexicalBlock(scope: !160, file: !3, line: 76, column: 9)
!169 = !DILocation(line: 0, scope: !168)
!170 = !DILocation(line: 76, column: 26, scope: !171)
!171 = distinct !DILexicalBlock(scope: !168, file: !3, line: 76, column: 9)
!172 = !DILocation(line: 76, column: 24, scope: !171)
!173 = !DILocation(line: 76, column: 9, scope: !168)
!174 = !DILocalVariable(name: "j", scope: !148, file: !3, line: 68, type: !8)
!175 = !DILocation(line: 77, column: 19, scope: !176)
!176 = distinct !DILexicalBlock(scope: !171, file: !3, line: 77, column: 13)
!177 = !DILocation(line: 0, scope: !176)
!178 = !DILocation(line: 77, column: 30, scope: !179)
!179 = distinct !DILexicalBlock(scope: !176, file: !3, line: 77, column: 13)
!180 = !DILocation(line: 77, column: 28, scope: !179)
!181 = !DILocation(line: 77, column: 13, scope: !176)
!182 = !DILocation(line: 78, column: 37, scope: !179)
!183 = !DILocation(line: 78, column: 17, scope: !179)
