; ModuleID = 'bitmap-flood-fill-1.ll'
source_filename = "bitmap-flood-fill-1.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@height = internal global i32 0, align 4, !dbg !0
@width = internal global i32 0, align 4, !dbg !6
@bitmap = internal global [2048 x [2048 x i8]] zeroinitializer, align 16, !dbg !9
@oldColor = internal global i8 0, align 1, !dbg !15
@newColor = internal global i8 0, align 1, !dbg !17
@.str = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.1 = private unnamed_addr constant [4 x i8] c"%1d\00", align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"P1\0A\00", align 1
@.str.3 = private unnamed_addr constant [7 x i8] c"%d %d\0A\00", align 1
@.str.4 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1
@stdin = external dso_local global %struct._IO_FILE*, align 8
@stdout = external dso_local global %struct._IO_FILE*, align 8

; Function Attrs: noinline nounwind uwtable
define dso_local void @floodFill(i32 %i, i32 %j) #0 !dbg !23 {
entry:
  %i.addr = alloca i32, align 4

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "height", scope: !2, file: !3, line: 27, type: !8, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "bitmap-flood-fill-1.c", directory: "/scratch/yc0769/xstack_benchmark/rosetta/Bitmap-Flood-fill")
!4 = !{}
!5 = !{!6, !0, !9, !15, !17}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "width", scope: !2, file: !3, line: 27, type: !8, isLocal: true, isDefinition: true)
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "bitmap", scope: !2, file: !3, line: 28, type: !11, isLocal: true, isDefinition: true)
!11 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 33554432, elements: !13)
!12 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!13 = !{!14, !14}
!14 = !DISubrange(count: 2048)
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "oldColor", scope: !2, file: !3, line: 29, type: !12, isLocal: true, isDefinition: true)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "newColor", scope: !2, file: !3, line: 30, type: !12, isLocal: true, isDefinition: true)
!19 = !{i32 7, !"Dwarf Version", i32 4}
!20 = !{i32 2, !"Debug Info Version", i32 3}
!21 = !{i32 1, !"wchar_size", i32 4}
!22 = !{!"clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!23 = distinct !DISubprogram(name: "floodFill", scope: !3, file: !3, line: 32, type: !24, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!24 = !DISubroutineType(types: !25)
!25 = !{null, !8, !8}
!26 = !DILocalVariable(name: "i", arg: 1, scope: !23, file: !3, line: 32, type: !8)
!27 = !DILocation(line: 32, column: 20, scope: !23)
!28 = !DILocalVariable(name: "j", arg: 2, scope: !23, file: !3, line: 32, type: !8)
!29 = !DILocation(line: 32, column: 27, scope: !23)
!30 = !DILocation(line: 34, column: 15, scope: !31)
!31 = distinct !DILexicalBlock(scope: !23, file: !3, line: 34, column: 10)
!32 = !DILocation(line: 34, column: 12, scope: !31)
!33 = !DILocation(line: 34, column: 17, scope: !31)
!34 = !DILocation(line: 34, column: 20, scope: !31)
!35 = !DILocation(line: 34, column: 24, scope: !31)
!36 = !DILocation(line: 34, column: 22, scope: !31)
!37 = !DILocation(line: 35, column: 5, scope: !31)
!38 = !DILocation(line: 35, column: 15, scope: !31)
!39 = !DILocation(line: 35, column: 12, scope: !31)
!40 = !DILocation(line: 35, column: 17, scope: !31)
!41 = !DILocation(line: 35, column: 20, scope: !31)
!42 = !DILocation(line: 35, column: 24, scope: !31)
!43 = !DILocation(line: 35, column: 22, scope: !31)
!44 = !DILocation(line: 36, column: 5, scope: !31)
!45 = !DILocation(line: 36, column: 17, scope: !31)
!46 = !DILocation(line: 36, column: 10, scope: !31)
!47 = !DILocation(line: 36, column: 20, scope: !31)
!48 = !DILocation(line: 36, column: 26, scope: !31)
!49 = !DILocation(line: 36, column: 23, scope: !31)
!50 = !DILocation(line: 34, column: 10, scope: !23)
!51 = !DILocation(line: 38, column: 24, scope: !52)
!52 = distinct !DILexicalBlock(scope: !31, file: !3, line: 37, column: 5)
!53 = !DILocation(line: 38, column: 16, scope: !52)
!54 = !DILocation(line: 38, column: 9, scope: !52)
!55 = !DILocation(line: 38, column: 19, scope: !52)
!56 = !DILocation(line: 38, column: 22, scope: !52)
!57 = !DILocation(line: 39, column: 19, scope: !52)
!58 = !DILocation(line: 39, column: 20, scope: !52)
!59 = !DILocation(line: 39, column: 23, scope: !52)
!60 = !DILocation(line: 39, column: 9, scope: !52)
!61 = !DILocation(line: 40, column: 19, scope: !52)
!62 = !DILocation(line: 40, column: 20, scope: !52)
!63 = !DILocation(line: 40, column: 23, scope: !52)
!64 = !DILocation(line: 40, column: 9, scope: !52)
!65 = !DILocation(line: 41, column: 19, scope: !52)
!66 = !DILocation(line: 41, column: 21, scope: !52)
!67 = !DILocation(line: 41, column: 22, scope: !52)
!68 = !DILocation(line: 41, column: 9, scope: !52)
!69 = !DILocation(line: 42, column: 19, scope: !52)
!70 = !DILocation(line: 42, column: 21, scope: !52)
!71 = !DILocation(line: 42, column: 22, scope: !52)
!72 = !DILocation(line: 42, column: 9, scope: !52)
!73 = !DILocation(line: 43, column: 5, scope: !52)
!74 = !DILocation(line: 44, column: 1, scope: !23)
!75 = distinct !DISubprogram(name: "skipLine", scope: !3, file: !3, line: 50, type: !76, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!76 = !DISubroutineType(types: !77)
!77 = !{null, !78}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !80, line: 7, baseType: !81)
!80 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !82, line: 49, size: 1728, elements: !83)
!82 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!83 = !{!84, !85, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !101, !103, !104, !105, !109, !111, !113, !117, !120, !122, !125, !128, !129, !131, !135, !136}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !81, file: !82, line: 51, baseType: !8, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !81, file: !82, line: 54, baseType: !86, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !81, file: !82, line: 55, baseType: !86, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !81, file: !82, line: 56, baseType: !86, size: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !81, file: !82, line: 57, baseType: !86, size: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !81, file: !82, line: 58, baseType: !86, size: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !81, file: !82, line: 59, baseType: !86, size: 64, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !81, file: !82, line: 60, baseType: !86, size: 64, offset: 448)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !81, file: !82, line: 61, baseType: !86, size: 64, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !81, file: !82, line: 64, baseType: !86, size: 64, offset: 576)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !81, file: !82, line: 65, baseType: !86, size: 64, offset: 640)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !81, file: !82, line: 66, baseType: !86, size: 64, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !81, file: !82, line: 68, baseType: !99, size: 64, offset: 768)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !82, line: 36, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !81, file: !82, line: 70, baseType: !102, size: 64, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !81, file: !82, line: 72, baseType: !8, size: 32, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !81, file: !82, line: 73, baseType: !8, size: 32, offset: 928)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !81, file: !82, line: 74, baseType: !106, size: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !107, line: 152, baseType: !108)
!107 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!108 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !81, file: !82, line: 77, baseType: !110, size: 16, offset: 1024)
!110 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !81, file: !82, line: 78, baseType: !112, size: 8, offset: 1040)
!112 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !81, file: !82, line: 79, baseType: !114, size: 8, offset: 1048)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 8, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 1)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !81, file: !82, line: 81, baseType: !118, size: 64, offset: 1088)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !82, line: 43, baseType: null)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !81, file: !82, line: 89, baseType: !121, size: 64, offset: 1152)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !107, line: 153, baseType: !108)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !81, file: !82, line: 91, baseType: !123, size: 64, offset: 1216)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !82, line: 37, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !81, file: !82, line: 92, baseType: !126, size: 64, offset: 1280)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !82, line: 38, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !81, file: !82, line: 93, baseType: !102, size: 64, offset: 1344)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !81, file: !82, line: 94, baseType: !130, size: 64, offset: 1408)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !81, file: !82, line: 95, baseType: !132, size: 64, offset: 1472)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !133, line: 46, baseType: !134)
!133 = !DIFile(filename: "/u/NAS_SCRATCH/yc0769/xstack/xstack-installs/llvm-install-debug/lib/clang/10.0.1/include/stddef.h", directory: "")
!134 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !81, file: !82, line: 96, baseType: !8, size: 32, offset: 1536)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !81, file: !82, line: 98, baseType: !137, size: 160, offset: 1568)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 160, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 20)
!140 = !DILocalVariable(name: "file", arg: 1, scope: !75, file: !3, line: 50, type: !78)
!141 = !DILocation(line: 50, column: 21, scope: !75)
!142 = !DILocation(line: 52, column: 5, scope: !75)
!143 = !DILocation(line: 52, column: 19, scope: !75)
!144 = !DILocation(line: 52, column: 12, scope: !75)
!145 = !DILocation(line: 52, column: 25, scope: !75)
!146 = !DILocation(line: 52, column: 34, scope: !75)
!147 = !DILocation(line: 52, column: 29, scope: !75)
!148 = !DILocation(line: 52, column: 40, scope: !75)
!149 = !DILocation(line: 52, column: 49, scope: !75)
!150 = !DILocation(line: 52, column: 43, scope: !75)
!151 = !DILocation(line: 52, column: 55, scope: !75)
!152 = !DILocation(line: 0, scope: !75)
!153 = distinct !{!153, !142, !154}
!154 = !DILocation(line: 53, column: 9, scope: !75)
!155 = !DILocation(line: 54, column: 1, scope: !75)
!156 = distinct !DISubprogram(name: "skipCommentLines", scope: !3, file: !3, line: 56, type: !76, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!157 = !DILocalVariable(name: "file", arg: 1, scope: !156, file: !3, line: 56, type: !78)
!158 = !DILocation(line: 56, column: 29, scope: !156)
!159 = !DILocalVariable(name: "c", scope: !156, file: !3, line: 58, type: !8)
!160 = !DILocation(line: 58, column: 9, scope: !156)
!161 = !DILocalVariable(name: "comment", scope: !156, file: !3, line: 59, type: !8)
!162 = !DILocation(line: 59, column: 9, scope: !156)
!163 = !DILocation(line: 61, column: 5, scope: !156)
!164 = !DILocation(line: 61, column: 23, scope: !156)
!165 = !DILocation(line: 61, column: 17, scope: !156)
!166 = !DILocation(line: 61, column: 15, scope: !156)
!167 = !DILocation(line: 61, column: 33, scope: !156)
!168 = !DILocation(line: 61, column: 30, scope: !156)
!169 = !DILocation(line: 62, column: 18, scope: !156)
!170 = !DILocation(line: 62, column: 9, scope: !156)
!171 = distinct !{!171, !163, !172}
!172 = !DILocation(line: 62, column: 22, scope: !156)
!173 = !DILocation(line: 63, column: 12, scope: !156)
!174 = !DILocation(line: 63, column: 14, scope: !156)
!175 = !DILocation(line: 63, column: 5, scope: !156)
!176 = !DILocation(line: 64, column: 1, scope: !156)
!177 = distinct !DISubprogram(name: "readPortableBitMap", scope: !3, file: !3, line: 66, type: !178, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!178 = !DISubroutineType(types: !179)
!179 = !{!8, !78}
!180 = !DILocalVariable(name: "file", arg: 1, scope: !177, file: !3, line: 66, type: !78)
!181 = !DILocation(line: 66, column: 26, scope: !177)
!182 = !DILocalVariable(name: "i", scope: !177, file: !3, line: 68, type: !8)
!183 = !DILocation(line: 68, column: 9, scope: !177)
!184 = !DILocalVariable(name: "j", scope: !177, file: !3, line: 68, type: !8)
!185 = !DILocation(line: 68, column: 11, scope: !177)
!186 = !DILocation(line: 70, column: 14, scope: !177)
!187 = !DILocation(line: 70, column: 5, scope: !177)
!188 = !DILocation(line: 71, column: 22, scope: !177)
!189 = !DILocation(line: 71, column: 5, scope: !177)
!190 = !DILocation(line: 71, column: 37, scope: !177)
!191 = !DILocation(line: 71, column: 30, scope: !177)
!192 = !DILocation(line: 72, column: 22, scope: !177)
!193 = !DILocation(line: 72, column: 5, scope: !177)
!194 = !DILocation(line: 72, column: 37, scope: !177)
!195 = !DILocation(line: 72, column: 30, scope: !177)
!196 = !DILocation(line: 73, column: 22, scope: !177)
!197 = !DILocation(line: 73, column: 5, scope: !177)
!198 = !DILocation(line: 75, column: 10, scope: !199)
!199 = distinct !DILexicalBlock(scope: !177, file: !3, line: 75, column: 10)
!200 = !DILocation(line: 75, column: 16, scope: !199)
!201 = !DILocation(line: 75, column: 27, scope: !199)
