; ModuleID = 'last-letter-first-letter-2.c'
source_filename = "last-letter-first-letter-2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.node = type { [26 x %struct.edge*], i32, i32, [26 x i32], [26 x i32] }
%struct.edge = type { i8, i8, i8*, %struct.edge* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.chain = type { %struct.edge*, %struct.edge*, i32, [26 x i32] }

@nodes = common dso_local global [26 x %struct.node] zeroinitializer, align 16, !dbg !0
@.str = private unnamed_addr constant [8 x i8] c"poke646\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"rt\00", align 1
@n_names = common dso_local global i32 0, align 4, !dbg !41
@tmp = common dso_local global %struct.edge** null, align 8, !dbg !38
@names = common dso_local global %struct.edge* null, align 8, !dbg !25
@.str.2 = private unnamed_addr constant [45 x i8] c"bad name %s: first/last char must be letter\0A\00", align 1
@.str.3 = private unnamed_addr constant [15 x i8] c"read %d names\0A\00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"%d:\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "nodes", scope: !2, file: !3, line: 11, type: !43, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git 078de928eea94413164fbdff5fab7bdcf0f60aa7)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !24, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "last-letter-first-letter-2.c", directory: "/scratch/yc0769/xstack_benchmark/rosetta/Last-letter-first-letter")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23}
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!24 = !{!0, !25, !38, !41}
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "names", scope: !2, file: !3, line: 12, type: !27, isLocal: false, isDefinition: true)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !3, line: 7, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge", file: !3, line: 7, size: 192, elements: !30)
!30 = !{!31, !33, !34, !36}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !29, file: !3, line: 7, baseType: !32, size: 8)
!32 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !29, file: !3, line: 7, baseType: !32, size: 8, offset: 8)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !29, file: !3, line: 7, baseType: !35, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "lnk", scope: !29, file: !3, line: 7, baseType: !37, size: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "tmp", scope: !2, file: !3, line: 12, type: !40, isLocal: false, isDefinition: true)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "n_names", scope: !2, file: !3, line: 13, type: !22, isLocal: false, isDefinition: true)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 88192, elements: !49)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "node", file: !3, line: 8, baseType: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 8, size: 3392, elements: !46)
!46 = !{!47, !51, !52, !53, !55}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !45, file: !3, line: 8, baseType: !48, size: 1664)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1664, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 26)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "nin", scope: !45, file: !3, line: 8, baseType: !22, size: 32, offset: 1664)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "nout", scope: !45, file: !3, line: 8, baseType: !22, size: 32, offset: 1696)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !45, file: !3, line: 8, baseType: !54, size: 832, offset: 1728)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 832, elements: !49)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !45, file: !3, line: 8, baseType: !54, size: 832, offset: 2560)
!56 = !{i32 7, !"Dwarf Version", i32 4}
!57 = !{i32 2, !"Debug Info Version", i32 3}
!58 = !{i32 1, !"wchar_size", i32 4}
!59 = !{!"clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git 078de928eea94413164fbdff5fab7bdcf0f60aa7)"}
!60 = distinct !DISubprogram(name: "store_edge", scope: !3, file: !3, line: 16, type: !61, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !63)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !27}
!63 = !{}
!64 = !DILocalVariable(name: "g", arg: 1, scope: !60, file: !3, line: 16, type: !27)
!65 = !DILocation(line: 16, column: 23, scope: !60)
!66 = !DILocation(line: 18, column: 7, scope: !67)
!67 = distinct !DILexicalBlock(scope: !60, file: !3, line: 18, column: 6)
!68 = !DILocation(line: 18, column: 6, scope: !60)
!69 = !{!"if"}
!70 = !DILocation(line: 18, column: 10, scope: !67)
!71 = !DILocalVariable(name: "i", scope: !60, file: !3, line: 19, type: !22)
!72 = !DILocation(line: 19, column: 6, scope: !60)
!73 = !DILocation(line: 19, column: 10, scope: !60)
!74 = !DILocation(line: 19, column: 13, scope: !60)
!75 = !DILocalVariable(name: "j", scope: !60, file: !3, line: 19, type: !22)
!76 = !DILocation(line: 19, column: 16, scope: !60)
!77 = !DILocation(line: 19, column: 20, scope: !60)
!78 = !DILocation(line: 19, column: 23, scope: !60)
!79 = !DILocalVariable(name: "n", scope: !60, file: !3, line: 20, type: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!81 = !DILocation(line: 20, column: 8, scope: !60)
!82 = !DILocation(line: 20, column: 20, scope: !60)
!83 = !DILocation(line: 20, column: 18, scope: !60)
!84 = !DILocation(line: 22, column: 11, scope: !60)
!85 = !DILocation(line: 22, column: 14, scope: !60)
!86 = !DILocation(line: 22, column: 16, scope: !60)
!87 = !DILocation(line: 22, column: 2, scope: !60)
!88 = !DILocation(line: 22, column: 5, scope: !60)
!89 = !DILocation(line: 22, column: 9, scope: !60)
!90 = !DILocation(line: 24, column: 12, scope: !60)
!91 = !DILocation(line: 24, column: 2, scope: !60)
!92 = !DILocation(line: 24, column: 5, scope: !60)
!93 = !DILocation(line: 24, column: 7, scope: !60)
!94 = !DILocation(line: 24, column: 10, scope: !60)
!95 = !DILocation(line: 24, column: 15, scope: !60)
!96 = !DILocation(line: 24, column: 18, scope: !60)
!97 = !DILocation(line: 24, column: 22, scope: !60)
!98 = !DILocation(line: 24, column: 24, scope: !60)
!99 = !DILocation(line: 24, column: 28, scope: !60)
!100 = !DILocation(line: 24, column: 31, scope: !60)
!101 = !DILocation(line: 24, column: 35, scope: !60)
!102 = !DILocation(line: 25, column: 14, scope: !60)
!103 = !DILocation(line: 25, column: 12, scope: !60)
!104 = !DILocation(line: 25, column: 4, scope: !60)
!105 = !DILocation(line: 25, column: 17, scope: !60)
!106 = !DILocation(line: 25, column: 20, scope: !60)
!107 = !DILocation(line: 25, column: 23, scope: !60)
!108 = !DILocation(line: 25, column: 25, scope: !60)
!109 = !DILocation(line: 25, column: 29, scope: !60)
!110 = !DILocation(line: 25, column: 32, scope: !60)
!111 = !DILocation(line: 25, column: 35, scope: !60)
!112 = !DILocation(line: 26, column: 1, scope: !60)
!113 = distinct !DISubprogram(name: "remove_edge", scope: !3, file: !3, line: 29, type: !114, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !63)
!114 = !DISubroutineType(types: !115)
!115 = !{!27, !22, !22}
!116 = !DILocalVariable(name: "i", arg: 1, scope: !113, file: !3, line: 29, type: !22)
!117 = !DILocation(line: 29, column: 23, scope: !113)
!118 = !DILocalVariable(name: "j", arg: 2, scope: !113, file: !3, line: 29, type: !22)
!119 = !DILocation(line: 29, column: 30, scope: !113)
!120 = !DILocalVariable(name: "n", scope: !113, file: !3, line: 31, type: !80)
!121 = !DILocation(line: 31, column: 8, scope: !113)
!122 = !DILocation(line: 31, column: 20, scope: !113)
!123 = !DILocation(line: 31, column: 18, scope: !113)
!124 = !DILocalVariable(name: "g", scope: !113, file: !3, line: 32, type: !27)
!125 = !DILocation(line: 32, column: 8, scope: !113)
!126 = !DILocation(line: 32, column: 12, scope: !113)
!127 = !DILocation(line: 32, column: 15, scope: !113)
!128 = !DILocation(line: 32, column: 17, scope: !113)
!129 = !DILocation(line: 33, column: 6, scope: !130)
!130 = distinct !DILexicalBlock(scope: !113, file: !3, line: 33, column: 6)
!131 = !DILocation(line: 33, column: 6, scope: !113)
!132 = !DILocation(line: 34, column: 13, scope: !133)
!133 = distinct !DILexicalBlock(scope: !130, file: !3, line: 33, column: 9)
!134 = !DILocation(line: 34, column: 16, scope: !133)
!135 = !DILocation(line: 34, column: 3, scope: !133)
!136 = !DILocation(line: 34, column: 6, scope: !133)
!137 = !DILocation(line: 34, column: 8, scope: !133)
!138 = !DILocation(line: 34, column: 11, scope: !133)
!139 = !DILocation(line: 35, column: 3, scope: !133)
!140 = !DILocation(line: 35, column: 6, scope: !133)
!141 = !DILocation(line: 35, column: 10, scope: !133)
!142 = !DILocation(line: 36, column: 3, scope: !133)
!143 = !DILocation(line: 36, column: 6, scope: !133)
!144 = !DILocation(line: 36, column: 10, scope: !133)
!145 = !DILocation(line: 36, column: 12, scope: !133)
!146 = !DILocation(line: 36, column: 16, scope: !133)
!147 = !DILocation(line: 36, column: 19, scope: !133)
!148 = !DILocation(line: 36, column: 23, scope: !133)
!149 = !DILocation(line: 38, column: 15, scope: !133)
!150 = !DILocation(line: 38, column: 13, scope: !133)
!151 = !DILocation(line: 38, column: 5, scope: !133)
!152 = !DILocation(line: 39, column: 3, scope: !133)
!153 = !DILocation(line: 39, column: 6, scope: !133)
!154 = !DILocation(line: 39, column: 9, scope: !133)
!155 = !DILocation(line: 39, column: 11, scope: !133)
!156 = !DILocation(line: 40, column: 3, scope: !133)
!157 = !DILocation(line: 40, column: 6, scope: !133)
!158 = !DILocation(line: 40, column: 9, scope: !133)
!159 = !DILocation(line: 41, column: 2, scope: !133)
!160 = !DILocation(line: 42, column: 9, scope: !113)
!161 = !DILocation(line: 42, column: 2, scope: !113)
!162 = distinct !DISubprogram(name: "read_names", scope: !3, file: !3, line: 45, type: !163, scopeLine: 46, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !63)
!163 = !DISubroutineType(types: !164)
!164 = !{null}
!165 = !DILocalVariable(name: "fp", scope: !162, file: !3, line: 47, type: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !168, line: 7, baseType: !169)
!168 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !170, line: 49, size: 1728, elements: !171)
!170 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!171 = !{!172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !187, !189, !190, !191, !195, !196, !198, !202, !205, !207, !210, !213, !214, !216, !220, !221}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !169, file: !170, line: 51, baseType: !22, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !169, file: !170, line: 54, baseType: !35, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !169, file: !170, line: 55, baseType: !35, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !169, file: !170, line: 56, baseType: !35, size: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !169, file: !170, line: 57, baseType: !35, size: 64, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !169, file: !170, line: 58, baseType: !35, size: 64, offset: 320)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !169, file: !170, line: 59, baseType: !35, size: 64, offset: 384)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !169, file: !170, line: 60, baseType: !35, size: 64, offset: 448)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !169, file: !170, line: 61, baseType: !35, size: 64, offset: 512)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !169, file: !170, line: 64, baseType: !35, size: 64, offset: 576)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !169, file: !170, line: 65, baseType: !35, size: 64, offset: 640)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !169, file: !170, line: 66, baseType: !35, size: 64, offset: 704)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !169, file: !170, line: 68, baseType: !185, size: 64, offset: 768)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !170, line: 36, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !169, file: !170, line: 70, baseType: !188, size: 64, offset: 832)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !169, file: !170, line: 72, baseType: !22, size: 32, offset: 896)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !169, file: !170, line: 73, baseType: !22, size: 32, offset: 928)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !169, file: !170, line: 74, baseType: !192, size: 64, offset: 960)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !193, line: 152, baseType: !194)
!193 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!194 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !169, file: !170, line: 77, baseType: !23, size: 16, offset: 1024)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !169, file: !170, line: 78, baseType: !197, size: 8, offset: 1040)
!197 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !169, file: !170, line: 79, baseType: !199, size: 8, offset: 1048)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 8, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 1)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !169, file: !170, line: 81, baseType: !203, size: 64, offset: 1088)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !170, line: 43, baseType: null)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !169, file: !170, line: 89, baseType: !206, size: 64, offset: 1152)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !193, line: 153, baseType: !194)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !169, file: !170, line: 91, baseType: !208, size: 64, offset: 1216)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !170, line: 37, flags: DIFlagFwdDecl)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !169, file: !170, line: 92, baseType: !211, size: 64, offset: 1280)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !170, line: 38, flags: DIFlagFwdDecl)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !169, file: !170, line: 93, baseType: !188, size: 64, offset: 1344)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !169, file: !170, line: 94, baseType: !215, size: 64, offset: 1408)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !169, file: !170, line: 95, baseType: !217, size: 64, offset: 1472)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !218, line: 46, baseType: !219)
!218 = !DIFile(filename: "/u/NAS_SCRATCH/yc0769/xstack/llvm-install/lib/clang/10.0.1/include/stddef.h", directory: "")
!219 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !169, file: !170, line: 96, baseType: !22, size: 32, offset: 1536)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !169, file: !170, line: 98, baseType: !222, size: 160, offset: 1568)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 160, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 20)
!225 = !DILocation(line: 47, column: 8, scope: !162)
!226 = !DILocation(line: 47, column: 13, scope: !162)
!227 = !DILocalVariable(name: "i", scope: !162, file: !3, line: 48, type: !22)
!228 = !DILocation(line: 48, column: 6, scope: !162)
!229 = !DILocalVariable(name: "len", scope: !162, file: !3, line: 48, type: !22)
!230 = !DILocation(line: 48, column: 9, scope: !162)
!231 = !DILocalVariable(name: "buf", scope: !162, file: !3, line: 49, type: !35)
!232 = !DILocation(line: 49, column: 8, scope: !162)
!233 = !DILocalVariable(name: "p", scope: !162, file: !3, line: 50, type: !27)
!234 = !DILocation(line: 50, column: 8, scope: !162)
!235 = !DILocation(line: 52, column: 7, scope: !236)
!236 = distinct !DILexicalBlock(scope: !162, file: !3, line: 52, column: 6)
!237 = !DILocation(line: 52, column: 6, scope: !162)
!238 = !DILocation(line: 52, column: 11, scope: !236)
!239 = !DILocation(line: 54, column: 8, scope: !162)
!240 = !DILocation(line: 54, column: 2, scope: !162)
!241 = !DILocation(line: 55, column: 14, scope: !162)
!242 = !DILocation(line: 55, column: 8, scope: !162)
!243 = !DILocation(line: 55, column: 6, scope: !162)
!244 = !DILocation(line: 56, column: 15, scope: !162)
!245 = !DILocation(line: 56, column: 19, scope: !162)
!246 = !DILocation(line: 56, column: 8, scope: !162)
!247 = !DILocation(line: 56, column: 6, scope: !162)
!248 = !DILocation(line: 57, column: 8, scope: !162)
!249 = !DILocation(line: 57, column: 2, scope: !162)
!250 = !DILocation(line: 58, column: 8, scope: !162)
!251 = !DILocation(line: 58, column: 16, scope: !162)
!252 = !DILocation(line: 58, column: 21, scope: !162)
!253 = !DILocation(line: 58, column: 2, scope: !162)
!254 = !DILocation(line: 59, column: 9, scope: !162)
!255 = !DILocation(line: 59, column: 2, scope: !162)
!256 = !DILocation(line: 61, column: 2, scope: !162)
!257 = !DILocation(line: 61, column: 6, scope: !162)
!258 = !DILocation(line: 61, column: 11, scope: !162)
!259 = !DILocation(line: 62, column: 19, scope: !260)
!260 = distinct !DILexicalBlock(scope: !162, file: !3, line: 62, column: 2)
!261 = !DILocation(line: 62, column: 15, scope: !260)
!262 = !DILocation(line: 62, column: 7, scope: !260)
!263 = !DILocation(line: 62, column: 24, scope: !264)
!264 = distinct !DILexicalBlock(scope: !260, file: !3, line: 62, column: 2)
!265 = !DILocation(line: 62, column: 28, scope: !264)
!266 = !DILocation(line: 62, column: 26, scope: !264)
!267 = !DILocation(line: 62, column: 2, scope: !260)
!268 = !DILocation(line: 63, column: 7, scope: !269)
!269 = distinct !DILexicalBlock(scope: !264, file: !3, line: 63, column: 7)
!270 = !DILocation(line: 63, column: 7, scope: !264)
!271 = !DILocation(line: 64, column: 4, scope: !269)
!272 = !DILocation(line: 64, column: 8, scope: !269)
!273 = !DILocation(line: 64, column: 11, scope: !269)
!274 = !DILocation(line: 64, column: 23, scope: !269)
!275 = !DILocation(line: 62, column: 34, scope: !264)
!276 = !DILocation(line: 62, column: 2, scope: !264)
!277 = distinct !{!277, !267, !278}
!278 = !DILocation(line: 64, column: 23, scope: !260)
!279 = !DILocation(line: 66, column: 6, scope: !280)
!280 = distinct !DILexicalBlock(scope: !162, file: !3, line: 66, column: 6)
!281 = !DILocation(line: 66, column: 10, scope: !280)
!282 = !DILocation(line: 66, column: 13, scope: !280)
!283 = !DILocation(line: 66, column: 6, scope: !162)
!284 = !DILocation(line: 66, column: 25, scope: !280)
!285 = !DILocation(line: 66, column: 18, scope: !280)
!286 = !DILocation(line: 68, column: 2, scope: !162)
!287 = !DILocation(line: 69, column: 15, scope: !162)
!288 = !DILocation(line: 69, column: 8, scope: !162)
!289 = !DILocation(line: 69, column: 6, scope: !162)
!290 = !DILocation(line: 71, column: 36, scope: !162)
!291 = !DILocation(line: 71, column: 34, scope: !162)
!292 = !DILocation(line: 71, column: 14, scope: !162)
!293 = !DILocation(line: 71, column: 12, scope: !162)
!294 = !DILocation(line: 71, column: 4, scope: !162)
!295 = !DILocation(line: 72, column: 9, scope: !296)
!296 = distinct !DILexicalBlock(scope: !162, file: !3, line: 72, column: 2)
!297 = !DILocation(line: 72, column: 7, scope: !296)
!298 = !DILocation(line: 72, column: 14, scope: !299)
!299 = distinct !DILexicalBlock(scope: !296, file: !3, line: 72, column: 2)
!300 = !DILocation(line: 72, column: 18, scope: !299)
!301 = !DILocation(line: 72, column: 16, scope: !299)
!302 = !DILocation(line: 72, column: 2, scope: !296)
!303 = !DILocation(line: 73, column: 7, scope: !304)
!304 = distinct !DILexicalBlock(scope: !305, file: !3, line: 73, column: 7)
!305 = distinct !DILexicalBlock(scope: !299, file: !3, line: 72, column: 37)
!306 = !DILocation(line: 73, column: 7, scope: !305)
!307 = !DILocation(line: 73, column: 19, scope: !304)
!308 = !DILocation(line: 73, column: 25, scope: !304)
!309 = !DILocation(line: 73, column: 26, scope: !304)
!310 = !DILocation(line: 73, column: 30, scope: !304)
!311 = !DILocation(line: 73, column: 36, scope: !304)
!312 = !DILocation(line: 73, column: 34, scope: !304)
!313 = !DILocation(line: 73, column: 40, scope: !304)
!314 = !DILocation(line: 73, column: 10, scope: !304)
!315 = !DILocation(line: 73, column: 13, scope: !304)
!316 = !DILocation(line: 73, column: 17, scope: !304)
!317 = !DILocation(line: 74, column: 17, scope: !304)
!318 = !DILocation(line: 74, column: 8, scope: !304)
!319 = !DILocation(line: 74, column: 11, scope: !304)
!320 = !DILocation(line: 74, column: 15, scope: !304)
!321 = !DILocation(line: 76, column: 16, scope: !305)
!322 = !DILocation(line: 76, column: 19, scope: !305)
!323 = !DILocation(line: 76, column: 9, scope: !305)
!324 = !DILocation(line: 76, column: 7, scope: !305)
!325 = !DILocation(line: 77, column: 10, scope: !305)
!326 = !DILocation(line: 77, column: 13, scope: !305)
!327 = !DILocation(line: 77, column: 20, scope: !305)
!328 = !DILocation(line: 77, column: 3, scope: !305)
!329 = !DILocation(line: 77, column: 6, scope: !305)
!330 = !DILocation(line: 77, column: 8, scope: !305)
!331 = !DILocation(line: 78, column: 10, scope: !305)
!332 = !DILocation(line: 78, column: 13, scope: !305)
!333 = !DILocation(line: 78, column: 17, scope: !305)
!334 = !DILocation(line: 78, column: 20, scope: !305)
!335 = !DILocation(line: 78, column: 24, scope: !305)
!336 = !DILocation(line: 78, column: 3, scope: !305)
!337 = !DILocation(line: 78, column: 6, scope: !305)
!338 = !DILocation(line: 78, column: 8, scope: !305)
!339 = !DILocation(line: 79, column: 7, scope: !340)
!340 = distinct !DILexicalBlock(scope: !305, file: !3, line: 79, column: 7)
!341 = !DILocation(line: 79, column: 10, scope: !340)
!342 = !DILocation(line: 79, column: 12, scope: !340)
!343 = !DILocation(line: 79, column: 16, scope: !340)
!344 = !DILocation(line: 79, column: 19, scope: !340)
!345 = !DILocation(line: 79, column: 22, scope: !340)
!346 = !DILocation(line: 79, column: 24, scope: !340)
!347 = !DILocation(line: 79, column: 30, scope: !340)
!348 = !DILocation(line: 79, column: 33, scope: !340)
!349 = !DILocation(line: 79, column: 36, scope: !340)
!350 = !DILocation(line: 79, column: 38, scope: !340)
!351 = !DILocation(line: 79, column: 42, scope: !340)
!352 = !DILocation(line: 79, column: 45, scope: !340)
!353 = !DILocation(line: 79, column: 48, scope: !340)
!354 = !DILocation(line: 79, column: 50, scope: !340)
!355 = !DILocation(line: 79, column: 7, scope: !305)
!356 = !DILocation(line: 81, column: 5, scope: !357)
!357 = distinct !DILexicalBlock(scope: !340, file: !3, line: 79, column: 57)
!358 = !DILocation(line: 81, column: 8, scope: !357)
!359 = !DILocation(line: 80, column: 4, scope: !357)
!360 = !DILocation(line: 82, column: 4, scope: !357)
!361 = !DILocation(line: 84, column: 2, scope: !305)
!362 = !DILocation(line: 72, column: 28, scope: !299)
!363 = !DILocation(line: 72, column: 33, scope: !299)
!364 = !DILocation(line: 72, column: 2, scope: !299)
!365 = distinct !{!365, !302, !366}
!366 = !DILocation(line: 84, column: 2, scope: !296)
!367 = !DILocation(line: 85, column: 28, scope: !162)
!368 = !DILocation(line: 85, column: 2, scope: !162)
!369 = !DILocation(line: 86, column: 1, scope: !162)
!370 = distinct !DISubprogram(name: "show_chain", scope: !3, file: !3, line: 88, type: !371, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !63)
!371 = !DISubroutineType(types: !372)
!372 = !{null, !373}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "chain", file: !3, line: 9, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 9, size: 1024, elements: !376)
!376 = !{!377, !378, !379, !380}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !375, file: !3, line: 9, baseType: !27, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !375, file: !3, line: 9, baseType: !27, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !375, file: !3, line: 9, baseType: !22, size: 32, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "has", scope: !375, file: !3, line: 9, baseType: !54, size: 832, offset: 160)
!381 = !DILocalVariable(name: "c", arg: 1, scope: !370, file: !3, line: 88, type: !373)
!382 = !DILocation(line: 88, column: 24, scope: !370)
!383 = !DILocation(line: 90, column: 16, scope: !370)
!384 = !DILocation(line: 90, column: 19, scope: !370)
!385 = !DILocation(line: 90, column: 2, scope: !370)
!386 = !DILocalVariable(name: "e", scope: !387, file: !3, line: 91, type: !27)
!387 = distinct !DILexicalBlock(scope: !370, file: !3, line: 91, column: 2)
!388 = !DILocation(line: 91, column: 14, scope: !387)
!389 = !DILocation(line: 91, column: 18, scope: !387)
!390 = !DILocation(line: 91, column: 21, scope: !387)
!391 = !DILocation(line: 91, column: 7, scope: !387)
!392 = !DILocation(line: 91, column: 24, scope: !393)
!393 = distinct !DILexicalBlock(scope: !387, file: !3, line: 91, column: 2)
!394 = !DILocation(line: 91, column: 26, scope: !393)
!395 = !DILocation(line: 91, column: 30, scope: !393)
!396 = !DILocation(line: 91, column: 29, scope: !393)
!397 = !DILocation(line: 91, column: 2, scope: !387)
!398 = !DILocation(line: 92, column: 17, scope: !393)
!399 = !DILocation(line: 92, column: 20, scope: !393)
!400 = !DILocation(line: 92, column: 3, scope: !393)
!401 = !DILocation(line: 91, column: 49, scope: !393)
!402 = !DILocation(line: 91, column: 52, scope: !393)
!403 = !DILocation(line: 91, column: 47, scope: !393)
!404 = !DILocation(line: 91, column: 2, scope: !393)
!405 = distinct !{!405, !397, !406}
!406 = !DILocation(line: 92, column: 23, scope: !387)
!407 = !DILocation(line: 93, column: 1, scope: !370)
!408 = distinct !DISubprogram(name: "widest", scope: !3, file: !3, line: 96, type: !409, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !63)
!409 = !DISubroutineType(types: !410)
!410 = !{!22, !22, !22}
!411 = !DILocalVariable(name: "n", arg: 1, scope: !408, file: !3, line: 96, type: !22)
!412 = !DILocation(line: 96, column: 16, scope: !408)
!413 = !DILocalVariable(name: "out", arg: 2, scope: !408, file: !3, line: 96, type: !22)
!414 = !DILocation(line: 96, column: 23, scope: !408)
!415 = !DILocation(line: 98, column: 12, scope: !416)
!416 = distinct !DILexicalBlock(scope: !408, file: !3, line: 98, column: 6)
!417 = !DILocation(line: 98, column: 6, scope: !416)
!418 = !DILocation(line: 98, column: 15, scope: !416)
!419 = !DILocation(line: 98, column: 19, scope: !416)
!420 = !DILocation(line: 98, column: 6, scope: !408)
!421 = !DILocation(line: 98, column: 30, scope: !416)
!422 = !DILocation(line: 98, column: 23, scope: !416)
!423 = !DILocalVariable(name: "mm", scope: !408, file: !3, line: 100, type: !22)
!424 = !DILocation(line: 100, column: 6, scope: !408)
!425 = !DILocalVariable(name: "mi", scope: !408, file: !3, line: 100, type: !22)
!426 = !DILocation(line: 100, column: 15, scope: !408)
!427 = !DILocalVariable(name: "i", scope: !428, file: !3, line: 101, type: !22)
!428 = distinct !DILexicalBlock(scope: !408, file: !3, line: 101, column: 2)
!429 = !DILocation(line: 101, column: 2, scope: !428)
!430 = !DILocation(line: 101, column: 2, scope: !431)
!431 = distinct !DILexicalBlock(scope: !428, file: !3, line: 101, column: 2)
!432 = !DILocation(line: 102, column: 7, scope: !433)
!433 = distinct !DILexicalBlock(scope: !434, file: !3, line: 102, column: 7)
!434 = distinct !DILexicalBlock(scope: !431, file: !3, line: 101, column: 16)
!435 = !DILocation(line: 102, column: 7, scope: !434)
!436 = !DILocation(line: 103, column: 14, scope: !437)
!437 = distinct !DILexicalBlock(scope: !438, file: !3, line: 103, column: 8)
!438 = distinct !DILexicalBlock(scope: !433, file: !3, line: 102, column: 12)
!439 = !DILocation(line: 103, column: 8, scope: !437)
!440 = !DILocation(line: 103, column: 17, scope: !437)
!441 = !DILocation(line: 103, column: 21, scope: !437)
!442 = !DILocation(line: 103, column: 24, scope: !437)
!443 = !DILocation(line: 103, column: 33, scope: !437)
