; ModuleID = 'last-letter-first-letter-2.ll'
source_filename = "last-letter-first-letter-2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.node = type { [26 x %struct.edge*], i32, i32, [26 x i32], [26 x i32] }
%struct.edge = type { i8, i8, i8*, %struct.edge* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.chain = type { %struct.edge*, %struct.edge*, i32, [26 x i32] }

@nodes = common dso_local global [26 x %struct.node] zeroinitializer, align 16, !dbg !0
@.str = private unnamed_addr constant [8 x i8] c"poke646\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"rt\00", align 1
@n_names = common dso_local global i32 0, align 4, !dbg !41
@tmp = common dso_local global %struct.edge** null, align 8, !dbg !38
@names = common dso_local global %struct.edge* null, align 8, !dbg !25
@.str.2 = private unnamed_addr constant [45 x i8] c"bad name %s: first/last char must be letter\0A\00", align 1
@.str.3 = private unnamed_addr constant [15 x i8] c"read %d names\0A\00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"%d:\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "nodes", scope: !2, file: !3, line: 11, type: !43, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git 078de928eea94413164fbdff5fab7bdcf0f60aa7)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !24, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "last-letter-first-letter-2.c", directory: "/scratch/yc0769/xstack_benchmark/rosetta/Last-letter-first-letter")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23}
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!24 = !{!0, !25, !38, !41}
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "names", scope: !2, file: !3, line: 12, type: !27, isLocal: false, isDefinition: true)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !3, line: 7, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge", file: !3, line: 7, size: 192, elements: !30)
!30 = !{!31, !33, !34, !36}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !29, file: !3, line: 7, baseType: !32, size: 8)
!32 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !29, file: !3, line: 7, baseType: !32, size: 8, offset: 8)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !29, file: !3, line: 7, baseType: !35, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "lnk", scope: !29, file: !3, line: 7, baseType: !37, size: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "tmp", scope: !2, file: !3, line: 12, type: !40, isLocal: false, isDefinition: true)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "n_names", scope: !2, file: !3, line: 13, type: !22, isLocal: false, isDefinition: true)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 88192, elements: !49)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "node", file: !3, line: 8, baseType: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 8, size: 3392, elements: !46)
!46 = !{!47, !51, !52, !53, !55}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !45, file: !3, line: 8, baseType: !48, size: 1664)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1664, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 26)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "nin", scope: !45, file: !3, line: 8, baseType: !22, size: 32, offset: 1664)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "nout", scope: !45, file: !3, line: 8, baseType: !22, size: 32, offset: 1696)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !45, file: !3, line: 8, baseType: !54, size: 832, offset: 1728)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 832, elements: !49)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !45, file: !3, line: 8, baseType: !54, size: 832, offset: 2560)
!56 = !{i32 7, !"Dwarf Version", i32 4}
!57 = !{i32 2, !"Debug Info Version", i32 3}
!58 = !{i32 1, !"wchar_size", i32 4}
!59 = !{!"clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git 078de928eea94413164fbdff5fab7bdcf0f60aa7)"}
!60 = distinct !DISubprogram(name: "store_edge", scope: !3, file: !3, line: 16, type: !61, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !63)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !27}
!63 = !{}
!64 = !DILocalVariable(name: "g", arg: 1, scope: !60, file: !3, line: 16, type: !27)
!65 = !DILocation(line: 0, scope: !60)
!66 = !DILocation(line: 18, column: 7, scope: !67)
!67 = distinct !DILexicalBlock(scope: !60, file: !3, line: 18, column: 6)
!68 = !DILocation(line: 18, column: 6, scope: !60)
!69 = !{!"if"}
!70 = !DILocation(line: 18, column: 10, scope: !67)
!71 = !DILocation(line: 19, column: 13, scope: !60)
!72 = !DILocation(line: 19, column: 10, scope: !60)
!73 = !DILocalVariable(name: "i", scope: !60, file: !3, line: 19, type: !22)
!74 = !DILocation(line: 19, column: 23, scope: !60)
!75 = !DILocation(line: 19, column: 20, scope: !60)
!76 = !DILocalVariable(name: "j", scope: !60, file: !3, line: 19, type: !22)
!77 = !DILocation(line: 20, column: 18, scope: !60)
!78 = !DILocalVariable(name: "n", scope: !60, file: !3, line: 20, type: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!80 = !DILocation(line: 22, column: 14, scope: !60)
!81 = !DILocation(line: 22, column: 11, scope: !60)
!82 = !DILocation(line: 22, column: 5, scope: !60)
!83 = !DILocation(line: 22, column: 9, scope: !60)
!84 = !DILocation(line: 24, column: 5, scope: !60)
!85 = !DILocation(line: 24, column: 2, scope: !60)
!86 = !DILocation(line: 24, column: 10, scope: !60)
!87 = !DILocation(line: 24, column: 18, scope: !60)
!88 = !DILocation(line: 24, column: 15, scope: !60)
!89 = !DILocation(line: 24, column: 24, scope: !60)
!90 = !DILocation(line: 24, column: 31, scope: !60)
!91 = !DILocation(line: 24, column: 35, scope: !60)
!92 = !DILocation(line: 25, column: 12, scope: !60)
!93 = !DILocation(line: 25, column: 20, scope: !60)
!94 = !DILocation(line: 25, column: 17, scope: !60)
!95 = !DILocation(line: 25, column: 25, scope: !60)
!96 = !DILocation(line: 25, column: 32, scope: !60)
!97 = !DILocation(line: 25, column: 35, scope: !60)
!98 = !DILocation(line: 26, column: 1, scope: !60)
!99 = distinct !DISubprogram(name: "remove_edge", scope: !3, file: !3, line: 29, type: !100, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !63)
!100 = !DISubroutineType(types: !101)
!101 = !{!27, !22, !22}
!102 = !DILocalVariable(name: "i", arg: 1, scope: !99, file: !3, line: 29, type: !22)
!103 = !DILocation(line: 0, scope: !99)
!104 = !DILocalVariable(name: "j", arg: 2, scope: !99, file: !3, line: 29, type: !22)
!105 = !DILocation(line: 31, column: 18, scope: !99)
!106 = !DILocalVariable(name: "n", scope: !99, file: !3, line: 31, type: !79)
!107 = !DILocation(line: 32, column: 15, scope: !99)
!108 = !DILocation(line: 32, column: 12, scope: !99)
!109 = !DILocalVariable(name: "g", scope: !99, file: !3, line: 32, type: !27)
!110 = !DILocation(line: 33, column: 6, scope: !111)
!111 = distinct !DILexicalBlock(scope: !99, file: !3, line: 33, column: 6)
!112 = !DILocation(line: 33, column: 6, scope: !99)
!113 = !DILocation(line: 34, column: 16, scope: !114)
!114 = distinct !DILexicalBlock(scope: !111, file: !3, line: 33, column: 9)
!115 = !DILocation(line: 34, column: 6, scope: !114)
!116 = !DILocation(line: 34, column: 3, scope: !114)
!117 = !DILocation(line: 34, column: 11, scope: !114)
!118 = !DILocation(line: 35, column: 6, scope: !114)
!119 = !DILocation(line: 35, column: 10, scope: !114)
!120 = !DILocation(line: 36, column: 6, scope: !114)
!121 = !DILocation(line: 36, column: 3, scope: !114)
!122 = !DILocation(line: 36, column: 12, scope: !114)
!123 = !DILocation(line: 36, column: 19, scope: !114)
!124 = !DILocation(line: 36, column: 23, scope: !114)
!125 = !DILocation(line: 38, column: 13, scope: !114)
!126 = !DILocation(line: 39, column: 6, scope: !114)
!127 = !DILocation(line: 39, column: 3, scope: !114)
!128 = !DILocation(line: 39, column: 11, scope: !114)
!129 = !DILocation(line: 40, column: 6, scope: !114)
!130 = !DILocation(line: 40, column: 9, scope: !114)
!131 = !DILocation(line: 41, column: 2, scope: !114)
!132 = !DILocation(line: 42, column: 2, scope: !99)
!133 = distinct !DISubprogram(name: "read_names", scope: !3, file: !3, line: 45, type: !134, scopeLine: 46, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !63)
!134 = !DISubroutineType(types: !135)
!135 = !{null}
!136 = !DILocation(line: 47, column: 13, scope: !133)
!137 = !DILocalVariable(name: "fp", scope: !133, file: !3, line: 47, type: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !140, line: 7, baseType: !141)
!140 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !142, line: 49, size: 1728, elements: !143)
!142 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!143 = !{!144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !159, !161, !162, !163, !167, !168, !170, !174, !177, !179, !182, !185, !186, !188, !192, !193}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !141, file: !142, line: 51, baseType: !22, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !141, file: !142, line: 54, baseType: !35, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !141, file: !142, line: 55, baseType: !35, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !141, file: !142, line: 56, baseType: !35, size: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !141, file: !142, line: 57, baseType: !35, size: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !141, file: !142, line: 58, baseType: !35, size: 64, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !141, file: !142, line: 59, baseType: !35, size: 64, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !141, file: !142, line: 60, baseType: !35, size: 64, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !141, file: !142, line: 61, baseType: !35, size: 64, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !141, file: !142, line: 64, baseType: !35, size: 64, offset: 576)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !141, file: !142, line: 65, baseType: !35, size: 64, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !141, file: !142, line: 66, baseType: !35, size: 64, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !141, file: !142, line: 68, baseType: !157, size: 64, offset: 768)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !142, line: 36, flags: DIFlagFwdDecl)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !141, file: !142, line: 70, baseType: !160, size: 64, offset: 832)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !141, file: !142, line: 72, baseType: !22, size: 32, offset: 896)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !141, file: !142, line: 73, baseType: !22, size: 32, offset: 928)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !141, file: !142, line: 74, baseType: !164, size: 64, offset: 960)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !165, line: 152, baseType: !166)
!165 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!166 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !141, file: !142, line: 77, baseType: !23, size: 16, offset: 1024)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !141, file: !142, line: 78, baseType: !169, size: 8, offset: 1040)
!169 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !141, file: !142, line: 79, baseType: !171, size: 8, offset: 1048)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 8, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 1)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !141, file: !142, line: 81, baseType: !175, size: 64, offset: 1088)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !142, line: 43, baseType: null)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !141, file: !142, line: 89, baseType: !178, size: 64, offset: 1152)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !165, line: 153, baseType: !166)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !141, file: !142, line: 91, baseType: !180, size: 64, offset: 1216)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !142, line: 37, flags: DIFlagFwdDecl)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !141, file: !142, line: 92, baseType: !183, size: 64, offset: 1280)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !142, line: 38, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !141, file: !142, line: 93, baseType: !160, size: 64, offset: 1344)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !141, file: !142, line: 94, baseType: !187, size: 64, offset: 1408)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !141, file: !142, line: 95, baseType: !189, size: 64, offset: 1472)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !190, line: 46, baseType: !191)
!190 = !DIFile(filename: "/u/NAS_SCRATCH/yc0769/xstack/llvm-install/lib/clang/10.0.1/include/stddef.h", directory: "")
!191 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !141, file: !142, line: 96, baseType: !22, size: 32, offset: 1536)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !141, file: !142, line: 98, baseType: !194, size: 160, offset: 1568)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 160, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 20)
!197 = !DILocation(line: 0, scope: !133)
!198 = !DILocation(line: 52, column: 7, scope: !199)
!199 = distinct !DILexicalBlock(scope: !133, file: !3, line: 52, column: 6)
!200 = !DILocation(line: 52, column: 6, scope: !133)
!201 = !DILocation(line: 52, column: 11, scope: !199)
!202 = !DILocation(line: 54, column: 2, scope: !133)
!203 = !DILocation(line: 55, column: 8, scope: !133)
!204 = !DILocalVariable(name: "len", scope: !133, file: !3, line: 48, type: !22)
!205 = !DILocation(line: 56, column: 19, scope: !133)
!206 = !DILocation(line: 56, column: 15, scope: !133)
!207 = !DILocation(line: 56, column: 8, scope: !133)
!208 = !DILocalVariable(name: "buf", scope: !133, file: !3, line: 49, type: !35)
!209 = !DILocation(line: 57, column: 2, scope: !133)
!210 = !DILocation(line: 58, column: 16, scope: !133)
!211 = !DILocation(line: 58, column: 2, scope: !133)
!212 = !DILocation(line: 59, column: 2, scope: !133)
!213 = !DILocation(line: 61, column: 2, scope: !133)
!214 = !DILocation(line: 61, column: 11, scope: !133)
!215 = !DILocalVariable(name: "i", scope: !133, file: !3, line: 48, type: !22)
!216 = !DILocation(line: 62, column: 15, scope: !217)
!217 = distinct !DILexicalBlock(scope: !133, file: !3, line: 62, column: 2)
!218 = !DILocation(line: 62, column: 7, scope: !217)
!219 = !DILocation(line: 0, scope: !217)
!220 = !DILocation(line: 62, column: 26, scope: !221)
!221 = distinct !DILexicalBlock(scope: !217, file: !3, line: 62, column: 2)
!222 = !DILocation(line: 62, column: 2, scope: !217)
!223 = !DILocation(line: 63, column: 7, scope: !224)
!224 = distinct !DILexicalBlock(scope: !221, file: !3, line: 63, column: 7)
!225 = !DILocation(line: 63, column: 7, scope: !221)
!226 = !DILocation(line: 64, column: 4, scope: !224)
!227 = !DILocation(line: 64, column: 11, scope: !224)
!228 = !DILocation(line: 64, column: 23, scope: !224)
!229 = !DILocation(line: 62, column: 34, scope: !221)
!230 = !DILocation(line: 62, column: 2, scope: !221)
!231 = distinct !{!231, !222, !232}
!232 = !DILocation(line: 64, column: 23, scope: !217)
!233 = !DILocation(line: 66, column: 13, scope: !234)
!234 = distinct !DILexicalBlock(scope: !133, file: !3, line: 66, column: 6)
!235 = !DILocation(line: 66, column: 6, scope: !234)
!236 = !DILocation(line: 66, column: 6, scope: !133)
!237 = !DILocation(line: 66, column: 25, scope: !234)
!238 = !DILocation(line: 66, column: 18, scope: !234)
!239 = !DILocation(line: 68, column: 2, scope: !133)
!240 = !DILocation(line: 69, column: 15, scope: !133)
!241 = !DILocation(line: 69, column: 8, scope: !133)
!242 = !DILocation(line: 69, column: 6, scope: !133)
!243 = !DILocation(line: 71, column: 36, scope: !133)
!244 = !DILocation(line: 71, column: 34, scope: !133)
!245 = !DILocation(line: 71, column: 14, scope: !133)
!246 = !DILocation(line: 71, column: 12, scope: !133)
!247 = !DILocalVariable(name: "p", scope: !133, file: !3, line: 50, type: !27)
!248 = !DILocation(line: 72, column: 7, scope: !249)
!249 = distinct !DILexicalBlock(scope: !133, file: !3, line: 72, column: 2)
!250 = !DILocation(line: 0, scope: !249)
!251 = !DILocation(line: 72, column: 18, scope: !252)
!252 = distinct !DILexicalBlock(scope: !249, file: !3, line: 72, column: 2)
!253 = !DILocation(line: 72, column: 16, scope: !252)
!254 = !DILocation(line: 72, column: 2, scope: !249)
!255 = !DILocation(line: 73, column: 7, scope: !256)
!256 = distinct !DILexicalBlock(scope: !257, file: !3, line: 73, column: 7)
!257 = distinct !DILexicalBlock(scope: !252, file: !3, line: 72, column: 37)
!258 = !DILocation(line: 73, column: 7, scope: !257)
!259 = !DILocation(line: 73, column: 19, scope: !256)
!260 = !DILocation(line: 73, column: 26, scope: !256)
!261 = !DILocation(line: 73, column: 30, scope: !256)
!262 = !DILocation(line: 73, column: 34, scope: !256)
!263 = !DILocation(line: 73, column: 40, scope: !256)
!264 = !DILocation(line: 73, column: 13, scope: !256)
!265 = !DILocation(line: 73, column: 17, scope: !256)
!266 = !DILocation(line: 73, column: 10, scope: !256)
!267 = !DILocation(line: 74, column: 11, scope: !256)
!268 = !DILocation(line: 74, column: 15, scope: !256)
!269 = !DILocation(line: 76, column: 19, scope: !257)
!270 = !DILocation(line: 76, column: 9, scope: !257)
!271 = !DILocation(line: 77, column: 13, scope: !257)
!272 = !DILocation(line: 77, column: 10, scope: !257)
!273 = !DILocation(line: 77, column: 20, scope: !257)
!274 = !DILocation(line: 77, column: 6, scope: !257)
!275 = !DILocation(line: 77, column: 8, scope: !257)
!276 = !DILocation(line: 78, column: 13, scope: !257)
!277 = !DILocation(line: 78, column: 20, scope: !257)
!278 = !DILocation(line: 78, column: 10, scope: !257)
!279 = !DILocation(line: 78, column: 24, scope: !257)
!280 = !DILocation(line: 78, column: 6, scope: !257)
!281 = !DILocation(line: 78, column: 8, scope: !257)
!282 = !DILocation(line: 79, column: 10, scope: !283)
!283 = distinct !DILexicalBlock(scope: !257, file: !3, line: 79, column: 7)
!284 = !DILocation(line: 79, column: 7, scope: !283)
!285 = !DILocation(line: 79, column: 12, scope: !283)
!286 = !DILocation(line: 79, column: 16, scope: !283)
!287 = !DILocation(line: 79, column: 22, scope: !283)
!288 = !DILocation(line: 79, column: 19, scope: !283)
!289 = !DILocation(line: 79, column: 24, scope: !283)
!290 = !DILocation(line: 79, column: 30, scope: !283)
!291 = !DILocation(line: 79, column: 36, scope: !283)
!292 = !DILocation(line: 79, column: 33, scope: !283)
!293 = !DILocation(line: 79, column: 38, scope: !283)
!294 = !DILocation(line: 79, column: 42, scope: !283)
!295 = !DILocation(line: 79, column: 48, scope: !283)
!296 = !DILocation(line: 79, column: 45, scope: !283)
!297 = !DILocation(line: 79, column: 50, scope: !283)
!298 = !DILocation(line: 79, column: 7, scope: !257)
!299 = !DILocation(line: 81, column: 8, scope: !300)
!300 = distinct !DILexicalBlock(scope: !283, file: !3, line: 79, column: 57)
!301 = !DILocation(line: 80, column: 4, scope: !300)
!302 = !DILocation(line: 82, column: 4, scope: !300)
!303 = !DILocation(line: 84, column: 2, scope: !257)
!304 = !DILocation(line: 72, column: 28, scope: !252)
!305 = !DILocation(line: 72, column: 33, scope: !252)
!306 = !DILocation(line: 72, column: 2, scope: !252)
!307 = distinct !{!307, !254, !308}
!308 = !DILocation(line: 84, column: 2, scope: !249)
!309 = !DILocation(line: 85, column: 28, scope: !133)
!310 = !DILocation(line: 85, column: 2, scope: !133)
!311 = !DILocation(line: 86, column: 1, scope: !133)
!312 = distinct !DISubprogram(name: "show_chain", scope: !3, file: !3, line: 88, type: !313, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !63)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !315}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "chain", file: !3, line: 9, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 9, size: 1024, elements: !318)
!318 = !{!319, !320, !321, !322}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !317, file: !3, line: 9, baseType: !27, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !317, file: !3, line: 9, baseType: !27, size: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !317, file: !3, line: 9, baseType: !22, size: 32, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "has", scope: !317, file: !3, line: 9, baseType: !54, size: 832, offset: 160)
!323 = !DILocalVariable(name: "c", arg: 1, scope: !312, file: !3, line: 88, type: !315)
!324 = !DILocation(line: 0, scope: !312)
!325 = !DILocation(line: 90, column: 19, scope: !312)
!326 = !DILocation(line: 90, column: 2, scope: !312)
!327 = !DILocation(line: 91, column: 21, scope: !328)
!328 = distinct !DILexicalBlock(scope: !312, file: !3, line: 91, column: 2)
!329 = !DILocalVariable(name: "e", scope: !328, file: !3, line: 91, type: !27)
!330 = !DILocation(line: 0, scope: !328)
!331 = !DILocation(line: 91, column: 7, scope: !328)
!332 = !DILocation(line: 91, column: 24, scope: !333)
!333 = distinct !DILexicalBlock(scope: !328, file: !3, line: 91, column: 2)
!334 = !DILocation(line: 91, column: 26, scope: !333)
!335 = !DILocation(line: 91, column: 30, scope: !333)
!336 = !DILocation(line: 91, column: 29, scope: !333)
!337 = !DILocation(line: 91, column: 2, scope: !328)
!338 = !DILocation(line: 92, column: 20, scope: !333)
!339 = !DILocation(line: 92, column: 3, scope: !333)
!340 = !DILocation(line: 91, column: 52, scope: !333)
!341 = !DILocation(line: 91, column: 2, scope: !333)
!342 = distinct !{!342, !337, !343}
!343 = !DILocation(line: 92, column: 23, scope: !328)
!344 = !DILocation(line: 93, column: 1, scope: !312)
!345 = distinct !DISubprogram(name: "widest", scope: !3, file: !3, line: 96, type: !346, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !63)
!346 = !DISubroutineType(types: !347)
!347 = !{!22, !22, !22}
!348 = !DILocalVariable(name: "n", arg: 1, scope: !345, file: !3, line: 96, type: !22)
!349 = !DILocation(line: 0, scope: !345)
!350 = !DILocalVariable(name: "out", arg: 2, scope: !345, file: !3, line: 96, type: !22)
!351 = !DILocation(line: 98, column: 6, scope: !352)
!352 = distinct !DILexicalBlock(scope: !345, file: !3, line: 98, column: 6)
!353 = !DILocation(line: 98, column: 15, scope: !352)
!354 = !DILocation(line: 98, column: 6, scope: !345)
!355 = !DILocation(line: 98, column: 23, scope: !352)
!356 = !DILocalVariable(name: "mm", scope: !345, file: !3, line: 100, type: !22)
!357 = !DILocalVariable(name: "mi", scope: !345, file: !3, line: 100, type: !22)
!358 = !DILocalVariable(name: "i", scope: !359, file: !3, line: 101, type: !22)
!359 = distinct !DILexicalBlock(scope: !345, file: !3, line: 101, column: 2)
!360 = !DILocation(line: 0, scope: !359)
!361 = !DILocation(line: 101, column: 2, scope: !359)
!362 = !DILocation(line: 101, column: 2, scope: !363)
!363 = distinct !DILexicalBlock(scope: !359, file: !3, line: 101, column: 2)
!364 = !DILocation(line: 102, column: 7, scope: !365)
!365 = distinct !DILexicalBlock(scope: !366, file: !3, line: 102, column: 7)
!366 = distinct !DILexicalBlock(scope: !363, file: !3, line: 101, column: 16)
!367 = !DILocation(line: 102, column: 7, scope: !366)
!368 = !DILocation(line: 103, column: 8, scope: !369)
!369 = distinct !DILexicalBlock(scope: !370, file: !3, line: 103, column: 8)
!370 = distinct !DILexicalBlock(scope: !365, file: !3, line: 102, column: 12)
!371 = !DILocation(line: 103, column: 17, scope: !369)
!372 = !DILocation(line: 103, column: 24, scope: !369)
!373 = !DILocation(line: 103, column: 27, scope: !369)
!374 = !DILocation(line: 103, column: 36, scope: !369)
!375 = !DILocation(line: 103, column: 41, scope: !369)
!376 = !DILocation(line: 103, column: 8, scope: !370)
!377 = !DILocation(line: 104, column: 18, scope: !369)
!378 = !DILocation(line: 104, column: 27, scope: !369)
!379 = !DILocation(line: 104, column: 5, scope: !369)
!380 = !DILocation(line: 105, column: 3, scope: !370)
!381 = !DILocation(line: 106, column: 8, scope: !382)
!382 = distinct !DILexicalBlock(scope: !383, file: !3, line: 106, column: 8)
!383 = distinct !DILexicalBlock(scope: !365, file: !3, line: 105, column: 10)
!384 = !DILocation(line: 106, column: 17, scope: !382)
!385 = !DILocation(line: 106, column: 24, scope: !382)
