; ModuleID = 'dining-philosophers-1.ll'
source_filename = "dining-philosophers-1.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%union.pthread_mutexattr_t = type { i32 }
%union.pthread_attr_t = type { i64, [48 x i8] }

@.str = private unnamed_addr constant [10 x i8] c"Aristotle\00", align 1
@.str.1 = private unnamed_addr constant [5 x i8] c"Kant\00", align 1
@.str.2 = private unnamed_addr constant [8 x i8] c"Spinoza\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"Marx\00", align 1
@.str.4 = private unnamed_addr constant [8 x i8] c"Russell\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "names", scope: !2, file: !3, line: 8, type: !11, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !8, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "dining-philosophers-1.c", directory: "/scratch/yc0769/xstack_benchmark/rosetta/Dining-philosophers")
!4 = !{}
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!0, !9, !17, !53}
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "topic", scope: !2, file: !3, line: 12, type: !11, isLocal: false, isDefinition: true)
!11 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 320, elements: !15)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!15 = !{!16}
!16 = !DISubrange(count: 5)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "screen", scope: !19, file: !3, line: 20, type: !22, isLocal: true, isDefinition: true)
!19 = distinct !DISubprogram(name: "print", scope: !3, file: !3, line: 18, type: !20, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !7, !7, !12, null}
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !23, line: 72, baseType: !24)
!23 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "")
!24 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !23, line: 67, size: 320, elements: !25)
!25 = !{!26, !47, !51}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !24, file: !23, line: 69, baseType: !27, size: 320)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !28, line: 22, size: 320, elements: !29)
!28 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "")
!29 = !{!30, !31, !33, !34, !35, !36, !38, !39}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !27, file: !28, line: 24, baseType: !7, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !27, file: !28, line: 25, baseType: !32, size: 32, offset: 32)
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !27, file: !28, line: 26, baseType: !7, size: 32, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !27, file: !28, line: 28, baseType: !32, size: 32, offset: 96)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !27, file: !28, line: 32, baseType: !7, size: 32, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !27, file: !28, line: 34, baseType: !37, size: 16, offset: 160)
!37 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !27, file: !28, line: 35, baseType: !37, size: 16, offset: 176)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !27, file: !28, line: 36, baseType: !40, size: 128, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !41, line: 53, baseType: !42)
!41 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "")
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !41, line: 49, size: 128, elements: !43)
!43 = !{!44, !46}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !42, file: !41, line: 51, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !42, file: !41, line: 52, baseType: !45, size: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !24, file: !23, line: 70, baseType: !48, size: 320)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 320, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 40)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !24, file: !23, line: 71, baseType: !52, size: 64)
!52 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "forks", scope: !2, file: !3, line: 9, type: !55, isLocal: false, isDefinition: true)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1600, elements: !15)
!56 = !{i32 7, !"Dwarf Version", i32 4}
!57 = !{i32 2, !"Debug Info Version", i32 3}
!58 = !{i32 1, !"wchar_size", i32 4}
!59 = !{!"clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!60 = !DILocalVariable(name: "y", arg: 1, scope: !19, file: !3, line: 18, type: !7)
!61 = !DILocation(line: 18, column: 16, scope: !19)
!62 = !DILocalVariable(name: "x", arg: 2, scope: !19, file: !3, line: 18, type: !7)
!63 = !DILocation(line: 18, column: 23, scope: !19)
!64 = !DILocalVariable(name: "fmt", arg: 3, scope: !19, file: !3, line: 18, type: !12)
!65 = !DILocation(line: 18, column: 38, scope: !19)
!66 = !DILocalVariable(name: "ap", scope: !19, file: !3, line: 21, type: !67)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !68, line: 52, baseType: !69)
!68 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !70, line: 32, baseType: !71)
!70 = !DIFile(filename: "/u/NAS_SCRATCH/yc0769/xstack/xstack-installs/llvm-install-debug/lib/clang/10.0.1/include/stdarg.h", directory: "")
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 21, baseType: !72)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 192, elements: !80)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 21, size: 192, elements: !74)
!74 = !{!75, !76, !77, !79}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !73, file: !3, line: 21, baseType: !32, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !73, file: !3, line: 21, baseType: !32, size: 32, offset: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !73, file: !3, line: 21, baseType: !78, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !73, file: !3, line: 21, baseType: !78, size: 64, offset: 128)
!80 = !{!81}
!81 = !DISubrange(count: 1)
!82 = !DILocation(line: 21, column: 10, scope: !19)
!83 = !DILocation(line: 22, column: 2, scope: !19)
!84 = !DILocation(line: 24, column: 2, scope: !19)
!85 = !DILocation(line: 25, column: 2, scope: !19)
!86 = !DILocation(line: 25, column: 24, scope: !19)
!87 = !DILocation(line: 25, column: 29, scope: !19)
!88 = !DILocation(line: 25, column: 16, scope: !19)
!89 = !DILocation(line: 26, column: 2, scope: !19)
!90 = !DILocation(line: 26, column: 23, scope: !19)
!91 = !DILocation(line: 26, column: 16, scope: !19)
!92 = !DILocation(line: 27, column: 2, scope: !19)
!93 = !DILocation(line: 28, column: 1, scope: !19)
!94 = distinct !DISubprogram(name: "eat", scope: !3, file: !3, line: 30, type: !95, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!95 = !DISubroutineType(types: !96)
!96 = !{null, !7}
!97 = !DILocalVariable(name: "id", arg: 1, scope: !94, file: !3, line: 30, type: !7)
!98 = !DILocation(line: 30, column: 14, scope: !94)
!99 = !DILocalVariable(name: "f", scope: !94, file: !3, line: 32, type: !100)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 2)
!103 = !DILocation(line: 32, column: 6, scope: !94)
!104 = !DILocalVariable(name: "ration", scope: !94, file: !3, line: 32, type: !7)
!105 = !DILocation(line: 32, column: 12, scope: !94)
!106 = !DILocalVariable(name: "i", scope: !94, file: !3, line: 32, type: !7)
!107 = !DILocation(line: 32, column: 20, scope: !94)
!108 = !DILocation(line: 33, column: 16, scope: !94)
!109 = !DILocation(line: 33, column: 9, scope: !94)
!110 = !DILocation(line: 33, column: 14, scope: !94)
!111 = !DILocation(line: 33, column: 2, scope: !94)
!112 = !DILocation(line: 33, column: 7, scope: !94)
!113 = !DILocation(line: 37, column: 15, scope: !94)
!114 = !DILocation(line: 37, column: 18, scope: !94)
!115 = !DILocation(line: 37, column: 23, scope: !94)
!116 = !DILocation(line: 37, column: 4, scope: !94)
!117 = !DILocation(line: 37, column: 7, scope: !94)
!118 = !DILocation(line: 37, column: 2, scope: !94)
!119 = !DILocation(line: 37, column: 12, scope: !94)
!120 = !DILocation(line: 39, column: 2, scope: !94)
!121 = !DILocation(line: 40, column: 8, scope: !94)
!122 = !DILocation(line: 40, column: 2, scope: !94)
!123 = !DILocation(line: 42, column: 9, scope: !124)
!124 = distinct !DILexicalBlock(scope: !94, file: !3, line: 42, column: 2)
!125 = !DILocation(line: 42, column: 7, scope: !124)
!126 = !DILocation(line: 42, column: 14, scope: !127)
!127 = distinct !DILexicalBlock(scope: !124, file: !3, line: 42, column: 2)
!128 = !DILocation(line: 42, column: 16, scope: !127)
!129 = !DILocation(line: 42, column: 2, scope: !124)
!130 = !DILocation(line: 43, column: 18, scope: !131)
!131 = distinct !DILexicalBlock(scope: !127, file: !3, line: 42, column: 26)
!132 = !DILocation(line: 43, column: 16, scope: !131)
!133 = !DILocation(line: 43, column: 14, scope: !131)
!134 = !DILocation(line: 43, column: 3, scope: !131)
!135 = !DILocation(line: 44, column: 8, scope: !136)
!136 = distinct !DILexicalBlock(scope: !131, file: !3, line: 44, column: 7)
!137 = !DILocation(line: 44, column: 7, scope: !131)
!138 = !DILocation(line: 44, column: 11, scope: !136)
!139 = !DILocation(line: 46, column: 9, scope: !131)
!140 = !DILocation(line: 46, column: 21, scope: !131)
!141 = !DILocation(line: 46, column: 19, scope: !131)
!142 = !DILocation(line: 46, column: 27, scope: !131)
!143 = !DILocation(line: 46, column: 24, scope: !131)
!144 = !DILocation(line: 46, column: 31, scope: !131)
!145 = !DILocation(line: 46, column: 16, scope: !131)
!146 = !DILocation(line: 46, column: 48, scope: !131)
!147 = !DILocation(line: 46, column: 46, scope: !131)
!148 = !DILocation(line: 46, column: 3, scope: !131)
!149 = !DILocation(line: 48, column: 3, scope: !131)
