; ModuleID = 'dining-philosophers-2.ll'
source_filename = "dining-philosophers-2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.philData = type { %union.pthread_mutex_t*, %union.pthread_mutex_t*, i8*, i64, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%union.pthread_mutexattr_t = type { i32 }
%union.pthread_attr_t = type { i64, [48 x i8] }

@running = dso_local global i32 1, align 4, !dbg !0
@.str = private unnamed_addr constant [30 x i8] c"%s is sleeping --er thinking\0A\00", align 1
@.str.1 = private unnamed_addr constant [14 x i8] c"%s is hungry\0A\00", align 1
@.str.2 = private unnamed_addr constant [14 x i8] c"%s is eating\0A\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"Kant\00", align 1
@.str.4 = private unnamed_addr constant [7 x i8] c"Guatma\00", align 1
@.str.5 = private unnamed_addr constant [7 x i8] c"Russel\00", align 1
@.str.6 = private unnamed_addr constant [10 x i8] c"Aristotle\00", align 1
@.str.7 = private unnamed_addr constant [5 x i8] c"Bart\00", align 1
@.str.8 = private unnamed_addr constant [30 x i8] c"Failed to initialize mutexes.\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "running", scope: !2, file: !3, line: 13, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git 078de928eea94413164fbdff5fab7bdcf0f60aa7)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !54, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "dining-philosophers-2.c", directory: "/scratch/yc0769/xstack_benchmark/rosetta/Dining-philosophers")
!4 = !{}
!5 = !{!6, !53}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "Philosopher", file: !3, line: 11, baseType: !8)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "philData", file: !3, line: 6, size: 320, elements: !9)
!9 = !{!10, !45, !46, !49, !52}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "fork_lft", scope: !8, file: !3, line: 7, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !13, line: 72, baseType: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "")
!14 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !13, line: 67, size: 320, elements: !15)
!15 = !{!16, !38, !43}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !14, file: !13, line: 69, baseType: !17, size: 320)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !18, line: 22, size: 320, elements: !19)
!18 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "")
!19 = !{!20, !22, !24, !25, !26, !27, !29, !30}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !17, file: !18, line: 24, baseType: !21, size: 32)
!21 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !17, file: !18, line: 25, baseType: !23, size: 32, offset: 32)
!23 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !17, file: !18, line: 26, baseType: !21, size: 32, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !17, file: !18, line: 28, baseType: !23, size: 32, offset: 96)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !17, file: !18, line: 32, baseType: !21, size: 32, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !17, file: !18, line: 34, baseType: !28, size: 16, offset: 160)
!28 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !17, file: !18, line: 35, baseType: !28, size: 16, offset: 176)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !17, file: !18, line: 36, baseType: !31, size: 128, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !32, line: 53, baseType: !33)
!32 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "")
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !32, line: 49, size: 128, elements: !34)
!34 = !{!35, !37}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !33, file: !32, line: 51, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !33, file: !32, line: 52, baseType: !36, size: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !14, file: !13, line: 70, baseType: !39, size: 320)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 320, elements: !41)
!40 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!41 = !{!42}
!42 = !DISubrange(count: 40)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !14, file: !13, line: 71, baseType: !44, size: 64)
!44 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "fork_rgt", scope: !8, file: !3, line: 7, baseType: !11, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !8, file: !3, line: 8, baseType: !47, size: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !8, file: !3, line: 9, baseType: !50, size: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !13, line: 27, baseType: !51)
!51 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "fail", scope: !8, file: !3, line: 10, baseType: !21, size: 32, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !{!0}
!55 = !{i32 7, !"Dwarf Version", i32 4}
!56 = !{i32 2, !"Debug Info Version", i32 3}
!57 = !{i32 1, !"wchar_size", i32 4}
!58 = !{!"clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git 078de928eea94413164fbdff5fab7bdcf0f60aa7)"}
!59 = distinct !DISubprogram(name: "PhilPhunction", scope: !3, file: !3, line: 15, type: !60, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!60 = !DISubroutineType(types: !61)
!61 = !{!53, !53}
!62 = !DILocalVariable(name: "p", arg: 1, scope: !59, file: !3, line: 15, type: !53)
!63 = !DILocation(line: 0, scope: !59)
!64 = !DILocation(line: 16, column: 25, scope: !59)
!65 = !DILocalVariable(name: "phil", scope: !59, file: !3, line: 16, type: !6)
!66 = !DILocation(line: 21, column: 5, scope: !59)
!67 = !DILocation(line: 21, column: 12, scope: !59)
!68 = !DILocation(line: 22, column: 56, scope: !69)
!69 = distinct !DILexicalBlock(scope: !59, file: !3, line: 21, column: 21)
!70 = !DILocation(line: 22, column: 9, scope: !69)
!71 = !DILocation(line: 23, column: 19, scope: !69)
!72 = !DILocation(line: 23, column: 25, scope: !69)
!73 = !DILocation(line: 23, column: 17, scope: !69)
!74 = !DILocation(line: 23, column: 9, scope: !69)
!75 = !DILocation(line: 25, column: 26, scope: !69)
!76 = !DILocalVariable(name: "fork_lft", scope: !59, file: !3, line: 19, type: !11)
!77 = !DILocation(line: 26, column: 26, scope: !69)
!78 = !DILocalVariable(name: "fork_rgt", scope: !59, file: !3, line: 19, type: !11)
!79 = !DILocation(line: 27, column: 40, scope: !69)
!80 = !DILocation(line: 27, column: 9, scope: !69)
!81 = !DILocalVariable(name: "tries_left", scope: !59, file: !3, line: 18, type: !21)
!82 = !DILocation(line: 29, column: 9, scope: !69)
!83 = !DILocation(line: 0, scope: !69)
!84 = !DILocation(line: 30, column: 22, scope: !85)
!85 = distinct !DILexicalBlock(scope: !69, file: !3, line: 29, column: 12)
!86 = !DILocalVariable(name: "failed", scope: !59, file: !3, line: 17, type: !21)
!87 = !DILocation(line: 31, column: 33, scope: !85)
!88 = !DILocation(line: 31, column: 22, scope: !85)
!89 = !DILocation(line: 31, column: 38, scope: !85)
!90 = !DILocation(line: 32, column: 38, scope: !85)
!91 = !DILocation(line: 33, column: 17, scope: !92)
!92 = distinct !DILexicalBlock(scope: !85, file: !3, line: 33, column: 17)
!93 = !DILocation(line: 33, column: 17, scope: !85)
!94 = !{!"if"}
!95 = !DILocation(line: 34, column: 17, scope: !96)
!96 = distinct !DILexicalBlock(scope: !92, file: !3, line: 33, column: 25)
!97 = !DILocalVariable(name: "fork_tmp", scope: !59, file: !3, line: 19, type: !11)
!98 = !DILocation(line: 38, column: 28, scope: !96)
!99 = !DILocation(line: 39, column: 13, scope: !96)
!100 = !DILocation(line: 40, column: 9, scope: !85)
!101 = !DILocation(line: 40, column: 17, scope: !69)
!102 = !DILocation(line: 40, column: 24, scope: !69)
!103 = !DILocation(line: 40, column: 27, scope: !69)
!104 = distinct !{!104, !82, !105}
!105 = !DILocation(line: 40, column: 34, scope: !69)
!106 = !DILocation(line: 42, column: 14, scope: !107)
!107 = distinct !DILexicalBlock(scope: !69, file: !3, line: 42, column: 13)
!108 = !DILocation(line: 42, column: 13, scope: !69)
!109 = !DILocation(line: 43, column: 44, scope: !110)
!110 = distinct !DILexicalBlock(scope: !107, file: !3, line: 42, column: 22)
!111 = !DILocation(line: 43, column: 13, scope: !110)
!112 = !DILocation(line: 44, column: 23, scope: !110)
!113 = !DILocation(line: 44, column: 30, scope: !110)
!114 = !DILocation(line: 44, column: 21, scope: !110)
!115 = !DILocation(line: 44, column: 13, scope: !110)
!116 = !DILocation(line: 45, column: 13, scope: !110)
!117 = !DILocation(line: 46, column: 13, scope: !110)
!118 = !DILocation(line: 47, column: 9, scope: !110)
!119 = distinct !{!119, !66, !120}
