; ModuleID = 'atomic-updates-1.ll'
source_filename = "atomic-updates-1.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%union.pthread_mutexattr_t = type { i32 }
%union.pthread_attr_t = type { i64, [48 x i8] }

@bucket_mutex = common dso_local global [15 x %union.pthread_mutex_t] zeroinitializer, align 16, !dbg !0
@buckets = common dso_local global [15 x i32] zeroinitializer, align 16, !dbg !8
@.str = private unnamed_addr constant [5 x i8] c"%3d \00", align 1
@.str.1 = private unnamed_addr constant [6 x i8] c"= %d\0A\00", align 1
@equalizer = common dso_local global i64 0, align 8, !dbg !14
@randomizer = common dso_local global i64 0, align 8, !dbg !19

; Function Attrs: noinline nounwind uwtable
define dso_local void @transfer_value(i32 %from, i32 %to, i32 %howmuch) #0 !dbg !57 {
entry:
  call void @llvm.dbg.value(metadata i32 %from, metadata !60, metadata !DIExpression()), !dbg !61
  call void @llvm.dbg.value(metadata i32 %to, metadata !62, metadata !DIExpression()), !dbg !61
  call void @llvm.dbg.value(metadata i32 %howmuch, metadata !63, metadata !DIExpression()), !dbg !61

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "bucket_mutex", scope: !2, file: !3, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !7, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "atomic-updates-1.c", directory: "/scratch/yc0769/xstack_benchmark/rosetta/Atomic-updates")
!4 = !{}
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !{!0, !8, !14, !19}
!8 = !DIGlobalVariableExpression(var: !9, expr: !DIExpression())
!9 = distinct !DIGlobalVariable(name: "buckets", scope: !2, file: !3, line: 11, type: !10, isLocal: false, isDefinition: true)
!10 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 480, elements: !12)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !{!13}
!13 = !DISubrange(count: 15)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "equalizer", scope: !2, file: !3, line: 13, type: !16, isLocal: false, isDefinition: true)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !17, line: 27, baseType: !18)
!17 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "")
!18 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "randomizer", scope: !2, file: !3, line: 14, type: !16, isLocal: false, isDefinition: true)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4800, elements: !12)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !17, line: 72, baseType: !23)
!23 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !17, line: 67, size: 320, elements: !24)
!24 = !{!25, !46, !51}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !23, file: !17, line: 69, baseType: !26, size: 320)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !27, line: 22, size: 320, elements: !28)
!27 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "")
!28 = !{!29, !30, !32, !33, !34, !35, !37, !38}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !26, file: !27, line: 24, baseType: !11, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !26, file: !27, line: 25, baseType: !31, size: 32, offset: 32)
!31 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !26, file: !27, line: 26, baseType: !11, size: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !26, file: !27, line: 28, baseType: !31, size: 32, offset: 96)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !26, file: !27, line: 32, baseType: !11, size: 32, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !26, file: !27, line: 34, baseType: !36, size: 16, offset: 160)
!36 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !26, file: !27, line: 35, baseType: !36, size: 16, offset: 176)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !26, file: !27, line: 36, baseType: !39, size: 128, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !40, line: 53, baseType: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "")
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !40, line: 49, size: 128, elements: !42)
!42 = !{!43, !45}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !41, file: !40, line: 51, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !41, file: !40, line: 52, baseType: !44, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !23, file: !17, line: 70, baseType: !47, size: 320)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 320, elements: !49)
!48 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!49 = !{!50}
!50 = !DISubrange(count: 40)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !23, file: !17, line: 71, baseType: !52, size: 64)
!52 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!53 = !{i32 7, !"Dwarf Version", i32 4}
!54 = !{i32 2, !"Debug Info Version", i32 3}
!55 = !{i32 1, !"wchar_size", i32 4}
!56 = !{!"clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!57 = distinct !DISubprogram(name: "transfer_value", scope: !3, file: !3, line: 16, type: !58, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !11, !11, !11}
!60 = !DILocalVariable(name: "from", arg: 1, scope: !57, file: !3, line: 16, type: !11)
!61 = !DILocation(line: 0, scope: !57)
!62 = !DILocalVariable(name: "to", arg: 2, scope: !57, file: !3, line: 16, type: !11)
!63 = !DILocalVariable(name: "howmuch", arg: 3, scope: !57, file: !3, line: 16, type: !11)
!64 = !DILocalVariable(name: "swapped", scope: !57, file: !3, line: 18, type: !65)
!65 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!66 = !DILocation(line: 20, column: 14, scope: !67)
!67 = distinct !DILexicalBlock(scope: !57, file: !3, line: 20, column: 8)
!68 = !DILocation(line: 20, column: 21, scope: !67)
!69 = !DILocation(line: 20, column: 34, scope: !67)
!70 = !DILocation(line: 20, column: 40, scope: !67)
!71 = !DILocation(line: 21, column: 14, scope: !67)
!72 = !DILocation(line: 21, column: 20, scope: !67)
!73 = !DILocation(line: 21, column: 27, scope: !67)
!74 = !DILocation(line: 21, column: 32, scope: !67)
!75 = !DILocation(line: 21, column: 41, scope: !67)
!76 = !DILocation(line: 21, column: 55, scope: !67)
!77 = !DILocation(line: 21, column: 62, scope: !67)
!78 = !DILocation(line: 20, column: 8, scope: !57)
!79 = !DILocation(line: 21, column: 78, scope: !67)
!80 = !DILocation(line: 23, column: 13, scope: !81)
!81 = distinct !DILexicalBlock(scope: !57, file: !3, line: 23, column: 8)
!82 = !DILocation(line: 23, column: 8, scope: !57)
!83 = !DILocalVariable(name: "temp1", scope: !84, file: !3, line: 24, type: !11)
!84 = distinct !DILexicalBlock(scope: !81, file: !3, line: 23, column: 20)
!85 = !DILocation(line: 0, scope: !84)
!86 = !DILocation(line: 28, column: 15, scope: !84)
!87 = !DILocation(line: 29, column: 3, scope: !84)
!88 = !DILocation(line: 31, column: 23, scope: !57)
!89 = !DILocation(line: 31, column: 3, scope: !57)
!90 = !DILocation(line: 32, column: 23, scope: !57)
!91 = !DILocation(line: 32, column: 3, scope: !57)
!92 = !DILocation(line: 34, column: 18, scope: !93)
!93 = distinct !DILexicalBlock(scope: !57, file: !3, line: 34, column: 8)
!94 = !DILocation(line: 34, column: 16, scope: !93)
!95 = !DILocation(line: 34, column: 32, scope: !93)
!96 = !DILocation(line: 34, column: 36, scope: !93)
!97 = !DILocation(line: 34, column: 8, scope: !57)
!98 = !DILocation(line: 35, column: 15, scope: !93)
!99 = !DILocation(line: 35, column: 5, scope: !93)
!100 = !DILocation(line: 36, column: 8, scope: !101)
!101 = distinct !DILexicalBlock(scope: !57, file: !3, line: 36, column: 8)
!102 = !DILocation(line: 36, column: 19, scope: !101)
!103 = !DILocation(line: 36, column: 17, scope: !101)
!104 = !DILocation(line: 36, column: 31, scope: !101)
!105 = !DILocation(line: 36, column: 34, scope: !101)
!106 = !DILocation(line: 36, column: 8, scope: !57)
!107 = !DILocation(line: 37, column: 16, scope: !101)
!108 = !DILocation(line: 37, column: 15, scope: !101)
!109 = !DILocation(line: 37, column: 5, scope: !101)
