; ModuleID = 'aliquot-sequence-classifications-1.ll'
source_filename = "aliquot-sequence-classifications-1.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [38 x i8] c"\0AInteger : %llu, Type : %s, Series : \00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"%llu, \00", align 1
@.str.2 = private unnamed_addr constant [5 x i8] c"%llu\00", align 1
@.str.3 = private unnamed_addr constant [12 x i8] c"Terminating\00", align 1
@.str.4 = private unnamed_addr constant [8 x i8] c"Perfect\00", align 1
@.str.5 = private unnamed_addr constant [9 x i8] c"Amicable\00", align 1
@.str.6 = private unnamed_addr constant [9 x i8] c"Aspiring\00", align 1
@.str.7 = private unnamed_addr constant [9 x i8] c"Sociable\00", align 1
@.str.8 = private unnamed_addr constant [7 x i8] c"Cyclic\00", align 1
@.str.9 = private unnamed_addr constant [16 x i8] c"Non-Terminating\00", align 1
@.str.10 = private unnamed_addr constant [2 x i8] c"r\00", align 1

!84 = distinct !DILexicalBlock(scope: !70, file: !1, line: 31, column: 2)
!85 = !DILocation(line: 0, scope: !84)
!86 = !DILocation(line: 31, column: 11, scope: !87)
!87 = distinct !DILexicalBlock(scope: !84, file: !1, line: 31, column: 2)
!88 = !DILocation(line: 31, column: 2, scope: !84)
!89 = !DILocation(line: 32, column: 44, scope: !90)
!90 = distinct !DILexicalBlock(scope: !87, file: !1, line: 31, column: 19)
!91 = !DILocation(line: 32, column: 39, scope: !90)
!92 = !DILocation(line: 32, column: 12, scope: !90)
!93 = !DILocation(line: 32, column: 3, scope: !90)
!94 = !DILocation(line: 32, column: 10, scope: !90)
!95 = !DILocation(line: 34, column: 6, scope: !96)
!96 = distinct !DILexicalBlock(scope: !90, file: !1, line: 34, column: 6)
!97 = !DILocation(line: 34, column: 12, scope: !96)
!98 = !DILocation(line: 34, column: 15, scope: !96)
!99 = !DILocation(line: 34, column: 17, scope: !96)
!100 = !DILocation(line: 34, column: 23, scope: !96)
!101 = !DILocation(line: 34, column: 26, scope: !96)
!102 = !DILocation(line: 34, column: 29, scope: !96)
!103 = !DILocation(line: 34, column: 42, scope: !96)
!104 = !DILocation(line: 34, column: 37, scope: !96)
!105 = !DILocation(line: 34, column: 35, scope: !96)
!106 = !DILocation(line: 34, column: 46, scope: !96)
!107 = !DILocation(line: 34, column: 49, scope: !96)
!108 = !DILocation(line: 34, column: 55, scope: !96)
!109 = !DILocation(line: 34, column: 6, scope: !90)
!110 = !DILocation(line: 35, column: 16, scope: !111)
!111 = distinct !DILexicalBlock(scope: !96, file: !1, line: 34, column: 60)
!112 = !DILocation(line: 35, column: 21, scope: !111)
!113 = !DILocation(line: 35, column: 25, scope: !111)
!114 = !DILocation(line: 35, column: 31, scope: !111)
!115 = !DILocation(line: 35, column: 24, scope: !111)
!116 = !DILocation(line: 35, column: 51, scope: !111)
!117 = !DILocation(line: 35, column: 57, scope: !111)
!118 = !DILocation(line: 35, column: 61, scope: !111)
!119 = !DILocation(line: 35, column: 65, scope: !111)
!120 = !DILocation(line: 35, column: 50, scope: !111)
!121 = !DILocation(line: 35, column: 81, scope: !111)
!122 = !DILocation(line: 35, column: 87, scope: !111)
!123 = !DILocation(line: 35, column: 91, scope: !111)
!124 = !DILocation(line: 35, column: 95, scope: !111)
!125 = !DILocation(line: 35, column: 80, scope: !111)
!126 = !DILocation(line: 35, column: 112, scope: !111)
!127 = !DILocation(line: 35, column: 125, scope: !111)
!128 = !DILocation(line: 35, column: 120, scope: !111)
!129 = !DILocation(line: 35, column: 118, scope: !111)
!130 = !DILocation(line: 35, column: 129, scope: !111)
!131 = !DILocation(line: 35, column: 132, scope: !111)
!132 = !DILocation(line: 35, column: 138, scope: !111)
!133 = !DILocation(line: 0, scope: !111)
!134 = !DILocation(line: 35, column: 111, scope: !111)
!135 = !DILocation(line: 35, column: 4, scope: !111)
!136 = !DILocation(line: 36, column: 4, scope: !111)
!137 = !DILocalVariable(name: "j", scope: !70, file: !1, line: 27, type: !46)
!138 = !DILocation(line: 39, column: 7, scope: !139)
!139 = distinct !DILexicalBlock(scope: !90, file: !1, line: 39, column: 3)
!140 = !DILocation(line: 0, scope: !139)
!141 = !DILocation(line: 39, column: 12, scope: !142)
!142 = distinct !DILexicalBlock(scope: !139, file: !1, line: 39, column: 3)
!143 = !DILocation(line: 39, column: 3, scope: !139)
!144 = !DILocation(line: 40, column: 7, scope: !145)
!145 = distinct !DILexicalBlock(scope: !146, file: !1, line: 40, column: 7)
!146 = distinct !DILexicalBlock(scope: !142, file: !1, line: 39, column: 19)
!147 = !DILocation(line: 40, column: 15, scope: !145)
!148 = !DILocation(line: 40, column: 13, scope: !145)
!149 = !DILocation(line: 40, column: 7, scope: !146)
!150 = !DILocation(line: 41, column: 17, scope: !151)
!151 = distinct !DILexicalBlock(scope: !145, file: !1, line: 40, column: 22)
!152 = !DILocation(line: 41, column: 22, scope: !151)
!153 = !DILocation(line: 41, column: 5, scope: !151)
!154 = !DILocation(line: 42, column: 5, scope: !151)
!155 = !DILocation(line: 44, column: 3, scope: !146)
!156 = !DILocation(line: 39, column: 16, scope: !142)
!157 = !DILocation(line: 39, column: 3, scope: !142)
!158 = distinct !{!158, !143, !159}
!159 = !DILocation(line: 44, column: 3, scope: !139)
!160 = !DILocation(line: 45, column: 2, scope: !90)
!161 = !DILocation(line: 31, column: 16, scope: !87)
!162 = !DILocation(line: 31, column: 2, scope: !87)
!163 = distinct !{!163, !88, !164}
!164 = !DILocation(line: 45, column: 2, scope: !84)
!165 = !DILocation(line: 47, column: 14, scope: !70)
!166 = !DILocation(line: 47, column: 19, scope: !70)
!167 = !DILocation(line: 47, column: 2, scope: !70)
!168 = !DILocation(line: 48, column: 1, scope: !70)
!169 = distinct !DISubprogram(name: "processFile", scope: !1, file: !1, line: 50, type: !170, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !6}
!172 = !DILocalVariable(name: "fileName", arg: 1, scope: !169, file: !1, line: 50, type: !6)
!173 = !DILocation(line: 0, scope: !169)
!174 = !DILocation(line: 51, column: 13, scope: !169)
!175 = !DILocalVariable(name: "fp", scope: !169, file: !1, line: 51, type: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !178, line: 7, baseType: !179)
!178 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !180, line: 49, size: 1728, elements: !181)
!180 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!181 = !{!182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !197, !199, !200, !201, !205, !207, !209, !213, !216, !218, !221, !224, !225, !226, !230, !231}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !179, file: !180, line: 51, baseType: !46, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !179, file: !180, line: 54, baseType: !6, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !179, file: !180, line: 55, baseType: !6, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !179, file: !180, line: 56, baseType: !6, size: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !179, file: !180, line: 57, baseType: !6, size: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !179, file: !180, line: 58, baseType: !6, size: 64, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !179, file: !180, line: 59, baseType: !6, size: 64, offset: 384)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !179, file: !180, line: 60, baseType: !6, size: 64, offset: 448)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !179, file: !180, line: 61, baseType: !6, size: 64, offset: 512)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !179, file: !180, line: 64, baseType: !6, size: 64, offset: 576)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !179, file: !180, line: 65, baseType: !6, size: 64, offset: 640)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !179, file: !180, line: 66, baseType: !6, size: 64, offset: 704)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !179, file: !180, line: 68, baseType: !195, size: 64, offset: 768)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !180, line: 36, flags: DIFlagFwdDecl)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !179, file: !180, line: 70, baseType: !198, size: 64, offset: 832)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !179, file: !180, line: 72, baseType: !46, size: 32, offset: 896)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !179, file: !180, line: 73, baseType: !46, size: 32, offset: 928)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !179, file: !180, line: 74, baseType: !202, size: 64, offset: 960)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !203, line: 152, baseType: !204)
!203 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!204 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !179, file: !180, line: 77, baseType: !206, size: 16, offset: 1024)
!206 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !179, file: !180, line: 78, baseType: !208, size: 8, offset: 1040)
!208 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !179, file: !180, line: 79, baseType: !210, size: 8, offset: 1048)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 1)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !179, file: !180, line: 81, baseType: !214, size: 64, offset: 1088)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !180, line: 43, baseType: null)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !179, file: !180, line: 89, baseType: !217, size: 64, offset: 1152)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !203, line: 153, baseType: !204)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !179, file: !180, line: 91, baseType: !219, size: 64, offset: 1216)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !180, line: 37, flags: DIFlagFwdDecl)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !179, file: !180, line: 92, baseType: !222, size: 64, offset: 1280)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !180, line: 38, flags: DIFlagFwdDecl)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !179, file: !180, line: 93, baseType: !198, size: 64, offset: 1344)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !179, file: !180, line: 94, baseType: !4, size: 64, offset: 1408)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !179, file: !180, line: 95, baseType: !227, size: 64, offset: 1472)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !228, line: 46, baseType: !229)
!228 = !DIFile(filename: "/u/NAS_SCRATCH/yc0769/xstack/xstack-installs/llvm-install-debug/lib/clang/10.0.1/include/stddef.h", directory: "")
!229 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !179, file: !180, line: 96, baseType: !46, size: 32, offset: 1536)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !179, file: !180, line: 98, baseType: !232, size: 160, offset: 1568)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 20)
!235 = !DILocalVariable(name: "str", scope: !169, file: !1, line: 52, type: !236)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 168, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 21)
!239 = !DILocation(line: 52, column: 7, scope: !169)
!240 = !DILocation(line: 54, column: 2, scope: !169)
!241 = !DILocation(line: 54, column: 14, scope: !169)
!242 = !DILocation(line: 54, column: 8, scope: !169)
!243 = !DILocation(line: 54, column: 24, scope: !169)
!244 = !DILocation(line: 55, column: 30, scope: !169)
!245 = !DILocation(line: 55, column: 21, scope: !169)
!246 = !DILocation(line: 55, column: 3, scope: !169)
!247 = distinct !{!247, !240, !248}
!248 = !DILocation(line: 55, column: 50, scope: !169)
!249 = !DILocation(line: 57, column: 2, scope: !169)
!250 = !DILocation(line: 58, column: 1, scope: !169)
!251 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 60, type: !252, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!252 = !DISubroutineType(types: !253)
!253 = !{!46, !46, !5}
!254 = !DILocalVariable(name: "argC", arg: 1, scope: !251, file: !1, line: 60, type: !46)
!255 = !DILocation(line: 0, scope: !251)
!256 = !DILocalVariable(name: "argV", arg: 2, scope: !251, file: !1, line: 60, type: !5)
!257 = !DILocation(line: 62, column: 12, scope: !258)
!258 = distinct !DILexicalBlock(scope: !251, file: !1, line: 62, column: 8)
!259 = !DILocation(line: 62, column: 8, scope: !251)
!260 = !DILocation(line: 63, column: 42, scope: !258)
!261 = !DILocation(line: 63, column: 3, scope: !258)
!262 = !DILocation(line: 65, column: 13, scope: !263)
!263 = distinct !DILexicalBlock(scope: !264, file: !1, line: 65, column: 6)
!264 = distinct !DILexicalBlock(scope: !258, file: !1, line: 64, column: 6)
!265 = !DILocation(line: 65, column: 6, scope: !263)
!266 = !DILocation(line: 65, column: 25, scope: !263)
!267 = !DILocation(line: 65, column: 6, scope: !264)
!268 = !DILocation(line: 66, column: 16, scope: !263)
!269 = !DILocation(line: 66, column: 4, scope: !263)
!270 = !DILocation(line: 68, column: 31, scope: !263)
!271 = !DILocation(line: 68, column: 22, scope: !263)
!272 = !DILocation(line: 68, column: 4, scope: !263)
!273 = !DILocation(line: 70, column: 2, scope: !251)
