; ModuleID = 'aliquot-sequence-classifications-1.bc'
source_filename = "aliquot-sequence-classifications-1.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [38 x i8] c"\0AInteger : %llu, Type : %s, Series : \00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"%llu, \00", align 1
@.str.2 = private unnamed_addr constant [5 x i8] c"%llu\00", align 1
@.str.3 = private unnamed_addr constant [12 x i8] c"Terminating\00", align 1
@.str.4 = private unnamed_addr constant [8 x i8] c"Perfect\00", align 1
@.str.5 = private unnamed_addr constant [9 x i8] c"Amicable\00", align 1
@.str.6 = private unnamed_addr constant [9 x i8] c"Aspiring\00", align 1
@.str.7 = private unnamed_addr constant [9 x i8] c"Sociable\00", align 1
@.str.8 = private unnamed_addr constant [7 x i8] c"Cyclic\00", align 1
@.str.9 = private unnamed_addr constant [16 x i8] c"Non-Terminating\00", align 1
@.str.10 = private unnamed_addr constant [2 x i8] c"r\00", align 1

!131 = !DILocation(line: 34, column: 41, scope: !120)
!132 = !DILocation(line: 34, column: 42, scope: !120)
!133 = !DILocation(line: 34, column: 37, scope: !120)
!134 = !DILocation(line: 34, column: 35, scope: !120)
!135 = !DILocation(line: 34, column: 46, scope: !120)
!136 = !DILocation(line: 34, column: 53, scope: !120)
!137 = !DILocation(line: 34, column: 49, scope: !120)
!138 = !DILocation(line: 34, column: 57, scope: !120)
!139 = !DILocation(line: 34, column: 55, scope: !120)
!140 = !DILocation(line: 34, column: 6, scope: !112)
!141 = !DILocation(line: 35, column: 16, scope: !142)
!142 = distinct !DILexicalBlock(scope: !120, file: !1, line: 34, column: 60)
!143 = !DILocation(line: 35, column: 20, scope: !142)
!144 = !DILocation(line: 35, column: 21, scope: !142)
!145 = !DILocation(line: 35, column: 29, scope: !142)
!146 = !DILocation(line: 35, column: 25, scope: !142)
!147 = !DILocation(line: 35, column: 31, scope: !142)
!148 = !DILocation(line: 35, column: 24, scope: !142)
!149 = !DILocation(line: 35, column: 55, scope: !142)
!150 = !DILocation(line: 35, column: 51, scope: !142)
!151 = !DILocation(line: 35, column: 59, scope: !142)
!152 = !DILocation(line: 35, column: 57, scope: !142)
!153 = !DILocation(line: 35, column: 61, scope: !142)
!154 = !DILocation(line: 35, column: 64, scope: !142)
!155 = !DILocation(line: 35, column: 65, scope: !142)
!156 = !DILocation(line: 35, column: 50, scope: !142)
!157 = !DILocation(line: 35, column: 85, scope: !142)
!158 = !DILocation(line: 35, column: 81, scope: !142)
!159 = !DILocation(line: 35, column: 89, scope: !142)
!160 = !DILocation(line: 35, column: 87, scope: !142)
!161 = !DILocation(line: 35, column: 91, scope: !142)
!162 = !DILocation(line: 35, column: 94, scope: !142)
!163 = !DILocation(line: 35, column: 95, scope: !142)
!164 = !DILocation(line: 35, column: 80, scope: !142)
!165 = !DILocation(line: 35, column: 116, scope: !142)
!166 = !DILocation(line: 35, column: 112, scope: !142)
!167 = !DILocation(line: 35, column: 124, scope: !142)
!168 = !DILocation(line: 35, column: 125, scope: !142)
!169 = !DILocation(line: 35, column: 120, scope: !142)
!170 = !DILocation(line: 35, column: 118, scope: !142)
!171 = !DILocation(line: 35, column: 129, scope: !142)
!172 = !DILocation(line: 35, column: 136, scope: !142)
!173 = !DILocation(line: 35, column: 132, scope: !142)
!174 = !DILocation(line: 35, column: 140, scope: !142)
!175 = !DILocation(line: 35, column: 138, scope: !142)
!176 = !DILocation(line: 0, scope: !142)
!177 = !DILocation(line: 35, column: 111, scope: !142)
!178 = !DILocation(line: 35, column: 4, scope: !142)
!179 = !DILocation(line: 36, column: 4, scope: !142)
!180 = !DILocation(line: 39, column: 8, scope: !181)
!181 = distinct !DILexicalBlock(scope: !112, file: !1, line: 39, column: 3)
!182 = !DILocation(line: 39, column: 7, scope: !181)
!183 = !DILocation(line: 39, column: 11, scope: !184)
!184 = distinct !DILexicalBlock(scope: !181, file: !1, line: 39, column: 3)
!185 = !DILocation(line: 39, column: 13, scope: !184)
!186 = !DILocation(line: 39, column: 12, scope: !184)
!187 = !DILocation(line: 39, column: 3, scope: !181)
!188 = !DILocation(line: 40, column: 11, scope: !189)
!189 = distinct !DILexicalBlock(scope: !190, file: !1, line: 40, column: 7)
!190 = distinct !DILexicalBlock(scope: !184, file: !1, line: 39, column: 19)
!191 = !DILocation(line: 40, column: 7, scope: !189)
!192 = !DILocation(line: 40, column: 19, scope: !189)
!193 = !DILocation(line: 40, column: 15, scope: !189)
!194 = !DILocation(line: 40, column: 13, scope: !189)
!195 = !DILocation(line: 40, column: 7, scope: !190)
!196 = !DILocation(line: 41, column: 17, scope: !197)
!197 = distinct !DILexicalBlock(scope: !189, file: !1, line: 40, column: 22)
!198 = !DILocation(line: 41, column: 21, scope: !197)
!199 = !DILocation(line: 41, column: 22, scope: !197)
!200 = !DILocation(line: 41, column: 5, scope: !197)
!201 = !DILocation(line: 42, column: 5, scope: !197)
!202 = !DILocation(line: 44, column: 3, scope: !190)
!203 = !DILocation(line: 39, column: 16, scope: !184)
!204 = !DILocation(line: 39, column: 3, scope: !184)
!205 = distinct !{!205, !187, !206}
!206 = !DILocation(line: 44, column: 3, scope: !181)
!207 = !DILocation(line: 45, column: 2, scope: !112)
!208 = !DILocation(line: 31, column: 16, scope: !108)
!209 = !DILocation(line: 31, column: 2, scope: !108)
!210 = distinct !{!210, !110, !211}
!211 = !DILocation(line: 45, column: 2, scope: !105)
!212 = !DILocation(line: 47, column: 14, scope: !87)
!213 = !DILocation(line: 47, column: 18, scope: !87)
!214 = !DILocation(line: 47, column: 19, scope: !87)
!215 = !DILocation(line: 47, column: 2, scope: !87)
!216 = !DILocation(line: 48, column: 1, scope: !87)
!217 = distinct !DISubprogram(name: "processFile", scope: !1, file: !1, line: 50, type: !218, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !6}
!220 = !DILocalVariable(name: "fileName", arg: 1, scope: !217, file: !1, line: 50, type: !6)
!221 = !DILocation(line: 50, column: 24, scope: !217)
!222 = !DILocalVariable(name: "fp", scope: !217, file: !1, line: 51, type: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !225, line: 7, baseType: !226)
!225 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !227, line: 49, size: 1728, elements: !228)
!227 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!228 = !{!229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !244, !246, !247, !248, !252, !254, !256, !260, !263, !265, !268, !271, !272, !273, !277, !278}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !226, file: !227, line: 51, baseType: !55, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !226, file: !227, line: 54, baseType: !6, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !226, file: !227, line: 55, baseType: !6, size: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !226, file: !227, line: 56, baseType: !6, size: 64, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !226, file: !227, line: 57, baseType: !6, size: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !226, file: !227, line: 58, baseType: !6, size: 64, offset: 320)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !226, file: !227, line: 59, baseType: !6, size: 64, offset: 384)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !226, file: !227, line: 60, baseType: !6, size: 64, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !226, file: !227, line: 61, baseType: !6, size: 64, offset: 512)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !226, file: !227, line: 64, baseType: !6, size: 64, offset: 576)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !226, file: !227, line: 65, baseType: !6, size: 64, offset: 640)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !226, file: !227, line: 66, baseType: !6, size: 64, offset: 704)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !226, file: !227, line: 68, baseType: !242, size: 64, offset: 768)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !227, line: 36, flags: DIFlagFwdDecl)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !226, file: !227, line: 70, baseType: !245, size: 64, offset: 832)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !226, file: !227, line: 72, baseType: !55, size: 32, offset: 896)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !226, file: !227, line: 73, baseType: !55, size: 32, offset: 928)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !226, file: !227, line: 74, baseType: !249, size: 64, offset: 960)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !250, line: 152, baseType: !251)
!250 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!251 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !226, file: !227, line: 77, baseType: !253, size: 16, offset: 1024)
!253 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !226, file: !227, line: 78, baseType: !255, size: 8, offset: 1040)
!255 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !226, file: !227, line: 79, baseType: !257, size: 8, offset: 1048)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 1)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !226, file: !227, line: 81, baseType: !261, size: 64, offset: 1088)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !227, line: 43, baseType: null)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !226, file: !227, line: 89, baseType: !264, size: 64, offset: 1152)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !250, line: 153, baseType: !251)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !226, file: !227, line: 91, baseType: !266, size: 64, offset: 1216)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !227, line: 37, flags: DIFlagFwdDecl)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !226, file: !227, line: 92, baseType: !269, size: 64, offset: 1280)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !227, line: 38, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !226, file: !227, line: 93, baseType: !245, size: 64, offset: 1344)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !226, file: !227, line: 94, baseType: !4, size: 64, offset: 1408)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !226, file: !227, line: 95, baseType: !274, size: 64, offset: 1472)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !275, line: 46, baseType: !276)
!275 = !DIFile(filename: "/u/NAS_SCRATCH/yc0769/xstack/xstack-installs/llvm-install-debug/lib/clang/10.0.1/include/stddef.h", directory: "")
!276 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !226, file: !227, line: 96, baseType: !55, size: 32, offset: 1536)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !226, file: !227, line: 98, baseType: !279, size: 160, offset: 1568)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 20)
!282 = !DILocation(line: 51, column: 8, scope: !217)
!283 = !DILocation(line: 51, column: 19, scope: !217)
!284 = !DILocation(line: 51, column: 13, scope: !217)
!285 = !DILocalVariable(name: "str", scope: !217, file: !1, line: 52, type: !286)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 168, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 21)
!289 = !DILocation(line: 52, column: 7, scope: !217)
!290 = !DILocation(line: 54, column: 2, scope: !217)
!291 = !DILocation(line: 54, column: 14, scope: !217)
!292 = !DILocation(line: 54, column: 21, scope: !217)
!293 = !DILocation(line: 54, column: 8, scope: !217)
!294 = !DILocation(line: 54, column: 24, scope: !217)
!295 = !DILocation(line: 55, column: 30, scope: !217)
!296 = !DILocation(line: 55, column: 21, scope: !217)
!297 = !DILocation(line: 55, column: 3, scope: !217)
!298 = distinct !{!298, !290, !299}
!299 = !DILocation(line: 55, column: 50, scope: !217)
!300 = !DILocation(line: 57, column: 9, scope: !217)
!301 = !DILocation(line: 57, column: 2, scope: !217)
!302 = !DILocation(line: 58, column: 1, scope: !217)
!303 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 60, type: !304, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!304 = !DISubroutineType(types: !305)
!305 = !{!55, !55, !5}
!306 = !DILocalVariable(name: "argC", arg: 1, scope: !303, file: !1, line: 60, type: !55)
!307 = !DILocation(line: 60, column: 14, scope: !303)
!308 = !DILocalVariable(name: "argV", arg: 2, scope: !303, file: !1, line: 60, type: !5)
!309 = !DILocation(line: 60, column: 25, scope: !303)
!310 = !DILocation(line: 62, column: 8, scope: !311)
!311 = distinct !DILexicalBlock(scope: !303, file: !1, line: 62, column: 8)
!312 = !DILocation(line: 62, column: 12, scope: !311)
!313 = !DILocation(line: 62, column: 8, scope: !303)
!314 = !DILocation(line: 63, column: 42, scope: !311)
!315 = !DILocation(line: 63, column: 3, scope: !311)
!316 = !DILocation(line: 65, column: 13, scope: !317)
!317 = distinct !DILexicalBlock(scope: !318, file: !1, line: 65, column: 6)
!318 = distinct !DILexicalBlock(scope: !311, file: !1, line: 64, column: 6)
!319 = !DILocation(line: 65, column: 6, scope: !317)
!320 = !DILocation(line: 65, column: 25, scope: !317)
!321 = !DILocation(line: 65, column: 6, scope: !318)
!322 = !DILocation(line: 66, column: 16, scope: !317)
!323 = !DILocation(line: 66, column: 4, scope: !317)
!324 = !DILocation(line: 68, column: 31, scope: !317)
!325 = !DILocation(line: 68, column: 22, scope: !317)
!326 = !DILocation(line: 68, column: 4, scope: !317)
!327 = !DILocation(line: 70, column: 2, scope: !303)
