; ModuleID = 'draw-a-clock.ll'
source_filename = "draw-a-clock.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.timeval = type { i64, i64 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }

@.str = private unnamed_addr constant [12 x i8] c" .:-*ca&#%@\00", align 1
@shades = dso_local global i8* getelementptr inbounds ([12 x i8], [12 x i8]* @.str, i32 0, i32 0), align 8, !dbg !0
@__const.draw.fade = private unnamed_addr constant [3 x double] [double 1.000000e+00, double 3.500000e-01, double 3.500000e-01], align 16
@.str.1 = private unnamed_addr constant [4 x i8] c"\1B[s\00", align 1
@.str.2 = private unnamed_addr constant [8 x i8] c"\1B[%d;0H\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"\1B[u\00", align 1
@stdout = external dso_local global %struct._IO_FILE*, align 8

; Function Attrs: noinline nounwind uwtable
define dso_local double @dist(double %x, double %y, double %x0, double %y0) #0 !dbg !19 {
entry:

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "shades", scope: !2, file: !3, line: 8, type: !12, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !11, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "draw-a-clock.c", directory: "/scratch/yc0769/xstack_benchmark/rosetta/Draw-a-clock")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 24, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "sec", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "min", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "hur", value: 2, isUnsigned: true)
!11 = !{!0}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!15 = !{i32 7, !"Dwarf Version", i32 4}
!16 = !{i32 2, !"Debug Info Version", i32 3}
!17 = !{i32 1, !"wchar_size", i32 4}
!18 = !{!"clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!19 = distinct !DISubprogram(name: "dist", scope: !3, file: !3, line: 11, type: !20, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !23)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !22, !22, !22, !22}
!22 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!23 = !{}
!24 = !DILocalVariable(name: "x", arg: 1, scope: !19, file: !3, line: 11, type: !22)
!25 = !DILocation(line: 0, scope: !19)
!26 = !DILocalVariable(name: "y", arg: 2, scope: !19, file: !3, line: 11, type: !22)
!27 = !DILocalVariable(name: "x0", arg: 3, scope: !19, file: !3, line: 11, type: !22)
!28 = !DILocalVariable(name: "y0", arg: 4, scope: !19, file: !3, line: 11, type: !22)
!29 = !DILocation(line: 12, column: 16, scope: !19)
!30 = !DILocation(line: 12, column: 25, scope: !19)
!31 = !DILocation(line: 12, column: 21, scope: !19)
!32 = !DILocation(line: 12, column: 37, scope: !19)
!33 = !DILocation(line: 12, column: 47, scope: !19)
!34 = !DILocation(line: 12, column: 42, scope: !19)
!35 = !DILocation(line: 12, column: 31, scope: !19)
!36 = !DILocalVariable(name: "l", scope: !19, file: !3, line: 12, type: !22)
!37 = !DILocation(line: 14, column: 8, scope: !38)
!38 = distinct !DILexicalBlock(scope: !19, file: !3, line: 14, column: 6)
!39 = !DILocation(line: 14, column: 6, scope: !19)
!40 = !DILocation(line: 15, column: 5, scope: !41)
!41 = distinct !DILexicalBlock(scope: !38, file: !3, line: 14, column: 13)
!42 = !DILocation(line: 16, column: 5, scope: !41)
!43 = !DILocation(line: 17, column: 2, scope: !41)
!44 = !DILocation(line: 17, column: 15, scope: !45)
!45 = distinct !DILexicalBlock(scope: !38, file: !3, line: 17, column: 13)
!46 = !DILocation(line: 17, column: 13, scope: !38)
!47 = !DILocation(line: 18, column: 10, scope: !48)
!48 = distinct !DILexicalBlock(scope: !45, file: !3, line: 17, column: 21)
!49 = !DILocation(line: 18, column: 5, scope: !48)
!50 = !DILocation(line: 19, column: 10, scope: !48)
!51 = !DILocation(line: 19, column: 5, scope: !48)
!52 = !DILocation(line: 20, column: 2, scope: !48)
!53 = !DILocation(line: 0, scope: !38)
!54 = !DILocation(line: 21, column: 16, scope: !19)
!55 = !DILocation(line: 21, column: 24, scope: !19)
!56 = !DILocation(line: 21, column: 20, scope: !19)
!57 = !DILocation(line: 21, column: 9, scope: !19)
!58 = !DILocation(line: 21, column: 2, scope: !19)
!59 = distinct !DISubprogram(name: "draw", scope: !3, file: !3, line: 26, type: !60, scopeLine: 27, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !23)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !62}
!62 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!63 = !DILocalVariable(name: "size", arg: 1, scope: !59, file: !3, line: 26, type: !62)
!64 = !DILocation(line: 0, scope: !59)
!65 = !DILocation(line: 31, column: 21, scope: !59)
!66 = !DILocation(line: 31, column: 26, scope: !59)
!67 = !DILocalVariable(name: "cx", scope: !59, file: !3, line: 31, type: !22)
!68 = !DILocalVariable(name: "sx", scope: !59, file: !3, line: 32, type: !69)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 192, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 3)
!72 = !DILocation(line: 32, column: 9, scope: !59)
!73 = !DILocalVariable(name: "sy", scope: !59, file: !3, line: 32, type: !69)
!74 = !DILocation(line: 32, column: 16, scope: !59)
!75 = !DILocalVariable(name: "sw", scope: !59, file: !3, line: 32, type: !69)
!76 = !DILocation(line: 32, column: 23, scope: !59)
!77 = !DILocalVariable(name: "fade", scope: !59, file: !3, line: 33, type: !69)
!78 = !DILocation(line: 33, column: 9, scope: !59)
!79 = !DILocalVariable(name: "tv", scope: !59, file: !3, line: 34, type: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !81, line: 8, size: 128, elements: !82)
!81 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "")
!82 = !{!83, !87}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !80, file: !81, line: 10, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !85, line: 160, baseType: !86)
!85 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!86 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !80, file: !81, line: 11, baseType: !88, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !85, line: 162, baseType: !86)
!89 = !DILocation(line: 34, column: 17, scope: !59)
!90 = !DILocation(line: 38, column: 12, scope: !59)
!91 = !DILocation(line: 38, column: 17, scope: !59)
!92 = !DILocation(line: 38, column: 2, scope: !59)
!93 = !DILocation(line: 38, column: 10, scope: !59)
!94 = !DILocation(line: 39, column: 12, scope: !59)
!95 = !DILocation(line: 39, column: 17, scope: !59)
!96 = !DILocation(line: 39, column: 2, scope: !59)
!97 = !DILocation(line: 39, column: 10, scope: !59)
!98 = !DILocation(line: 40, column: 12, scope: !59)
!99 = !DILocation(line: 40, column: 17, scope: !59)
!100 = !DILocation(line: 40, column: 2, scope: !59)
!101 = !DILocation(line: 40, column: 10, scope: !59)
!102 = !DILabel(scope: !59, name: "every_second", file: !3, line: 42)
!103 = !DILocation(line: 42, column: 1, scope: !59)
!104 = !DILocation(line: 43, column: 2, scope: !59)
!105 = !DILocation(line: 44, column: 20, scope: !59)
!106 = !DILocation(line: 44, column: 6, scope: !59)
!107 = !DILocalVariable(name: "t", scope: !59, file: !3, line: 35, type: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !110, line: 7, size: 448, elements: !111)
!110 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "")
!111 = !{!112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !109, file: !110, line: 9, baseType: !62, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !109, file: !110, line: 10, baseType: !62, size: 32, offset: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !109, file: !110, line: 11, baseType: !62, size: 32, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !109, file: !110, line: 12, baseType: !62, size: 32, offset: 96)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !109, file: !110, line: 13, baseType: !62, size: 32, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !109, file: !110, line: 14, baseType: !62, size: 32, offset: 160)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !109, file: !110, line: 15, baseType: !62, size: 32, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !109, file: !110, line: 16, baseType: !62, size: 32, offset: 224)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !109, file: !110, line: 17, baseType: !62, size: 32, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !109, file: !110, line: 20, baseType: !86, size: 64, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !109, file: !110, line: 21, baseType: !12, size: 64, offset: 384)
!123 = !DILocation(line: 46, column: 13, scope: !59)
!124 = !DILocation(line: 46, column: 10, scope: !59)
!125 = !DILocation(line: 46, column: 20, scope: !59)
!126 = !DILocation(line: 46, column: 25, scope: !59)
!127 = !DILocalVariable(name: "angle", scope: !59, file: !3, line: 31, type: !22)
!128 = !DILocation(line: 47, column: 12, scope: !59)
!129 = !DILocation(line: 47, column: 18, scope: !59)
!130 = !DILocation(line: 47, column: 16, scope: !59)
!131 = !DILocation(line: 47, column: 2, scope: !59)
!132 = !DILocation(line: 47, column: 10, scope: !59)
!133 = !DILocation(line: 48, column: 18, scope: !59)
!134 = !DILocation(line: 48, column: 16, scope: !59)
!135 = !DILocation(line: 48, column: 2, scope: !59)
!136 = !DILocation(line: 48, column: 10, scope: !59)
!137 = !DILocation(line: 50, column: 14, scope: !59)
!138 = !DILocation(line: 50, column: 11, scope: !59)
!139 = !DILocation(line: 50, column: 26, scope: !59)
!140 = !DILocation(line: 50, column: 23, scope: !59)
!141 = !DILocation(line: 50, column: 33, scope: !59)
!142 = !DILocation(line: 50, column: 21, scope: !59)
!143 = !DILocation(line: 50, column: 40, scope: !59)
!144 = !DILocation(line: 50, column: 45, scope: !59)
!145 = !DILocation(line: 51, column: 12, scope: !59)
!146 = !DILocation(line: 51, column: 18, scope: !59)
!147 = !DILocation(line: 51, column: 16, scope: !59)
!148 = !DILocation(line: 51, column: 29, scope: !59)
!149 = !DILocation(line: 51, column: 2, scope: !59)
!150 = !DILocation(line: 51, column: 10, scope: !59)
!151 = !DILocation(line: 52, column: 18, scope: !59)
!152 = !DILocation(line: 52, column: 16, scope: !59)
!153 = !DILocation(line: 52, column: 29, scope: !59)
!154 = !DILocation(line: 52, column: 2, scope: !59)
!155 = !DILocation(line: 52, column: 10, scope: !59)
!156 = !DILocation(line: 54, column: 14, scope: !59)
!157 = !DILocation(line: 54, column: 11, scope: !59)
!158 = !DILocation(line: 54, column: 27, scope: !59)
!159 = !DILocation(line: 54, column: 24, scope: !59)
!160 = !DILocation(line: 54, column: 34, scope: !59)
!161 = !DILocation(line: 54, column: 22, scope: !59)
!162 = !DILocation(line: 54, column: 41, scope: !59)
!163 = !DILocation(line: 54, column: 45, scope: !59)
!164 = !DILocation(line: 55, column: 12, scope: !59)
!165 = !DILocation(line: 55, column: 18, scope: !59)
!166 = !DILocation(line: 55, column: 16, scope: !59)
!167 = !DILocation(line: 55, column: 29, scope: !59)
!168 = !DILocation(line: 55, column: 2, scope: !59)
!169 = !DILocation(line: 55, column: 10, scope: !59)
!170 = !DILocation(line: 56, column: 18, scope: !59)
!171 = !DILocation(line: 56, column: 16, scope: !59)
!172 = !DILocation(line: 56, column: 29, scope: !59)
!173 = !DILocation(line: 56, column: 2, scope: !59)
!174 = !DILocation(line: 56, column: 10, scope: !59)
!175 = !DILocation(line: 58, column: 2, scope: !59)
!176 = !DILocalVariable(name: "i", scope: !177, file: !3, line: 59, type: !62)
!177 = distinct !DILexicalBlock(scope: !59, file: !3, line: 59, column: 2)
!178 = !DILocation(line: 0, scope: !177)
!179 = !DILocation(line: 59, column: 2, scope: !177)
!180 = !DILocation(line: 59, column: 2, scope: !181)
!181 = distinct !DILexicalBlock(scope: !177, file: !3, line: 59, column: 2)
!182 = !DILocation(line: 60, column: 3, scope: !183)
!183 = distinct !DILexicalBlock(scope: !181, file: !3, line: 59, column: 8)
!184 = !DILocation(line: 61, column: 14, scope: !183)
!185 = !DILocation(line: 61, column: 16, scope: !183)
!186 = !DILocalVariable(name: "y", scope: !183, file: !3, line: 61, type: !22)
!187 = !DILocation(line: 0, scope: !183)
!188 = !DILocalVariable(name: "j", scope: !189, file: !3, line: 62, type: !62)
!189 = distinct !DILexicalBlock(scope: !183, file: !3, line: 62, column: 3)
!190 = !DILocation(line: 0, scope: !189)
!191 = !DILocation(line: 62, column: 3, scope: !189)
!192 = !DILocation(line: 62, column: 3, scope: !193)
