; ModuleID = 'draw-a-clock.ll'
source_filename = "draw-a-clock.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.timeval = type { i64, i64 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }

@.str = private unnamed_addr constant [12 x i8] c" .:-*ca&#%@\00", align 1
@shades = dso_local global i8* getelementptr inbounds ([12 x i8], [12 x i8]* @.str, i32 0, i32 0), align 8, !dbg !0
@__const.draw.fade = private unnamed_addr constant [3 x double] [double 1.000000e+00, double 3.500000e-01, double 3.500000e-01], align 16
@.str.1 = private unnamed_addr constant [4 x i8] c"\1B[s\00", align 1
@.str.2 = private unnamed_addr constant [8 x i8] c"\1B[%d;0H\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"\1B[u\00", align 1
@stdout = external dso_local global %struct._IO_FILE*, align 8

; Function Attrs: noinline nounwind uwtable
define dso_local double @dist(double %x, double %y, double %x0, double %y0) #0 !dbg !19 {
entry:
  %x.addr = alloca double, align 8
  %y.addr = alloca double, align 8

!15 = !{i32 7, !"Dwarf Version", i32 4}
!16 = !{i32 2, !"Debug Info Version", i32 3}
!17 = !{i32 1, !"wchar_size", i32 4}
!18 = !{!"clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!19 = distinct !DISubprogram(name: "dist", scope: !3, file: !3, line: 11, type: !20, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !23)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !22, !22, !22, !22}
!22 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!23 = !{}
!24 = !DILocalVariable(name: "x", arg: 1, scope: !19, file: !3, line: 11, type: !22)
!25 = !DILocation(line: 11, column: 20, scope: !19)
!26 = !DILocalVariable(name: "y", arg: 2, scope: !19, file: !3, line: 11, type: !22)
!27 = !DILocation(line: 11, column: 30, scope: !19)
!28 = !DILocalVariable(name: "x0", arg: 3, scope: !19, file: !3, line: 11, type: !22)
!29 = !DILocation(line: 11, column: 40, scope: !19)
!30 = !DILocalVariable(name: "y0", arg: 4, scope: !19, file: !3, line: 11, type: !22)
!31 = !DILocation(line: 11, column: 51, scope: !19)
!32 = !DILocalVariable(name: "l", scope: !19, file: !3, line: 12, type: !22)
!33 = !DILocation(line: 12, column: 9, scope: !19)
!34 = !DILocation(line: 12, column: 14, scope: !19)
!35 = !DILocation(line: 12, column: 18, scope: !19)
!36 = !DILocation(line: 12, column: 16, scope: !19)
!37 = !DILocation(line: 12, column: 23, scope: !19)
!38 = !DILocation(line: 12, column: 27, scope: !19)
!39 = !DILocation(line: 12, column: 25, scope: !19)
!40 = !DILocation(line: 12, column: 21, scope: !19)
!41 = !DILocation(line: 12, column: 34, scope: !19)
!42 = !DILocation(line: 12, column: 39, scope: !19)
!43 = !DILocation(line: 12, column: 37, scope: !19)
!44 = !DILocation(line: 12, column: 44, scope: !19)
!45 = !DILocation(line: 12, column: 49, scope: !19)
!46 = !DILocation(line: 12, column: 47, scope: !19)
!47 = !DILocation(line: 12, column: 42, scope: !19)
!48 = !DILocation(line: 12, column: 31, scope: !19)
!49 = !DILocation(line: 14, column: 6, scope: !50)
!50 = distinct !DILexicalBlock(scope: !19, file: !3, line: 14, column: 6)
!51 = !DILocation(line: 14, column: 8, scope: !50)
!52 = !DILocation(line: 14, column: 6, scope: !19)
!53 = !DILocation(line: 15, column: 8, scope: !54)
!54 = distinct !DILexicalBlock(scope: !50, file: !3, line: 14, column: 13)
!55 = !DILocation(line: 15, column: 5, scope: !54)
!56 = !DILocation(line: 16, column: 8, scope: !54)
!57 = !DILocation(line: 16, column: 5, scope: !54)
!58 = !DILocation(line: 17, column: 2, scope: !54)
!59 = !DILocation(line: 17, column: 13, scope: !60)
!60 = distinct !DILexicalBlock(scope: !50, file: !3, line: 17, column: 13)
!61 = !DILocation(line: 17, column: 15, scope: !60)
!62 = !DILocation(line: 17, column: 13, scope: !50)
!63 = !DILocation(line: 18, column: 8, scope: !64)
!64 = distinct !DILexicalBlock(scope: !60, file: !3, line: 17, column: 21)
!65 = !DILocation(line: 18, column: 12, scope: !64)
!66 = !DILocation(line: 18, column: 10, scope: !64)
!67 = !DILocation(line: 18, column: 5, scope: !64)
!68 = !DILocation(line: 19, column: 8, scope: !64)
!69 = !DILocation(line: 19, column: 12, scope: !64)
!70 = !DILocation(line: 19, column: 10, scope: !64)
!71 = !DILocation(line: 19, column: 5, scope: !64)
!72 = !DILocation(line: 20, column: 2, scope: !64)
!73 = !DILocation(line: 21, column: 14, scope: !19)
!74 = !DILocation(line: 21, column: 18, scope: !19)
!75 = !DILocation(line: 21, column: 16, scope: !19)
!76 = !DILocation(line: 21, column: 22, scope: !19)
!77 = !DILocation(line: 21, column: 26, scope: !19)
!78 = !DILocation(line: 21, column: 24, scope: !19)
!79 = !DILocation(line: 21, column: 20, scope: !19)
!80 = !DILocation(line: 21, column: 9, scope: !19)
!81 = !DILocation(line: 21, column: 2, scope: !19)
!82 = distinct !DISubprogram(name: "draw", scope: !3, file: !3, line: 26, type: !83, scopeLine: 27, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !23)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !85}
!85 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!86 = !DILocalVariable(name: "size", arg: 1, scope: !82, file: !3, line: 26, type: !85)
!87 = !DILocation(line: 26, column: 15, scope: !82)
!88 = !DILocalVariable(name: "angle", scope: !82, file: !3, line: 31, type: !22)
!89 = !DILocation(line: 31, column: 9, scope: !82)
!90 = !DILocalVariable(name: "cx", scope: !82, file: !3, line: 31, type: !22)
!91 = !DILocation(line: 31, column: 16, scope: !82)
!92 = !DILocation(line: 31, column: 21, scope: !82)
!93 = !DILocation(line: 31, column: 26, scope: !82)
!94 = !DILocalVariable(name: "sx", scope: !82, file: !3, line: 32, type: !95)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 192, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 3)
!98 = !DILocation(line: 32, column: 9, scope: !82)
!99 = !DILocalVariable(name: "sy", scope: !82, file: !3, line: 32, type: !95)
!100 = !DILocation(line: 32, column: 16, scope: !82)
!101 = !DILocalVariable(name: "sw", scope: !82, file: !3, line: 32, type: !95)
!102 = !DILocation(line: 32, column: 23, scope: !82)
!103 = !DILocalVariable(name: "fade", scope: !82, file: !3, line: 33, type: !95)
!104 = !DILocation(line: 33, column: 9, scope: !82)
!105 = !DILocalVariable(name: "tv", scope: !82, file: !3, line: 34, type: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !107, line: 8, size: 128, elements: !108)
!107 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "")
!108 = !{!109, !113}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !106, file: !107, line: 10, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !111, line: 160, baseType: !112)
!111 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!112 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !106, file: !107, line: 11, baseType: !114, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !111, line: 162, baseType: !112)
!115 = !DILocation(line: 34, column: 17, scope: !82)
!116 = !DILocalVariable(name: "t", scope: !82, file: !3, line: 35, type: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !119, line: 7, size: 448, elements: !120)
!119 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "")
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !118, file: !119, line: 9, baseType: !85, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !118, file: !119, line: 10, baseType: !85, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !118, file: !119, line: 11, baseType: !85, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !118, file: !119, line: 12, baseType: !85, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !118, file: !119, line: 13, baseType: !85, size: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !118, file: !119, line: 14, baseType: !85, size: 32, offset: 160)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !118, file: !119, line: 15, baseType: !85, size: 32, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !118, file: !119, line: 16, baseType: !85, size: 32, offset: 224)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !118, file: !119, line: 17, baseType: !85, size: 32, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !118, file: !119, line: 20, baseType: !112, size: 64, offset: 320)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !118, file: !119, line: 21, baseType: !12, size: 64, offset: 384)
!132 = !DILocation(line: 35, column: 13, scope: !82)
!133 = !DILocation(line: 38, column: 12, scope: !82)
!134 = !DILocation(line: 38, column: 17, scope: !82)
!135 = !DILocation(line: 38, column: 2, scope: !82)
!136 = !DILocation(line: 38, column: 10, scope: !82)
!137 = !DILocation(line: 39, column: 12, scope: !82)
!138 = !DILocation(line: 39, column: 17, scope: !82)
!139 = !DILocation(line: 39, column: 2, scope: !82)
!140 = !DILocation(line: 39, column: 10, scope: !82)
!141 = !DILocation(line: 40, column: 12, scope: !82)
!142 = !DILocation(line: 40, column: 17, scope: !82)
!143 = !DILocation(line: 40, column: 2, scope: !82)
!144 = !DILocation(line: 40, column: 10, scope: !82)
!145 = !DILabel(scope: !82, name: "every_second", file: !3, line: 42)
!146 = !DILocation(line: 42, column: 1, scope: !82)
!147 = !DILocation(line: 43, column: 2, scope: !82)
!148 = !DILocation(line: 44, column: 20, scope: !82)
!149 = !DILocation(line: 44, column: 6, scope: !82)
!150 = !DILocation(line: 44, column: 4, scope: !82)
!151 = !DILocation(line: 46, column: 10, scope: !82)
!152 = !DILocation(line: 46, column: 13, scope: !82)
!153 = !DILocation(line: 46, column: 20, scope: !82)
!154 = !DILocation(line: 46, column: 25, scope: !82)
!155 = !DILocation(line: 46, column: 8, scope: !82)
!156 = !DILocation(line: 47, column: 13, scope: !82)
!157 = !DILocation(line: 47, column: 12, scope: !82)
!158 = !DILocation(line: 47, column: 22, scope: !82)
!159 = !DILocation(line: 47, column: 18, scope: !82)
!160 = !DILocation(line: 47, column: 16, scope: !82)
!161 = !DILocation(line: 47, column: 2, scope: !82)
!162 = !DILocation(line: 47, column: 10, scope: !82)
!163 = !DILocation(line: 48, column: 13, scope: !82)
!164 = !DILocation(line: 48, column: 22, scope: !82)
!165 = !DILocation(line: 48, column: 18, scope: !82)
!166 = !DILocation(line: 48, column: 16, scope: !82)
!167 = !DILocation(line: 48, column: 2, scope: !82)
!168 = !DILocation(line: 48, column: 10, scope: !82)
!169 = !DILocation(line: 50, column: 11, scope: !82)
!170 = !DILocation(line: 50, column: 14, scope: !82)
!171 = !DILocation(line: 50, column: 23, scope: !82)
!172 = !DILocation(line: 50, column: 26, scope: !82)
!173 = !DILocation(line: 50, column: 33, scope: !82)
!174 = !DILocation(line: 50, column: 21, scope: !82)
!175 = !DILocation(line: 50, column: 40, scope: !82)
!176 = !DILocation(line: 50, column: 45, scope: !82)
!177 = !DILocation(line: 50, column: 8, scope: !82)
!178 = !DILocation(line: 51, column: 13, scope: !82)
!179 = !DILocation(line: 51, column: 12, scope: !82)
!180 = !DILocation(line: 51, column: 22, scope: !82)
!181 = !DILocation(line: 51, column: 18, scope: !82)
!182 = !DILocation(line: 51, column: 16, scope: !82)
!183 = !DILocation(line: 51, column: 29, scope: !82)
!184 = !DILocation(line: 51, column: 2, scope: !82)
!185 = !DILocation(line: 51, column: 10, scope: !82)
!186 = !DILocation(line: 52, column: 13, scope: !82)
!187 = !DILocation(line: 52, column: 22, scope: !82)
!188 = !DILocation(line: 52, column: 18, scope: !82)
!189 = !DILocation(line: 52, column: 16, scope: !82)
!190 = !DILocation(line: 52, column: 29, scope: !82)
!191 = !DILocation(line: 52, column: 2, scope: !82)
!192 = !DILocation(line: 52, column: 10, scope: !82)
!193 = !DILocation(line: 54, column: 11, scope: !82)
!194 = !DILocation(line: 54, column: 14, scope: !82)
!195 = !DILocation(line: 54, column: 24, scope: !82)
!196 = !DILocation(line: 54, column: 27, scope: !82)
!197 = !DILocation(line: 54, column: 34, scope: !82)
!198 = !DILocation(line: 54, column: 22, scope: !82)
!199 = !DILocation(line: 54, column: 41, scope: !82)
!200 = !DILocation(line: 54, column: 45, scope: !82)
!201 = !DILocation(line: 54, column: 8, scope: !82)
!202 = !DILocation(line: 55, column: 13, scope: !82)
!203 = !DILocation(line: 55, column: 12, scope: !82)
!204 = !DILocation(line: 55, column: 22, scope: !82)
