; ModuleID = 'anagrams-1.ll'
source_filename = "anagrams-1.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.sHashEntry = type { i8*, %struct.sHashEntry*, %struct.sDictWord*, %struct.sHashEntry*, i16 }
%struct.sDictWord = type { i8*, %struct.sDictWord* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "cxmap", scope: !2, file: !3, line: 38, type: !32, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "anagrams-1.c", directory: "/scratch/yc0769/xstack_benchmark/rosetta/Anagrams-1")
!4 = !{}
!5 = !{!6, !27, !0}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "mostPerms", scope: !2, file: !3, line: 83, type: !8, isLocal: false, isDefinition: true)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "HashEntry", file: !3, line: 70, baseType: !9)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sHashEntry", file: !3, line: 71, size: 320, elements: !11)
!11 = !{!12, !16, !17, !24, !25}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !10, file: !3, line: 72, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !10, file: !3, line: 73, baseType: !8, size: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !10, file: !3, line: 74, baseType: !18, size: 64, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "DictWord", file: !3, line: 64, baseType: !19)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sDictWord", file: !3, line: 65, size: 128, elements: !21)
!21 = !{!22, !23}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !20, file: !3, line: 66, baseType: !13, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !20, file: !3, line: 67, baseType: !18, size: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !10, file: !3, line: 75, baseType: !8, size: 64, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "wordCount", scope: !10, file: !3, line: 76, baseType: !26, size: 16, offset: 256)
!26 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "hashTable", scope: !2, file: !3, line: 81, type: !29, isLocal: false, isDefinition: true)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 524288, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 8192)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 1536, elements: !33)
!33 = !{!34}
!34 = !DISubrange(count: 96)
!35 = !{i32 7, !"Dwarf Version", i32 4}
!36 = !{i32 2, !"Debug Info Version", i32 3}
!37 = !{i32 1, !"wchar_size", i32 4}
!38 = !{!"clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!39 = distinct !DISubprogram(name: "sortedWord", scope: !3, file: !3, line: 7, type: !40, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !13, !42}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!43 = !DILocalVariable(name: "word", arg: 1, scope: !39, file: !3, line: 7, type: !13)
!44 = !DILocation(line: 7, column: 30, scope: !39)
!45 = !DILocalVariable(name: "wbuf", arg: 2, scope: !39, file: !3, line: 7, type: !42)
!46 = !DILocation(line: 7, column: 42, scope: !39)
!47 = !DILocalVariable(name: "p1", scope: !39, file: !3, line: 9, type: !42)
!48 = !DILocation(line: 9, column: 11, scope: !39)
!49 = !DILocalVariable(name: "p2", scope: !39, file: !3, line: 9, type: !42)
!50 = !DILocation(line: 9, column: 16, scope: !39)
!51 = !DILocalVariable(name: "endwrd", scope: !39, file: !3, line: 9, type: !42)
!52 = !DILocation(line: 9, column: 21, scope: !39)
!53 = !DILocalVariable(name: "t", scope: !39, file: !3, line: 10, type: !15)
!54 = !DILocation(line: 10, column: 10, scope: !39)
!55 = !DILocalVariable(name: "swaps", scope: !39, file: !3, line: 11, type: !56)
!56 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!57 = !DILocation(line: 11, column: 9, scope: !39)
!58 = !DILocation(line: 13, column: 12, scope: !39)
!59 = !DILocation(line: 13, column: 18, scope: !39)
!60 = !DILocation(line: 13, column: 5, scope: !39)
!61 = !DILocation(line: 14, column: 14, scope: !39)
!62 = !DILocation(line: 14, column: 26, scope: !39)
!63 = !DILocation(line: 14, column: 19, scope: !39)
!64 = !DILocation(line: 14, column: 18, scope: !39)
!65 = !DILocation(line: 14, column: 12, scope: !39)
!66 = !DILocation(line: 15, column: 5, scope: !39)
!67 = !DILocation(line: 16, column: 14, scope: !68)
!68 = distinct !DILexicalBlock(scope: !39, file: !3, line: 15, column: 8)
!69 = !DILocation(line: 17, column: 13, scope: !68)
!70 = !DILocation(line: 17, column: 11, scope: !68)
!71 = !DILocation(line: 17, column: 24, scope: !68)
!72 = !DILocation(line: 17, column: 30, scope: !68)
!73 = !DILocation(line: 17, column: 22, scope: !68)
!74 = !DILocation(line: 18, column: 8, scope: !68)
!75 = !DILocation(line: 18, column: 15, scope: !68)
!76 = !DILocation(line: 18, column: 18, scope: !68)
!77 = !DILocation(line: 18, column: 17, scope: !68)
!78 = !DILocation(line: 19, column: 16, scope: !79)
!79 = distinct !DILexicalBlock(scope: !80, file: !3, line: 19, column: 15)
!80 = distinct !DILexicalBlock(scope: !68, file: !3, line: 18, column: 22)
!81 = !DILocation(line: 19, column: 15, scope: !79)
!82 = !DILocation(line: 19, column: 22, scope: !79)
!83 = !DILocation(line: 19, column: 21, scope: !79)
!84 = !DILocation(line: 19, column: 19, scope: !79)
!85 = !DILocation(line: 19, column: 15, scope: !80)
!86 = !DILocation(line: 20, column: 19, scope: !87)
!87 = distinct !DILexicalBlock(scope: !79, file: !3, line: 19, column: 26)
!88 = !DILocation(line: 20, column: 18, scope: !87)
!89 = !DILocation(line: 20, column: 16, scope: !87)
!90 = !DILocation(line: 20, column: 30, scope: !87)
!91 = !DILocation(line: 20, column: 29, scope: !87)
!92 = !DILocation(line: 20, column: 24, scope: !87)
!93 = !DILocation(line: 20, column: 27, scope: !87)
!94 = !DILocation(line: 20, column: 40, scope: !87)
!95 = !DILocation(line: 20, column: 35, scope: !87)
!96 = !DILocation(line: 20, column: 38, scope: !87)
!97 = !DILocation(line: 21, column: 20, scope: !87)
!98 = !DILocation(line: 22, column: 11, scope: !87)
!99 = !DILocation(line: 23, column: 13, scope: !80)
!100 = !DILocation(line: 23, column: 19, scope: !80)
!101 = distinct !{!101, !74, !102}
!102 = !DILocation(line: 24, column: 8, scope: !68)
!103 = !DILocation(line: 25, column: 13, scope: !68)
!104 = !DILocation(line: 25, column: 11, scope: !68)
!105 = !DILocation(line: 25, column: 24, scope: !68)
!106 = !DILocation(line: 25, column: 26, scope: !68)
!107 = !DILocation(line: 25, column: 22, scope: !68)
!108 = !DILocation(line: 26, column: 8, scope: !68)
!109 = !DILocation(line: 26, column: 14, scope: !68)
!110 = !DILocation(line: 26, column: 19, scope: !68)
!111 = !DILocation(line: 26, column: 17, scope: !68)
!112 = !DILocation(line: 27, column: 17, scope: !113)
!113 = distinct !DILexicalBlock(scope: !114, file: !3, line: 27, column: 16)
!114 = distinct !DILexicalBlock(scope: !68, file: !3, line: 26, column: 27)
!115 = !DILocation(line: 27, column: 16, scope: !113)
!116 = !DILocation(line: 27, column: 23, scope: !113)
!117 = !DILocation(line: 27, column: 22, scope: !113)
!118 = !DILocation(line: 27, column: 20, scope: !113)
!119 = !DILocation(line: 27, column: 16, scope: !114)
!120 = !DILocation(line: 28, column: 19, scope: !121)
!121 = distinct !DILexicalBlock(scope: !113, file: !3, line: 27, column: 27)
!122 = !DILocation(line: 28, column: 18, scope: !121)
!123 = !DILocation(line: 28, column: 16, scope: !121)
!124 = !DILocation(line: 28, column: 30, scope: !121)
!125 = !DILocation(line: 28, column: 29, scope: !121)
!126 = !DILocation(line: 28, column: 24, scope: !121)
!127 = !DILocation(line: 28, column: 27, scope: !121)
!128 = !DILocation(line: 28, column: 40, scope: !121)
!129 = !DILocation(line: 28, column: 35, scope: !121)
!130 = !DILocation(line: 28, column: 38, scope: !121)
!131 = !DILocation(line: 29, column: 20, scope: !121)
!132 = !DILocation(line: 30, column: 12, scope: !121)
!133 = !DILocation(line: 31, column: 14, scope: !114)
!134 = !DILocation(line: 31, column: 20, scope: !114)
!135 = distinct !{!135, !108, !136}
!136 = !DILocation(line: 32, column: 8, scope: !68)
!137 = !DILocation(line: 33, column: 5, scope: !68)
!138 = !DILocation(line: 33, column: 14, scope: !39)
!139 = distinct !{!139, !66, !140}
!140 = !DILocation(line: 33, column: 19, scope: !39)
!141 = !DILocation(line: 34, column: 12, scope: !39)
!142 = !DILocation(line: 34, column: 5, scope: !39)
!143 = distinct !DISubprogram(name: "Str_Hash", scope: !3, file: !3, line: 51, type: !144, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!144 = !DISubroutineType(types: !145)
!145 = !{!56, !13, !56}
!146 = !DILocalVariable(name: "key", arg: 1, scope: !143, file: !3, line: 51, type: !13)
!147 = !DILocation(line: 51, column: 27, scope: !143)
!148 = !DILocalVariable(name: "ix_max", arg: 2, scope: !143, file: !3, line: 51, type: !56)
!149 = !DILocation(line: 51, column: 36, scope: !143)
!150 = !DILocalVariable(name: "cp", scope: !143, file: !3, line: 53, type: !13)
!151 = !DILocation(line: 53, column: 16, scope: !143)
!152 = !DILocalVariable(name: "mash", scope: !143, file: !3, line: 54, type: !26)
!153 = !DILocation(line: 54, column: 10, scope: !143)
!154 = !DILocalVariable(name: "hash", scope: !143, file: !3, line: 55, type: !56)
!155 = !DILocation(line: 55, column: 9, scope: !143)
!156 = !DILocation(line: 56, column: 14, scope: !157)
!157 = distinct !DILexicalBlock(scope: !143, file: !3, line: 56, column: 4)
!158 = !DILocation(line: 56, column: 12, scope: !157)
!159 = !DILocation(line: 56, column: 9, scope: !157)
!160 = !DILocation(line: 56, column: 20, scope: !161)
!161 = distinct !DILexicalBlock(scope: !157, file: !3, line: 56, column: 4)
!162 = !DILocation(line: 56, column: 19, scope: !161)
!163 = !DILocation(line: 56, column: 4, scope: !157)
!164 = !DILocation(line: 57, column: 21, scope: !165)
!165 = distinct !DILexicalBlock(scope: !161, file: !3, line: 56, column: 30)
!166 = !DILocation(line: 57, column: 20, scope: !165)
!167 = !DILocation(line: 57, column: 24, scope: !165)
!168 = !DILocation(line: 57, column: 14, scope: !165)
!169 = !DILocation(line: 57, column: 12, scope: !165)
!170 = !DILocation(line: 58, column: 15, scope: !165)
!171 = !DILocation(line: 58, column: 20, scope: !165)
!172 = !DILocation(line: 58, column: 25, scope: !165)
!173 = !DILocation(line: 58, column: 41, scope: !165)
!174 = !DILocation(line: 58, column: 45, scope: !165)
!175 = !DILocation(line: 58, column: 53, scope: !165)
!176 = !DILocation(line: 58, column: 57, scope: !165)
!177 = !DILocation(line: 58, column: 50, scope: !165)
!178 = !DILocation(line: 58, column: 37, scope: !165)
!179 = !DILocation(line: 58, column: 12, scope: !165)
!180 = !DILocation(line: 59, column: 12, scope: !165)
!181 = !DILocation(line: 60, column: 7, scope: !165)
!182 = !DILocation(line: 56, column: 26, scope: !161)
!183 = !DILocation(line: 56, column: 4, scope: !161)
!184 = distinct !{!184, !163, !185}
!185 = !DILocation(line: 60, column: 7, scope: !157)
!186 = !DILocation(line: 61, column: 12, scope: !143)
!187 = !DILocation(line: 61, column: 19, scope: !143)
!188 = !DILocation(line: 61, column: 17, scope: !143)
!189 = !DILocation(line: 61, column: 4, scope: !143)
!190 = distinct !DISubprogram(name: "buildAnagrams", scope: !3, file: !3, line: 85, type: !191, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!191 = !DISubroutineType(types: !192)
!192 = !{!56, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !195, line: 7, baseType: !196)
!195 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !197, line: 49, size: 1728, elements: !198)
!197 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!198 = !{!199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !214, !216, !217, !218, !222, !224, !226, !230, !233, !235, !238, !241, !242, !244, !248, !249}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !196, file: !197, line: 51, baseType: !56, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !196, file: !197, line: 54, baseType: !42, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !196, file: !197, line: 55, baseType: !42, size: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !196, file: !197, line: 56, baseType: !42, size: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !196, file: !197, line: 57, baseType: !42, size: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !196, file: !197, line: 58, baseType: !42, size: 64, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !196, file: !197, line: 59, baseType: !42, size: 64, offset: 384)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !196, file: !197, line: 60, baseType: !42, size: 64, offset: 448)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !196, file: !197, line: 61, baseType: !42, size: 64, offset: 512)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !196, file: !197, line: 64, baseType: !42, size: 64, offset: 576)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !196, file: !197, line: 65, baseType: !42, size: 64, offset: 640)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !196, file: !197, line: 66, baseType: !42, size: 64, offset: 704)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !196, file: !197, line: 68, baseType: !212, size: 64, offset: 768)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !197, line: 36, flags: DIFlagFwdDecl)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !196, file: !197, line: 70, baseType: !215, size: 64, offset: 832)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !196, file: !197, line: 72, baseType: !56, size: 32, offset: 896)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !196, file: !197, line: 73, baseType: !56, size: 32, offset: 928)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !196, file: !197, line: 74, baseType: !219, size: 64, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !220, line: 152, baseType: !221)
!220 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!221 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !196, file: !197, line: 77, baseType: !223, size: 16, offset: 1024)
!223 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !196, file: !197, line: 78, baseType: !225, size: 8, offset: 1040)
!225 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !196, file: !197, line: 79, baseType: !227, size: 8, offset: 1048)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 1)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !196, file: !197, line: 81, baseType: !231, size: 64, offset: 1088)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !197, line: 43, baseType: null)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !196, file: !197, line: 89, baseType: !234, size: 64, offset: 1152)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !220, line: 153, baseType: !221)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !196, file: !197, line: 91, baseType: !236, size: 64, offset: 1216)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !197, line: 37, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !196, file: !197, line: 92, baseType: !239, size: 64, offset: 1280)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !197, line: 38, flags: DIFlagFwdDecl)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !196, file: !197, line: 93, baseType: !215, size: 64, offset: 1344)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !196, file: !197, line: 94, baseType: !243, size: 64, offset: 1408)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !196, file: !197, line: 95, baseType: !245, size: 64, offset: 1472)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !246, line: 46, baseType: !247)
!246 = !DIFile(filename: "/u/NAS_SCRATCH/yc0769/xstack/xstack-installs/llvm-install-debug/lib/clang/10.0.1/include/stddef.h", directory: "")
!247 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !196, file: !197, line: 96, baseType: !56, size: 32, offset: 1536)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !196, file: !197, line: 98, baseType: !250, size: 160, offset: 1568)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 160, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 20)
!253 = !DILocalVariable(name: "fin", arg: 1, scope: !190, file: !3, line: 85, type: !193)
!254 = !DILocation(line: 85, column: 26, scope: !190)
!255 = !DILocalVariable(name: "buffer", scope: !190, file: !3, line: 87, type: !256)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 320, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 40)
!259 = !DILocation(line: 87, column: 10, scope: !190)
!260 = !DILocalVariable(name: "bufr2", scope: !190, file: !3, line: 88, type: !256)
!261 = !DILocation(line: 88, column: 10, scope: !190)
!262 = !DILocalVariable(name: "hkey", scope: !190, file: !3, line: 89, type: !42)
!263 = !DILocation(line: 89, column: 11, scope: !190)
!264 = !DILocalVariable(name: "hix", scope: !190, file: !3, line: 90, type: !56)
!265 = !DILocation(line: 90, column: 9, scope: !190)
!266 = !DILocalVariable(name: "he", scope: !190, file: !3, line: 91, type: !8)
!267 = !DILocation(line: 91, column: 15, scope: !190)
!268 = !DILocalVariable(name: "hep", scope: !190, file: !3, line: 91, type: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!270 = !DILocation(line: 91, column: 20, scope: !190)
!271 = !DILocalVariable(name: "we", scope: !190, file: !3, line: 92, type: !18)
!272 = !DILocation(line: 92, column: 15, scope: !190)
!273 = !DILocalVariable(name: "maxPC", scope: !190, file: !3, line: 93, type: !56)
!274 = !DILocation(line: 93, column: 10, scope: !190)
!275 = !DILocalVariable(name: "numWords", scope: !190, file: !3, line: 94, type: !56)
!276 = !DILocation(line: 94, column: 9, scope: !190)
!277 = !DILocation(line: 96, column: 5, scope: !190)
!278 = !DILocation(line: 96, column: 19, scope: !190)
!279 = !DILocation(line: 96, column: 31, scope: !190)
!280 = !DILocation(line: 96, column: 13, scope: !190)
!281 = !DILocation(line: 97, column: 20, scope: !282)
!282 = distinct !DILexicalBlock(scope: !283, file: !3, line: 97, column: 9)
!283 = distinct !DILexicalBlock(scope: !190, file: !3, line: 96, column: 37)
!284 = !DILocation(line: 97, column: 18, scope: !282)
!285 = !DILocation(line: 97, column: 13, scope: !282)
!286 = !DILocation(line: 97, column: 29, scope: !287)
!287 = distinct !DILexicalBlock(scope: !282, file: !3, line: 97, column: 9)
!288 = !DILocation(line: 97, column: 28, scope: !287)
!289 = !DILocation(line: 97, column: 34, scope: !287)
!290 = !DILocation(line: 97, column: 39, scope: !287)
!291 = !DILocation(line: 97, column: 38, scope: !287)
!292 = !DILocation(line: 97, column: 43, scope: !287)
!293 = !DILocation(line: 0, scope: !287)
!294 = !DILocation(line: 97, column: 9, scope: !282)
!295 = !DILocation(line: 97, column: 56, scope: !287)
!296 = !DILocation(line: 97, column: 9, scope: !287)
!297 = distinct !{!297, !294, !298}
!298 = !DILocation(line: 97, column: 59, scope: !282)
!299 = !DILocation(line: 98, column: 10, scope: !283)
!300 = !DILocation(line: 98, column: 15, scope: !283)
!301 = !DILocation(line: 99, column: 27, scope: !283)
!302 = !DILocation(line: 99, column: 35, scope: !283)
!303 = !DILocation(line: 99, column: 16, scope: !283)
!304 = !DILocation(line: 99, column: 14, scope: !283)
!305 = !DILocation(line: 100, column: 24, scope: !283)
!306 = !DILocation(line: 100, column: 15, scope: !283)
!307 = !DILocation(line: 100, column: 13, scope: !283)
!308 = !DILocation(line: 101, column: 24, scope: !283)
!309 = !DILocation(line: 101, column: 14, scope: !283)
!310 = !DILocation(line: 101, column: 12, scope: !283)
!311 = !DILocation(line: 101, column: 47, scope: !283)
!312 = !DILocation(line: 101, column: 37, scope: !283)
!313 = !DILocation(line: 101, column: 34, scope: !283)
!314 = !DILocation(line: 102, column: 9, scope: !283)
!315 = !DILocation(line: 102, column: 16, scope: !283)
