; ModuleID = 'execute-a-markov-algorithm-1.c'
source_filename = "execute-a-markov-algorithm-1.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ruleset_t = type { i32, %struct.rule_t*, i8* }
%struct.rule_t = type { i8*, i8*, i32 }
%struct.string = type { i8*, i64 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"->\00", align 1
@.str.2 = private unnamed_addr constant [28 x i8] c"parse error: no -> in %.*s\0A\00", align 1
@.str.3 = private unnamed_addr constant [23 x i8] c"left side blank? %.*s\0A\00", align 1
@.str.4 = private unnamed_addr constant [20 x i8] c"Rules from '%s' ok\0A\00", align 1
@.str.5 = private unnamed_addr constant [14 x i8] c"text:     %s\0A\00", align 1
@.str.6 = private unnamed_addr constant [14 x i8] c"markoved: %s\0A\00", align 1
@.str.7 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1
@.str.8 = private unnamed_addr constant [29 x i8] c"I bought a B of As from T S.\00", align 1
@.str.9 = private unnamed_addr constant [6 x i8] c"rule1\00", align 1
@.str.10 = private unnamed_addr constant [6 x i8] c"rule2\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git 078de928eea94413164fbdff5fab7bdcf0f60aa7)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !19, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "execute-a-markov-algorithm-1.c", directory: "/scratch/yc0769/xstack_benchmark/rosetta/Execute-a-Markov-algorithm")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 46, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!8 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!9 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!18 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!19 = !{!20, !21}
!20 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!21 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!22 = !{i32 7, !"Dwarf Version", i32 4}
!23 = !{i32 2, !"Debug Info Version", i32 3}
!24 = !{i32 1, !"wchar_size", i32 4}
!25 = !{!"clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git 078de928eea94413164fbdff5fab7bdcf0f60aa7)"}
!26 = distinct !DISubprogram(name: "ruleset_del", scope: !1, file: !1, line: 23, type: !27, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !45)
!27 = !DISubroutineType(types: !28)
!28 = !{null, !29}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "ruleset_t", file: !1, line: 21, baseType: !31)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 17, size: 192, elements: !32)
!32 = !{!33, !34, !44}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !31, file: !1, line: 18, baseType: !20, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "rules", scope: !31, file: !1, line: 19, baseType: !35, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "rule_t", file: !1, line: 15, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 12, size: 192, elements: !38)
!38 = !{!39, !42, !43}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "pat", scope: !37, file: !1, line: 13, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "repl", scope: !37, file: !1, line: 13, baseType: !40, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "terminate", scope: !37, file: !1, line: 14, baseType: !20, size: 32, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !31, file: !1, line: 20, baseType: !40, size: 64, offset: 128)
!45 = !{}
!46 = !DILocalVariable(name: "r", arg: 1, scope: !26, file: !1, line: 23, type: !29)
!47 = !DILocation(line: 23, column: 29, scope: !26)
!48 = !DILocation(line: 25, column: 6, scope: !49)
!49 = distinct !DILexicalBlock(scope: !26, file: !1, line: 25, column: 6)
!50 = !DILocation(line: 25, column: 9, scope: !49)
!51 = !DILocation(line: 25, column: 6, scope: !26)
!52 = !{!"if"}
!53 = !DILocation(line: 25, column: 21, scope: !49)
!54 = !DILocation(line: 25, column: 24, scope: !49)
!55 = !DILocation(line: 25, column: 16, scope: !49)
!56 = !DILocation(line: 26, column: 6, scope: !57)
!57 = distinct !DILexicalBlock(scope: !26, file: !1, line: 26, column: 6)
!58 = !DILocation(line: 26, column: 9, scope: !57)
!59 = !DILocation(line: 26, column: 6, scope: !26)
!60 = !DILocation(line: 26, column: 19, scope: !57)
!61 = !DILocation(line: 26, column: 22, scope: !57)
!62 = !DILocation(line: 26, column: 14, scope: !57)
!63 = !DILocation(line: 27, column: 7, scope: !26)
!64 = !DILocation(line: 27, column: 2, scope: !26)
!65 = !DILocation(line: 28, column: 1, scope: !26)
!66 = distinct !DISubprogram(name: "str_new", scope: !1, file: !1, line: 30, type: !67, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !45)
!67 = !DISubroutineType(types: !68)
!68 = !{!69, !78}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "string", file: !1, line: 10, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 10, size: 128, elements: !72)
!72 = !{!73, !74}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !71, file: !1, line: 10, baseType: !40, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_len", scope: !71, file: !1, line: 10, baseType: !75, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !76, line: 46, baseType: !77)
!76 = !DIFile(filename: "/u/NAS_SCRATCH/yc0769/xstack/llvm-install/lib/clang/10.0.1/include/stddef.h", directory: "")
!77 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!80 = !DILocalVariable(name: "s", arg: 1, scope: !66, file: !1, line: 30, type: !78)
!81 = !DILocation(line: 30, column: 30, scope: !66)
!82 = !DILocalVariable(name: "l", scope: !66, file: !1, line: 32, type: !20)
!83 = !DILocation(line: 32, column: 6, scope: !66)
!84 = !DILocation(line: 32, column: 17, scope: !66)
!85 = !DILocation(line: 32, column: 10, scope: !66)
!86 = !DILocalVariable(name: "str", scope: !66, file: !1, line: 33, type: !69)
!87 = !DILocation(line: 33, column: 10, scope: !66)
!88 = !DILocation(line: 33, column: 16, scope: !66)
!89 = !DILocation(line: 34, column: 18, scope: !66)
!90 = !DILocation(line: 34, column: 20, scope: !66)
!91 = !DILocation(line: 34, column: 11, scope: !66)
!92 = !DILocation(line: 34, column: 2, scope: !66)
!93 = !DILocation(line: 34, column: 7, scope: !66)
!94 = !DILocation(line: 34, column: 9, scope: !66)
!95 = !DILocation(line: 35, column: 9, scope: !66)
!96 = !DILocation(line: 35, column: 14, scope: !66)
!97 = !DILocation(line: 35, column: 17, scope: !66)
!98 = !DILocation(line: 35, column: 2, scope: !66)
!99 = !DILocation(line: 36, column: 19, scope: !66)
!100 = !DILocation(line: 36, column: 21, scope: !66)
!101 = !DILocation(line: 36, column: 2, scope: !66)
!102 = !DILocation(line: 36, column: 7, scope: !66)
!103 = !DILocation(line: 36, column: 17, scope: !66)
!104 = !DILocation(line: 37, column: 9, scope: !66)
!105 = !DILocation(line: 37, column: 2, scope: !66)
!106 = distinct !DISubprogram(name: "str_append", scope: !1, file: !1, line: 40, type: !107, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !45)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !69, !78, !20}
!109 = !DILocalVariable(name: "str", arg: 1, scope: !106, file: !1, line: 40, type: !69)
!110 = !DILocation(line: 40, column: 25, scope: !106)
!111 = !DILocalVariable(name: "s", arg: 2, scope: !106, file: !1, line: 40, type: !78)
!112 = !DILocation(line: 40, column: 42, scope: !106)
!113 = !DILocalVariable(name: "len", arg: 3, scope: !106, file: !1, line: 40, type: !20)
!114 = !DILocation(line: 40, column: 49, scope: !106)
!115 = !DILocalVariable(name: "l", scope: !106, file: !1, line: 42, type: !20)
!116 = !DILocation(line: 42, column: 6, scope: !106)
!117 = !DILocation(line: 42, column: 17, scope: !106)
!118 = !DILocation(line: 42, column: 22, scope: !106)
!119 = !DILocation(line: 42, column: 10, scope: !106)
!120 = !DILocation(line: 43, column: 6, scope: !121)
!121 = distinct !DILexicalBlock(scope: !106, file: !1, line: 43, column: 6)
!122 = !DILocation(line: 43, column: 10, scope: !121)
!123 = !DILocation(line: 43, column: 6, scope: !106)
!124 = !DILocation(line: 43, column: 30, scope: !121)
!125 = !DILocation(line: 43, column: 23, scope: !121)
!126 = !DILocation(line: 43, column: 21, scope: !121)
!127 = !DILocation(line: 43, column: 17, scope: !121)
!128 = !DILocation(line: 45, column: 6, scope: !129)
!129 = distinct !DILexicalBlock(scope: !106, file: !1, line: 45, column: 6)
!130 = !DILocation(line: 45, column: 11, scope: !129)
!131 = !DILocation(line: 45, column: 23, scope: !129)
!132 = !DILocation(line: 45, column: 27, scope: !129)
!133 = !DILocation(line: 45, column: 25, scope: !129)
!134 = !DILocation(line: 45, column: 31, scope: !129)
!135 = !DILocation(line: 45, column: 21, scope: !129)
!136 = !DILocation(line: 45, column: 6, scope: !106)
!137 = !DILocation(line: 46, column: 20, scope: !138)
!138 = distinct !DILexicalBlock(scope: !129, file: !1, line: 45, column: 36)
!139 = !DILocation(line: 46, column: 24, scope: !138)
!140 = !DILocation(line: 46, column: 22, scope: !138)
!141 = !DILocation(line: 46, column: 28, scope: !138)
!142 = !DILocation(line: 46, column: 3, scope: !138)
!143 = !DILocation(line: 46, column: 8, scope: !138)
!144 = !DILocation(line: 46, column: 18, scope: !138)
!145 = !DILocation(line: 47, column: 20, scope: !138)
!146 = !DILocation(line: 47, column: 25, scope: !138)
!147 = !DILocation(line: 47, column: 28, scope: !138)
!148 = !DILocation(line: 47, column: 33, scope: !138)
!149 = !DILocation(line: 47, column: 12, scope: !138)
!150 = !DILocation(line: 47, column: 3, scope: !138)
!151 = !DILocation(line: 47, column: 8, scope: !138)
!152 = !DILocation(line: 47, column: 10, scope: !138)
!153 = !DILocation(line: 48, column: 2, scope: !138)
!154 = !DILocation(line: 49, column: 9, scope: !106)
!155 = !DILocation(line: 49, column: 14, scope: !106)
!156 = !DILocation(line: 49, column: 18, scope: !106)
!157 = !DILocation(line: 49, column: 16, scope: !106)
!158 = !DILocation(line: 49, column: 21, scope: !106)
!159 = !DILocation(line: 49, column: 24, scope: !106)
!160 = !DILocation(line: 49, column: 2, scope: !106)
!161 = !DILocation(line: 50, column: 2, scope: !106)
!162 = !DILocation(line: 50, column: 7, scope: !106)
!163 = !DILocation(line: 50, column: 9, scope: !106)
!164 = !DILocation(line: 50, column: 13, scope: !106)
!165 = !DILocation(line: 50, column: 11, scope: !106)
!166 = !DILocation(line: 50, column: 18, scope: !106)
!167 = !DILocation(line: 51, column: 1, scope: !106)
!168 = distinct !DISubprogram(name: "str_transfer", scope: !1, file: !1, line: 54, type: !169, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !45)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !69, !69}
!171 = !DILocalVariable(name: "dest", arg: 1, scope: !168, file: !1, line: 54, type: !69)
!172 = !DILocation(line: 54, column: 27, scope: !168)
!173 = !DILocalVariable(name: "src", arg: 2, scope: !168, file: !1, line: 54, type: !69)
!174 = !DILocation(line: 54, column: 41, scope: !168)
!175 = !DILocalVariable(name: "tlen", scope: !168, file: !1, line: 56, type: !75)
!176 = !DILocation(line: 56, column: 9, scope: !168)
!177 = !DILocation(line: 56, column: 16, scope: !168)
!178 = !DILocation(line: 56, column: 22, scope: !168)
!179 = !DILocation(line: 57, column: 20, scope: !168)
!180 = !DILocation(line: 57, column: 25, scope: !168)
!181 = !DILocation(line: 57, column: 2, scope: !168)
!182 = !DILocation(line: 57, column: 8, scope: !168)
!183 = !DILocation(line: 57, column: 18, scope: !168)
!184 = !DILocation(line: 58, column: 19, scope: !168)
!185 = !DILocation(line: 58, column: 2, scope: !168)
!186 = !DILocation(line: 58, column: 7, scope: !168)
!187 = !DILocation(line: 58, column: 17, scope: !168)
!188 = !DILocalVariable(name: "ts", scope: !168, file: !1, line: 60, type: !40)
!189 = !DILocation(line: 60, column: 8, scope: !168)
!190 = !DILocation(line: 60, column: 13, scope: !168)
!191 = !DILocation(line: 60, column: 19, scope: !168)
!192 = !DILocation(line: 61, column: 12, scope: !168)
!193 = !DILocation(line: 61, column: 17, scope: !168)
!194 = !DILocation(line: 61, column: 2, scope: !168)
!195 = !DILocation(line: 61, column: 8, scope: !168)
!196 = !DILocation(line: 61, column: 10, scope: !168)
!197 = !DILocation(line: 62, column: 11, scope: !168)
!198 = !DILocation(line: 62, column: 2, scope: !168)
!199 = !DILocation(line: 62, column: 7, scope: !168)
!200 = !DILocation(line: 62, column: 9, scope: !168)
!201 = !DILocation(line: 63, column: 2, scope: !168)
!202 = !DILocation(line: 63, column: 7, scope: !168)
!203 = !DILocation(line: 63, column: 12, scope: !168)
!204 = !DILocation(line: 64, column: 1, scope: !168)
!205 = distinct !DISubprogram(name: "str_del", scope: !1, file: !1, line: 66, type: !206, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !45)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !69}
!208 = !DILocalVariable(name: "s", arg: 1, scope: !205, file: !1, line: 66, type: !69)
!209 = !DILocation(line: 66, column: 22, scope: !205)
!210 = !DILocation(line: 68, column: 6, scope: !211)
!211 = distinct !DILexicalBlock(scope: !205, file: !1, line: 68, column: 6)
!212 = !DILocation(line: 68, column: 9, scope: !211)
!213 = !DILocation(line: 68, column: 6, scope: !205)
!214 = !DILocation(line: 68, column: 17, scope: !211)
!215 = !DILocation(line: 68, column: 20, scope: !211)
!216 = !DILocation(line: 68, column: 12, scope: !211)
!217 = !DILocation(line: 69, column: 7, scope: !205)
!218 = !DILocation(line: 69, column: 2, scope: !205)
!219 = !DILocation(line: 70, column: 1, scope: !205)
!220 = distinct !DISubprogram(name: "str_markov", scope: !1, file: !1, line: 72, type: !221, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !45)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !69, !29}
!223 = !DILocalVariable(name: "str", arg: 1, scope: !220, file: !1, line: 72, type: !69)
!224 = !DILocation(line: 72, column: 25, scope: !220)
!225 = !DILocalVariable(name: "r", arg: 2, scope: !220, file: !1, line: 72, type: !29)
!226 = !DILocation(line: 72, column: 41, scope: !220)
!227 = !DILocalVariable(name: "i", scope: !220, file: !1, line: 74, type: !20)
!228 = !DILocation(line: 74, column: 6, scope: !220)
!229 = !DILocalVariable(name: "j", scope: !220, file: !1, line: 74, type: !20)
!230 = !DILocation(line: 74, column: 9, scope: !220)
!231 = !DILocalVariable(name: "sl", scope: !220, file: !1, line: 74, type: !20)
!232 = !DILocation(line: 74, column: 12, scope: !220)
!233 = !DILocalVariable(name: "pl", scope: !220, file: !1, line: 74, type: !20)
!234 = !DILocation(line: 74, column: 16, scope: !220)
!235 = !DILocalVariable(name: "changed", scope: !220, file: !1, line: 75, type: !20)
!236 = !DILocation(line: 75, column: 6, scope: !220)
!237 = !DILocalVariable(name: "done", scope: !220, file: !1, line: 75, type: !20)
!238 = !DILocation(line: 75, column: 19, scope: !220)
!239 = !DILocalVariable(name: "tmp", scope: !220, file: !1, line: 76, type: !69)
!240 = !DILocation(line: 76, column: 10, scope: !220)
!241 = !DILocation(line: 76, column: 16, scope: !220)
!242 = !DILocation(line: 78, column: 2, scope: !220)
!243 = !DILocation(line: 78, column: 10, scope: !220)
!244 = !DILocation(line: 78, column: 9, scope: !220)
!245 = !DILocation(line: 79, column: 11, scope: !246)
!246 = distinct !DILexicalBlock(scope: !220, file: !1, line: 78, column: 16)
!247 = !DILocation(line: 80, column: 10, scope: !248)
!248 = distinct !DILexicalBlock(scope: !246, file: !1, line: 80, column: 3)
!249 = !DILocation(line: 80, column: 8, scope: !248)
!250 = !DILocation(line: 80, column: 16, scope: !251)
!251 = distinct !DILexicalBlock(scope: !248, file: !1, line: 80, column: 3)
!252 = !DILocation(line: 80, column: 21, scope: !251)
!253 = !DILocation(line: 80, column: 25, scope: !251)
!254 = !DILocation(line: 80, column: 33, scope: !251)
!255 = !DILocation(line: 80, column: 36, scope: !251)
!256 = !DILocation(line: 80, column: 40, scope: !251)
!257 = !DILocation(line: 80, column: 43, scope: !251)
!258 = !DILocation(line: 80, column: 38, scope: !251)
!259 = !DILocation(line: 0, scope: !251)
!260 = !DILocation(line: 80, column: 3, scope: !248)
!261 = !DILocation(line: 81, column: 16, scope: !262)
!262 = distinct !DILexicalBlock(scope: !251, file: !1, line: 80, column: 51)
!263 = !DILocation(line: 81, column: 19, scope: !262)
!264 = !DILocation(line: 81, column: 25, scope: !262)
!265 = !DILocation(line: 81, column: 28, scope: !262)
!266 = !DILocation(line: 81, column: 9, scope: !262)
!267 = !DILocation(line: 81, column: 7, scope: !262)
!268 = !DILocation(line: 82, column: 16, scope: !262)
!269 = !DILocation(line: 82, column: 21, scope: !262)
!270 = !DILocation(line: 82, column: 9, scope: !262)
!271 = !DILocation(line: 82, column: 7, scope: !262)
!272 = !DILocation(line: 83, column: 11, scope: !273)
!273 = distinct !DILexicalBlock(scope: !262, file: !1, line: 83, column: 4)
!274 = !DILocation(line: 83, column: 9, scope: !273)
!275 = !DILocation(line: 83, column: 16, scope: !276)
!276 = distinct !DILexicalBlock(scope: !273, file: !1, line: 83, column: 4)
!277 = !DILocation(line: 83, column: 20, scope: !276)
!278 = !DILocation(line: 83, column: 18, scope: !276)
!279 = !DILocation(line: 83, column: 4, scope: !273)
!280 = !DILocation(line: 84, column: 17, scope: !281)
!281 = distinct !DILexicalBlock(scope: !282, file: !1, line: 84, column: 9)
!282 = distinct !DILexicalBlock(scope: !276, file: !1, line: 83, column: 29)
!283 = !DILocation(line: 84, column: 22, scope: !281)
!284 = !DILocation(line: 84, column: 26, scope: !281)
!285 = !DILocation(line: 84, column: 24, scope: !281)
!286 = !DILocation(line: 84, column: 29, scope: !281)
!287 = !DILocation(line: 84, column: 32, scope: !281)
!288 = !DILocation(line: 84, column: 38, scope: !281)
!289 = !DILocation(line: 84, column: 41, scope: !281)
!290 = !DILocation(line: 84, column: 46, scope: !281)
!291 = !DILocation(line: 84, column: 9, scope: !281)
!292 = !DILocation(line: 84, column: 9, scope: !282)
!293 = !DILocation(line: 85, column: 6, scope: !281)
!294 = !DILocation(line: 86, column: 16, scope: !282)
!295 = !DILocation(line: 86, column: 21, scope: !282)
!296 = !DILocation(line: 86, column: 26, scope: !282)
!297 = !DILocation(line: 86, column: 29, scope: !282)
!298 = !DILocation(line: 86, column: 5, scope: !282)
!299 = !DILocation(line: 87, column: 16, scope: !282)
!300 = !DILocation(line: 87, column: 21, scope: !282)
!301 = !DILocation(line: 87, column: 24, scope: !282)
!302 = !DILocation(line: 87, column: 30, scope: !282)
!303 = !DILocation(line: 87, column: 33, scope: !282)
!304 = !DILocation(line: 87, column: 5, scope: !282)
!305 = !DILocation(line: 88, column: 16, scope: !282)
!306 = !DILocation(line: 88, column: 21, scope: !282)
!307 = !DILocation(line: 88, column: 26, scope: !282)
!308 = !DILocation(line: 88, column: 30, scope: !282)
!309 = !DILocation(line: 88, column: 28, scope: !282)
!310 = !DILocation(line: 88, column: 34, scope: !282)
!311 = !DILocation(line: 88, column: 32, scope: !282)
!312 = !DILocation(line: 88, column: 5, scope: !282)
!313 = !DILocation(line: 90, column: 18, scope: !282)
!314 = !DILocation(line: 90, column: 23, scope: !282)
!315 = !DILocation(line: 90, column: 5, scope: !282)
!316 = !DILocation(line: 91, column: 13, scope: !282)
!317 = !DILocation(line: 93, column: 9, scope: !318)
!318 = distinct !DILexicalBlock(scope: !282, file: !1, line: 93, column: 9)
!319 = !DILocation(line: 93, column: 12, scope: !318)
!320 = !DILocation(line: 93, column: 18, scope: !318)
!321 = !DILocation(line: 93, column: 21, scope: !318)
!322 = !DILocation(line: 93, column: 9, scope: !282)
!323 = !DILocation(line: 94, column: 11, scope: !318)
!324 = !DILocation(line: 94, column: 6, scope: !318)
!325 = !DILocation(line: 95, column: 5, scope: !282)
!326 = !DILocation(line: 83, column: 25, scope: !276)
!327 = !DILocation(line: 83, column: 4, scope: !276)
!328 = distinct !{!328, !279, !329}
!329 = !DILocation(line: 96, column: 4, scope: !273)
!330 = !DILocation(line: 97, column: 3, scope: !262)
!331 = !DILocation(line: 80, column: 47, scope: !251)
!332 = !DILocation(line: 80, column: 3, scope: !251)
!333 = distinct !{!333, !260, !334}
!334 = !DILocation(line: 97, column: 3, scope: !248)
!335 = !DILocation(line: 98, column: 8, scope: !336)
!336 = distinct !DILexicalBlock(scope: !246, file: !1, line: 98, column: 7)
!337 = !DILocation(line: 98, column: 7, scope: !246)
!338 = !DILocation(line: 98, column: 17, scope: !336)
!339 = distinct !{!339, !242, !340}
!340 = !DILocation(line: 99, column: 2, scope: !220)
!341 = !DILocation(line: 100, column: 10, scope: !220)
!342 = !DILocation(line: 100, column: 2, scope: !220)
!343 = !DILocation(line: 101, column: 2, scope: !220)
!344 = distinct !DISubprogram(name: "read_rules", scope: !1, file: !1, line: 104, type: !345, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !45)
!345 = !DISubroutineType(types: !346)
!346 = !{!29, !78}
!347 = !DILocalVariable(name: "name", arg: 1, scope: !344, file: !1, line: 104, type: !78)
!348 = !DILocation(line: 104, column: 35, scope: !344)
!349 = !DILocalVariable(name: "s", scope: !344, file: !1, line: 106, type: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !351, line: 46, size: 1152, elements: !352)
!351 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!352 = !{!353, !356, !358, !360, !362, !364, !366, !367, !368, !371, !373, !375, !383, !384, !385}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !350, file: !351, line: 48, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !355, line: 145, baseType: !77)
!355 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!356 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !350, file: !351, line: 53, baseType: !357, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !355, line: 148, baseType: !77)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !350, file: !351, line: 61, baseType: !359, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !355, line: 151, baseType: !77)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !350, file: !351, line: 62, baseType: !361, size: 32, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !355, line: 150, baseType: !5)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !350, file: !351, line: 64, baseType: !363, size: 32, offset: 224)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !355, line: 146, baseType: !5)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !350, file: !351, line: 65, baseType: !365, size: 32, offset: 256)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !355, line: 147, baseType: !5)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !350, file: !351, line: 67, baseType: !20, size: 32, offset: 288)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !350, file: !351, line: 69, baseType: !354, size: 64, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !350, file: !351, line: 74, baseType: !369, size: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !355, line: 152, baseType: !370)
!370 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !350, file: !351, line: 78, baseType: !372, size: 64, offset: 448)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !355, line: 174, baseType: !370)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !350, file: !351, line: 80, baseType: !374, size: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !355, line: 179, baseType: !370)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !350, file: !351, line: 91, baseType: !376, size: 128, offset: 576)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !377, line: 10, size: 128, elements: !378)
!377 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!378 = !{!379, !381}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !376, file: !377, line: 12, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !355, line: 160, baseType: !370)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !376, file: !377, line: 16, baseType: !382, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !355, line: 196, baseType: !370)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !350, file: !351, line: 92, baseType: !376, size: 128, offset: 704)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !350, file: !351, line: 93, baseType: !376, size: 128, offset: 832)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !350, file: !351, line: 106, baseType: !386, size: 192, offset: 960)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 192, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 3)
!389 = !DILocation(line: 106, column: 14, scope: !344)
!390 = !DILocalVariable(name: "buf", scope: !344, file: !1, line: 107, type: !40)
!391 = !DILocation(line: 107, column: 8, scope: !344)
!392 = !DILocalVariable(name: "i", scope: !344, file: !1, line: 108, type: !75)
!393 = !DILocation(line: 108, column: 9, scope: !344)
!394 = !DILocalVariable(name: "j", scope: !344, file: !1, line: 108, type: !75)
!395 = !DILocation(line: 108, column: 12, scope: !344)
!396 = !DILocalVariable(name: "k", scope: !344, file: !1, line: 108, type: !75)
!397 = !DILocation(line: 108, column: 15, scope: !344)
!398 = !DILocalVariable(name: "tmp", scope: !344, file: !1, line: 108, type: !75)
!399 = !DILocation(line: 108, column: 18, scope: !344)
!400 = !DILocalVariable(name: "rules", scope: !344, file: !1, line: 109, type: !35)
!401 = !DILocation(line: 109, column: 10, scope: !344)
!402 = !DILocalVariable(name: "n", scope: !344, file: !1, line: 110, type: !20)
!403 = !DILocation(line: 110, column: 6, scope: !344)
!404 = !DILocalVariable(name: "fd", scope: !344, file: !1, line: 112, type: !20)
!405 = !DILocation(line: 112, column: 6, scope: !344)
!406 = !DILocation(line: 112, column: 16, scope: !344)
!407 = !DILocation(line: 112, column: 11, scope: !344)
!408 = !DILocation(line: 113, column: 6, scope: !409)
!409 = distinct !DILexicalBlock(scope: !344, file: !1, line: 113, column: 6)
!410 = !DILocation(line: 113, column: 9, scope: !409)
!411 = !DILocation(line: 113, column: 6, scope: !344)
!412 = !DILocation(line: 113, column: 16, scope: !409)
!413 = !DILocation(line: 115, column: 8, scope: !344)
!414 = !DILocation(line: 115, column: 2, scope: !344)
!415 = !DILocation(line: 116, column: 17, scope: !344)
!416 = !DILocation(line: 116, column: 25, scope: !344)
!417 = !DILocation(line: 116, column: 8, scope: !344)
!418 = !DILocation(line: 116, column: 6, scope: !344)
!419 = !DILocation(line: 117, column: 7, scope: !344)
!420 = !DILocation(line: 117, column: 11, scope: !344)
!421 = !DILocation(line: 117, column: 18, scope: !344)
!422 = !DILocation(line: 117, column: 2, scope: !344)
!423 = !DILocation(line: 118, column: 2, scope: !344)
!424 = !DILocation(line: 118, column: 8, scope: !344)
!425 = !DILocation(line: 118, column: 17, scope: !344)
!426 = !DILocation(line: 119, column: 2, scope: !344)
!427 = !DILocation(line: 119, column: 8, scope: !344)
!428 = !DILocation(line: 119, column: 16, scope: !344)
!429 = !DILocation(line: 119, column: 21, scope: !344)
!430 = !DILocation(line: 120, column: 8, scope: !344)
!431 = !DILocation(line: 120, column: 2, scope: !344)
!432 = !DILocation(line: 122, column: 13, scope: !433)
!433 = distinct !DILexicalBlock(scope: !344, file: !1, line: 122, column: 2)
!434 = !DILocation(line: 122, column: 9, scope: !433)
!435 = !DILocation(line: 122, column: 7, scope: !433)
!436 = !DILocation(line: 122, column: 18, scope: !437)
!437 = distinct !DILexicalBlock(scope: !433, file: !1, line: 122, column: 2)
!438 = !DILocation(line: 122, column: 22, scope: !437)
!439 = !DILocation(line: 122, column: 25, scope: !437)
!440 = !DILocation(line: 122, column: 2, scope: !433)
!441 = !DILocation(line: 123, column: 7, scope: !442)
!442 = distinct !DILexicalBlock(scope: !443, file: !1, line: 123, column: 7)
!443 = distinct !DILexicalBlock(scope: !437, file: !1, line: 122, column: 39)
!444 = !DILocation(line: 123, column: 11, scope: !442)
!445 = !DILocation(line: 123, column: 14, scope: !442)
!446 = !DILocation(line: 123, column: 7, scope: !443)
!447 = !DILocation(line: 123, column: 23, scope: !442)
!448 = !DILocation(line: 126, column: 7, scope: !449)
!449 = distinct !DILexicalBlock(scope: !443, file: !1, line: 126, column: 7)
!450 = !DILocation(line: 126, column: 11, scope: !449)
