; ModuleID = 'execute-a-markov-algorithm-1.ll'
source_filename = "execute-a-markov-algorithm-1.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ruleset_t = type { i32, %struct.rule_t*, i8* }
%struct.rule_t = type { i8*, i8*, i32 }
%struct.string = type { i8*, i64 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"->\00", align 1
@.str.2 = private unnamed_addr constant [28 x i8] c"parse error: no -> in %.*s\0A\00", align 1
@.str.3 = private unnamed_addr constant [23 x i8] c"left side blank? %.*s\0A\00", align 1
@.str.4 = private unnamed_addr constant [20 x i8] c"Rules from '%s' ok\0A\00", align 1
@.str.5 = private unnamed_addr constant [14 x i8] c"text:     %s\0A\00", align 1
@.str.6 = private unnamed_addr constant [14 x i8] c"markoved: %s\0A\00", align 1
@.str.7 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1
@.str.8 = private unnamed_addr constant [29 x i8] c"I bought a B of As from T S.\00", align 1
@.str.9 = private unnamed_addr constant [6 x i8] c"rule1\00", align 1
@.str.10 = private unnamed_addr constant [6 x i8] c"rule2\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git 078de928eea94413164fbdff5fab7bdcf0f60aa7)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !19, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "execute-a-markov-algorithm-1.c", directory: "/scratch/yc0769/xstack_benchmark/rosetta/Execute-a-Markov-algorithm")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 46, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!8 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!9 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!18 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!19 = !{!20, !21}
!20 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!21 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!22 = !{i32 7, !"Dwarf Version", i32 4}
!23 = !{i32 2, !"Debug Info Version", i32 3}
!24 = !{i32 1, !"wchar_size", i32 4}
!25 = !{!"clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git 078de928eea94413164fbdff5fab7bdcf0f60aa7)"}
!26 = distinct !DISubprogram(name: "ruleset_del", scope: !1, file: !1, line: 23, type: !27, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !45)
!27 = !DISubroutineType(types: !28)
!28 = !{null, !29}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "ruleset_t", file: !1, line: 21, baseType: !31)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 17, size: 192, elements: !32)
!32 = !{!33, !34, !44}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !31, file: !1, line: 18, baseType: !20, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "rules", scope: !31, file: !1, line: 19, baseType: !35, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "rule_t", file: !1, line: 15, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 12, size: 192, elements: !38)
!38 = !{!39, !42, !43}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "pat", scope: !37, file: !1, line: 13, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "repl", scope: !37, file: !1, line: 13, baseType: !40, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "terminate", scope: !37, file: !1, line: 14, baseType: !20, size: 32, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !31, file: !1, line: 20, baseType: !40, size: 64, offset: 128)
!45 = !{}
!46 = !DILocalVariable(name: "r", arg: 1, scope: !26, file: !1, line: 23, type: !29)
!47 = !DILocation(line: 0, scope: !26)
!48 = !DILocation(line: 25, column: 9, scope: !49)
!49 = distinct !DILexicalBlock(scope: !26, file: !1, line: 25, column: 6)
!50 = !DILocation(line: 25, column: 6, scope: !49)
!51 = !DILocation(line: 25, column: 6, scope: !26)
!52 = !{!"if"}
!53 = !DILocation(line: 25, column: 24, scope: !49)
!54 = !DILocation(line: 25, column: 21, scope: !49)
!55 = !DILocation(line: 25, column: 16, scope: !49)
!56 = !DILocation(line: 26, column: 9, scope: !57)
!57 = distinct !DILexicalBlock(scope: !26, file: !1, line: 26, column: 6)
!58 = !DILocation(line: 26, column: 6, scope: !57)
!59 = !DILocation(line: 26, column: 6, scope: !26)
!60 = !DILocation(line: 26, column: 22, scope: !57)
!61 = !DILocation(line: 26, column: 14, scope: !57)
!62 = !DILocation(line: 27, column: 7, scope: !26)
!63 = !DILocation(line: 27, column: 2, scope: !26)
!64 = !DILocation(line: 28, column: 1, scope: !26)
!65 = distinct !DISubprogram(name: "str_new", scope: !1, file: !1, line: 30, type: !66, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !45)
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !77}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "string", file: !1, line: 10, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 10, size: 128, elements: !71)
!71 = !{!72, !73}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !70, file: !1, line: 10, baseType: !40, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_len", scope: !70, file: !1, line: 10, baseType: !74, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !75, line: 46, baseType: !76)
!75 = !DIFile(filename: "/u/NAS_SCRATCH/yc0769/xstack/llvm-install/lib/clang/10.0.1/include/stddef.h", directory: "")
!76 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!79 = !DILocalVariable(name: "s", arg: 1, scope: !65, file: !1, line: 30, type: !77)
!80 = !DILocation(line: 0, scope: !65)
!81 = !DILocation(line: 32, column: 10, scope: !65)
!82 = !DILocalVariable(name: "l", scope: !65, file: !1, line: 32, type: !20)
!83 = !DILocation(line: 33, column: 16, scope: !65)
!84 = !DILocalVariable(name: "str", scope: !65, file: !1, line: 33, type: !68)
!85 = !DILocation(line: 34, column: 20, scope: !65)
!86 = !DILocation(line: 34, column: 18, scope: !65)
!87 = !DILocation(line: 34, column: 11, scope: !65)
!88 = !DILocation(line: 34, column: 7, scope: !65)
!89 = !DILocation(line: 34, column: 9, scope: !65)
!90 = !DILocation(line: 35, column: 14, scope: !65)
!91 = !DILocation(line: 35, column: 2, scope: !65)
!92 = !DILocation(line: 36, column: 21, scope: !65)
!93 = !DILocation(line: 36, column: 19, scope: !65)
!94 = !DILocation(line: 36, column: 7, scope: !65)
!95 = !DILocation(line: 36, column: 17, scope: !65)
!96 = !DILocation(line: 37, column: 2, scope: !65)
!97 = distinct !DISubprogram(name: "str_append", scope: !1, file: !1, line: 40, type: !98, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !45)
!98 = !DISubroutineType(types: !99)
!99 = !{null, !68, !77, !20}
!100 = !DILocalVariable(name: "str", arg: 1, scope: !97, file: !1, line: 40, type: !68)
!101 = !DILocation(line: 0, scope: !97)
!102 = !DILocalVariable(name: "s", arg: 2, scope: !97, file: !1, line: 40, type: !77)
!103 = !DILocalVariable(name: "len", arg: 3, scope: !97, file: !1, line: 40, type: !20)
!104 = !DILocation(line: 42, column: 22, scope: !97)
!105 = !DILocation(line: 42, column: 10, scope: !97)
!106 = !DILocalVariable(name: "l", scope: !97, file: !1, line: 42, type: !20)
!107 = !DILocation(line: 43, column: 10, scope: !108)
!108 = distinct !DILexicalBlock(scope: !97, file: !1, line: 43, column: 6)
!109 = !DILocation(line: 43, column: 6, scope: !97)
!110 = !DILocation(line: 43, column: 23, scope: !108)
!111 = !DILocation(line: 43, column: 17, scope: !108)
!112 = !DILocation(line: 45, column: 11, scope: !113)
!113 = distinct !DILexicalBlock(scope: !97, file: !1, line: 45, column: 6)
!114 = !DILocation(line: 45, column: 25, scope: !113)
!115 = !DILocation(line: 45, column: 31, scope: !113)
!116 = !DILocation(line: 45, column: 23, scope: !113)
!117 = !DILocation(line: 45, column: 21, scope: !113)
!118 = !DILocation(line: 45, column: 6, scope: !97)
!119 = !DILocation(line: 46, column: 22, scope: !120)
!120 = distinct !DILexicalBlock(scope: !113, file: !1, line: 45, column: 36)
!121 = !DILocation(line: 46, column: 28, scope: !120)
!122 = !DILocation(line: 46, column: 20, scope: !120)
!123 = !DILocation(line: 46, column: 8, scope: !120)
!124 = !DILocation(line: 46, column: 18, scope: !120)
!125 = !DILocation(line: 47, column: 25, scope: !120)
!126 = !DILocation(line: 47, column: 33, scope: !120)
!127 = !DILocation(line: 47, column: 12, scope: !120)
!128 = !DILocation(line: 47, column: 8, scope: !120)
!129 = !DILocation(line: 47, column: 10, scope: !120)
!130 = !DILocation(line: 48, column: 2, scope: !120)
!131 = !DILocation(line: 49, column: 14, scope: !97)
!132 = !DILocation(line: 49, column: 16, scope: !97)
!133 = !DILocation(line: 49, column: 24, scope: !97)
!134 = !DILocation(line: 49, column: 2, scope: !97)
!135 = !DILocation(line: 50, column: 7, scope: !97)
!136 = !DILocation(line: 50, column: 11, scope: !97)
!137 = !DILocation(line: 50, column: 2, scope: !97)
!138 = !DILocation(line: 50, column: 18, scope: !97)
!139 = !DILocation(line: 51, column: 1, scope: !97)
!140 = distinct !DISubprogram(name: "str_transfer", scope: !1, file: !1, line: 54, type: !141, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !45)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !68, !68}
!143 = !DILocalVariable(name: "dest", arg: 1, scope: !140, file: !1, line: 54, type: !68)
!144 = !DILocation(line: 0, scope: !140)
!145 = !DILocalVariable(name: "src", arg: 2, scope: !140, file: !1, line: 54, type: !68)
!146 = !DILocation(line: 56, column: 22, scope: !140)
!147 = !DILocalVariable(name: "tlen", scope: !140, file: !1, line: 56, type: !74)
!148 = !DILocation(line: 57, column: 25, scope: !140)
!149 = !DILocation(line: 57, column: 8, scope: !140)
!150 = !DILocation(line: 57, column: 18, scope: !140)
!151 = !DILocation(line: 58, column: 7, scope: !140)
!152 = !DILocation(line: 58, column: 17, scope: !140)
!153 = !DILocation(line: 60, column: 19, scope: !140)
!154 = !DILocalVariable(name: "ts", scope: !140, file: !1, line: 60, type: !40)
!155 = !DILocation(line: 61, column: 17, scope: !140)
!156 = !DILocation(line: 61, column: 8, scope: !140)
!157 = !DILocation(line: 61, column: 10, scope: !140)
!158 = !DILocation(line: 62, column: 7, scope: !140)
!159 = !DILocation(line: 62, column: 9, scope: !140)
!160 = !DILocation(line: 63, column: 7, scope: !140)
!161 = !DILocation(line: 63, column: 2, scope: !140)
!162 = !DILocation(line: 63, column: 12, scope: !140)
!163 = !DILocation(line: 64, column: 1, scope: !140)
!164 = distinct !DISubprogram(name: "str_del", scope: !1, file: !1, line: 66, type: !165, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !45)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !68}
!167 = !DILocalVariable(name: "s", arg: 1, scope: !164, file: !1, line: 66, type: !68)
!168 = !DILocation(line: 0, scope: !164)
!169 = !DILocation(line: 68, column: 9, scope: !170)
!170 = distinct !DILexicalBlock(scope: !164, file: !1, line: 68, column: 6)
!171 = !DILocation(line: 68, column: 6, scope: !170)
!172 = !DILocation(line: 68, column: 6, scope: !164)
!173 = !DILocation(line: 68, column: 20, scope: !170)
!174 = !DILocation(line: 68, column: 12, scope: !170)
!175 = !DILocation(line: 69, column: 7, scope: !164)
!176 = !DILocation(line: 69, column: 2, scope: !164)
!177 = !DILocation(line: 70, column: 1, scope: !164)
!178 = distinct !DISubprogram(name: "str_markov", scope: !1, file: !1, line: 72, type: !179, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !45)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !68, !29}
!181 = !DILocalVariable(name: "str", arg: 1, scope: !178, file: !1, line: 72, type: !68)
!182 = !DILocation(line: 0, scope: !178)
!183 = !DILocalVariable(name: "r", arg: 2, scope: !178, file: !1, line: 72, type: !29)
!184 = !DILocalVariable(name: "changed", scope: !178, file: !1, line: 75, type: !20)
!185 = !DILocalVariable(name: "done", scope: !178, file: !1, line: 75, type: !20)
!186 = !DILocation(line: 76, column: 16, scope: !178)
!187 = !DILocalVariable(name: "tmp", scope: !178, file: !1, line: 76, type: !68)
!188 = !DILocation(line: 78, column: 2, scope: !178)
!189 = !DILocation(line: 75, column: 19, scope: !178)
!190 = !DILocation(line: 78, column: 9, scope: !178)
!191 = !DILocalVariable(name: "i", scope: !178, file: !1, line: 74, type: !20)
!192 = !DILocation(line: 80, column: 8, scope: !193)
!193 = distinct !DILexicalBlock(scope: !194, file: !1, line: 80, column: 3)
!194 = distinct !DILexicalBlock(scope: !178, file: !1, line: 78, column: 16)
!195 = !DILocation(line: 0, scope: !193)
!196 = !DILocation(line: 0, scope: !194)
!197 = !DILocation(line: 80, column: 16, scope: !198)
!198 = distinct !DILexicalBlock(scope: !193, file: !1, line: 80, column: 3)
!199 = !DILocation(line: 80, column: 21, scope: !198)
!200 = !DILocation(line: 80, column: 25, scope: !198)
!201 = !DILocation(line: 80, column: 33, scope: !198)
!202 = !DILocation(line: 80, column: 43, scope: !198)
!203 = !DILocation(line: 80, column: 38, scope: !198)
!204 = !DILocation(line: 0, scope: !198)
!205 = !DILocation(line: 80, column: 3, scope: !193)
!206 = !DILocation(line: 81, column: 19, scope: !207)
!207 = distinct !DILexicalBlock(scope: !198, file: !1, line: 80, column: 51)
!208 = !DILocation(line: 81, column: 16, scope: !207)
!209 = !DILocation(line: 81, column: 28, scope: !207)
!210 = !DILocation(line: 81, column: 9, scope: !207)
!211 = !DILocalVariable(name: "pl", scope: !178, file: !1, line: 74, type: !20)
!212 = !DILocation(line: 82, column: 21, scope: !207)
!213 = !DILocation(line: 82, column: 9, scope: !207)
!214 = !DILocalVariable(name: "sl", scope: !178, file: !1, line: 74, type: !20)
!215 = !DILocalVariable(name: "j", scope: !178, file: !1, line: 74, type: !20)
!216 = !DILocation(line: 83, column: 9, scope: !217)
!217 = distinct !DILexicalBlock(scope: !207, file: !1, line: 83, column: 4)
!218 = !DILocation(line: 0, scope: !217)
!219 = !DILocation(line: 83, column: 18, scope: !220)
!220 = distinct !DILexicalBlock(scope: !217, file: !1, line: 83, column: 4)
!221 = !DILocation(line: 83, column: 4, scope: !217)
!222 = !DILocation(line: 84, column: 22, scope: !223)
!223 = distinct !DILexicalBlock(scope: !224, file: !1, line: 84, column: 9)
!224 = distinct !DILexicalBlock(scope: !220, file: !1, line: 83, column: 29)
!225 = !DILocation(line: 84, column: 24, scope: !223)
!226 = !DILocation(line: 84, column: 32, scope: !223)
!227 = !DILocation(line: 84, column: 29, scope: !223)
!228 = !DILocation(line: 84, column: 41, scope: !223)
!229 = !DILocation(line: 84, column: 46, scope: !223)
!230 = !DILocation(line: 84, column: 9, scope: !223)
!231 = !DILocation(line: 84, column: 9, scope: !224)
!232 = !DILocation(line: 85, column: 6, scope: !223)
!233 = !DILocation(line: 86, column: 26, scope: !224)
!234 = !DILocation(line: 86, column: 5, scope: !224)
!235 = !DILocation(line: 87, column: 24, scope: !224)
!236 = !DILocation(line: 87, column: 21, scope: !224)
!237 = !DILocation(line: 87, column: 33, scope: !224)
!238 = !DILocation(line: 87, column: 5, scope: !224)
!239 = !DILocation(line: 88, column: 26, scope: !224)
!240 = !DILocation(line: 88, column: 28, scope: !224)
!241 = !DILocation(line: 88, column: 32, scope: !224)
!242 = !DILocation(line: 88, column: 5, scope: !224)
!243 = !DILocation(line: 90, column: 5, scope: !224)
!244 = !DILocation(line: 93, column: 12, scope: !245)
!245 = distinct !DILexicalBlock(scope: !224, file: !1, line: 93, column: 9)
!246 = !DILocation(line: 93, column: 9, scope: !245)
!247 = !DILocation(line: 93, column: 21, scope: !245)
!248 = !DILocation(line: 93, column: 9, scope: !224)
!249 = !DILocation(line: 94, column: 6, scope: !245)
!250 = !DILocation(line: 95, column: 5, scope: !224)
!251 = !DILocation(line: 83, column: 25, scope: !220)
!252 = !DILocation(line: 83, column: 4, scope: !220)
!253 = distinct !{!253, !221, !254}
!254 = !DILocation(line: 96, column: 4, scope: !217)
!255 = !DILocation(line: 97, column: 3, scope: !207)
!256 = !DILocation(line: 80, column: 47, scope: !198)
!257 = !DILocation(line: 80, column: 3, scope: !198)
!258 = distinct !{!258, !205, !259}
!259 = !DILocation(line: 97, column: 3, scope: !193)
!260 = !DILocation(line: 98, column: 8, scope: !261)
!261 = distinct !DILexicalBlock(scope: !194, file: !1, line: 98, column: 7)
!262 = !DILocation(line: 98, column: 7, scope: !194)
!263 = !DILocation(line: 98, column: 17, scope: !261)
!264 = distinct !{!264, !188, !265}
!265 = !DILocation(line: 99, column: 2, scope: !178)
!266 = !DILocation(line: 100, column: 2, scope: !178)
!267 = !DILocation(line: 101, column: 2, scope: !178)
!268 = distinct !DISubprogram(name: "read_rules", scope: !1, file: !1, line: 104, type: !269, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !45)
!269 = !DISubroutineType(types: !270)
!270 = !{!29, !77}
!271 = !DILocalVariable(name: "name", arg: 1, scope: !268, file: !1, line: 104, type: !77)
!272 = !DILocation(line: 0, scope: !268)
!273 = !DILocalVariable(name: "s", scope: !268, file: !1, line: 106, type: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !275, line: 46, size: 1152, elements: !276)
!275 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!276 = !{!277, !280, !282, !284, !286, !288, !290, !291, !292, !295, !297, !299, !307, !308, !309}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !274, file: !275, line: 48, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !279, line: 145, baseType: !76)
!279 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!280 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !274, file: !275, line: 53, baseType: !281, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !279, line: 148, baseType: !76)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !274, file: !275, line: 61, baseType: !283, size: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !279, line: 151, baseType: !76)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !274, file: !275, line: 62, baseType: !285, size: 32, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !279, line: 150, baseType: !5)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !274, file: !275, line: 64, baseType: !287, size: 32, offset: 224)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !279, line: 146, baseType: !5)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !274, file: !275, line: 65, baseType: !289, size: 32, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !279, line: 147, baseType: !5)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !274, file: !275, line: 67, baseType: !20, size: 32, offset: 288)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !274, file: !275, line: 69, baseType: !278, size: 64, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !274, file: !275, line: 74, baseType: !293, size: 64, offset: 384)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !279, line: 152, baseType: !294)
!294 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !274, file: !275, line: 78, baseType: !296, size: 64, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !279, line: 174, baseType: !294)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !274, file: !275, line: 80, baseType: !298, size: 64, offset: 512)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !279, line: 179, baseType: !294)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !274, file: !275, line: 91, baseType: !300, size: 128, offset: 576)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !301, line: 10, size: 128, elements: !302)
!301 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!302 = !{!303, !305}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !300, file: !301, line: 12, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !279, line: 160, baseType: !294)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !300, file: !301, line: 16, baseType: !306, size: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !279, line: 196, baseType: !294)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !274, file: !275, line: 92, baseType: !300, size: 128, offset: 704)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !274, file: !275, line: 93, baseType: !300, size: 128, offset: 832)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !274, file: !275, line: 106, baseType: !310, size: 192, offset: 960)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 192, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 3)
!313 = !DILocation(line: 106, column: 14, scope: !268)
!314 = !DILocalVariable(name: "rules", scope: !268, file: !1, line: 109, type: !35)
!315 = !DILocalVariable(name: "n", scope: !268, file: !1, line: 110, type: !20)
!316 = !DILocation(line: 112, column: 11, scope: !268)
!317 = !DILocalVariable(name: "fd", scope: !268, file: !1, line: 112, type: !20)
!318 = !DILocation(line: 113, column: 9, scope: !319)
!319 = distinct !DILexicalBlock(scope: !268, file: !1, line: 113, column: 6)
!320 = !DILocation(line: 113, column: 6, scope: !268)
!321 = !DILocation(line: 113, column: 16, scope: !319)
!322 = !DILocation(line: 115, column: 2, scope: !268)
!323 = !DILocation(line: 116, column: 17, scope: !268)
!324 = !DILocation(line: 116, column: 25, scope: !268)
!325 = !DILocation(line: 116, column: 8, scope: !268)
!326 = !DILocalVariable(name: "buf", scope: !268, file: !1, line: 107, type: !40)
!327 = !DILocation(line: 117, column: 18, scope: !268)
!328 = !DILocation(line: 117, column: 2, scope: !268)
!329 = !DILocation(line: 118, column: 8, scope: !268)
!330 = !DILocation(line: 118, column: 2, scope: !268)
!331 = !DILocation(line: 118, column: 17, scope: !268)
!332 = !DILocation(line: 119, column: 8, scope: !268)
!333 = !DILocation(line: 119, column: 16, scope: !268)
!334 = !DILocation(line: 119, column: 2, scope: !268)
!335 = !DILocation(line: 119, column: 21, scope: !268)
!336 = !DILocation(line: 120, column: 2, scope: !268)
!337 = !DILocalVariable(name: "j", scope: !268, file: !1, line: 108, type: !74)
!338 = !DILocalVariable(name: "i", scope: !268, file: !1, line: 108, type: !74)
!339 = !DILocation(line: 122, column: 7, scope: !340)
!340 = distinct !DILexicalBlock(scope: !268, file: !1, line: 122, column: 2)
!341 = !DILocation(line: 122, column: 13, scope: !340)
!342 = !DILocation(line: 0, scope: !340)
!343 = !DILocation(line: 109, column: 10, scope: !268)
!344 = !DILocation(line: 110, column: 6, scope: !268)
!345 = !DILocation(line: 122, column: 18, scope: !346)
!346 = distinct !DILexicalBlock(scope: !340, file: !1, line: 122, column: 2)
!347 = !DILocation(line: 122, column: 25, scope: !346)
!348 = !DILocation(line: 122, column: 2, scope: !340)
!349 = !DILocation(line: 123, column: 7, scope: !350)
!350 = distinct !DILexicalBlock(scope: !351, file: !1, line: 123, column: 7)
!351 = distinct !DILexicalBlock(scope: !346, file: !1, line: 122, column: 39)
!352 = !DILocation(line: 123, column: 14, scope: !350)
!353 = !DILocation(line: 123, column: 7, scope: !351)
!354 = !DILocation(line: 123, column: 23, scope: !350)
!355 = !DILocation(line: 126, column: 7, scope: !356)
!356 = distinct !DILexicalBlock(scope: !351, file: !1, line: 126, column: 7)
!357 = !DILocation(line: 126, column: 14, scope: !356)
!358 = !DILocation(line: 126, column: 21, scope: !356)
!359 = !DILocation(line: 126, column: 26, scope: !356)
!360 = !DILocation(line: 126, column: 7, scope: !351)
!361 = !DILocation(line: 127, column: 10, scope: !362)
!362 = distinct !DILexicalBlock(scope: !356, file: !1, line: 126, column: 32)
!363 = !DILocation(line: 128, column: 4, scope: !362)
!364 = !DILocation(line: 132, column: 14, scope: !365)
!365 = distinct !DILexicalBlock(scope: !351, file: !1, line: 132, column: 3)
!366 = !DILocalVariable(name: "k", scope: !268, file: !1, line: 108, type: !74)
!367 = !DILocation(line: 132, column: 8, scope: !365)
!368 = !DILocation(line: 0, scope: !365)
!369 = !DILocation(line: 132, column: 25, scope: !370)
!370 = distinct !DILexicalBlock(scope: !365, file: !1, line: 132, column: 3)
!371 = !DILocation(line: 132, column: 21, scope: !370)
!372 = !DILocation(line: 132, column: 3, scope: !365)
!373 = !DILocation(line: 133, column: 8, scope: !374)
