; ModuleID = 'aliquot-sequence-classifications-2.bc'
source_filename = "aliquot-sequence-classifications-2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [38 x i8] c"\0AInteger : %llu, Type : %s, Series : \00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"%llu, \00", align 1
@.str.2 = private unnamed_addr constant [5 x i8] c"%llu\00", align 1
@.str.3 = private unnamed_addr constant [12 x i8] c"Terminating\00", align 1
@.str.4 = private unnamed_addr constant [8 x i8] c"Perfect\00", align 1
@.str.5 = private unnamed_addr constant [9 x i8] c"Amicable\00", align 1
@.str.6 = private unnamed_addr constant [9 x i8] c"Aspiring\00", align 1
@.str.7 = private unnamed_addr constant [9 x i8] c"Sociable\00", align 1
@.str.8 = private unnamed_addr constant [7 x i8] c"Cyclic\00", align 1
@.str.9 = private unnamed_addr constant [16 x i8] c"Non-Terminating\00", align 1
@.str.10 = private unnamed_addr constant [2 x i8] c"r\00", align 1

!217 = !DILocation(line: 64, column: 41, scope: !206)
!218 = !DILocation(line: 64, column: 42, scope: !206)
!219 = !DILocation(line: 64, column: 37, scope: !206)
!220 = !DILocation(line: 64, column: 35, scope: !206)
!221 = !DILocation(line: 64, column: 46, scope: !206)
!222 = !DILocation(line: 64, column: 53, scope: !206)
!223 = !DILocation(line: 64, column: 49, scope: !206)
!224 = !DILocation(line: 64, column: 57, scope: !206)
!225 = !DILocation(line: 64, column: 55, scope: !206)
!226 = !DILocation(line: 64, column: 6, scope: !198)
!227 = !DILocation(line: 65, column: 16, scope: !228)
!228 = distinct !DILexicalBlock(scope: !206, file: !1, line: 64, column: 60)
!229 = !DILocation(line: 65, column: 20, scope: !228)
!230 = !DILocation(line: 65, column: 21, scope: !228)
!231 = !DILocation(line: 65, column: 29, scope: !228)
!232 = !DILocation(line: 65, column: 25, scope: !228)
!233 = !DILocation(line: 65, column: 31, scope: !228)
!234 = !DILocation(line: 65, column: 24, scope: !228)
!235 = !DILocation(line: 65, column: 55, scope: !228)
!236 = !DILocation(line: 65, column: 51, scope: !228)
!237 = !DILocation(line: 65, column: 59, scope: !228)
!238 = !DILocation(line: 65, column: 57, scope: !228)
!239 = !DILocation(line: 65, column: 61, scope: !228)
!240 = !DILocation(line: 65, column: 64, scope: !228)
!241 = !DILocation(line: 65, column: 65, scope: !228)
!242 = !DILocation(line: 65, column: 50, scope: !228)
!243 = !DILocation(line: 65, column: 85, scope: !228)
!244 = !DILocation(line: 65, column: 81, scope: !228)
!245 = !DILocation(line: 65, column: 89, scope: !228)
!246 = !DILocation(line: 65, column: 87, scope: !228)
!247 = !DILocation(line: 65, column: 91, scope: !228)
!248 = !DILocation(line: 65, column: 94, scope: !228)
!249 = !DILocation(line: 65, column: 95, scope: !228)
!250 = !DILocation(line: 65, column: 80, scope: !228)
!251 = !DILocation(line: 65, column: 116, scope: !228)
!252 = !DILocation(line: 65, column: 112, scope: !228)
!253 = !DILocation(line: 65, column: 124, scope: !228)
!254 = !DILocation(line: 65, column: 125, scope: !228)
!255 = !DILocation(line: 65, column: 120, scope: !228)
!256 = !DILocation(line: 65, column: 118, scope: !228)
!257 = !DILocation(line: 65, column: 129, scope: !228)
!258 = !DILocation(line: 65, column: 136, scope: !228)
!259 = !DILocation(line: 65, column: 132, scope: !228)
!260 = !DILocation(line: 65, column: 140, scope: !228)
!261 = !DILocation(line: 65, column: 138, scope: !228)
!262 = !DILocation(line: 0, scope: !228)
!263 = !DILocation(line: 65, column: 111, scope: !228)
!264 = !DILocation(line: 65, column: 4, scope: !228)
!265 = !DILocation(line: 66, column: 4, scope: !228)
!266 = !DILocation(line: 69, column: 8, scope: !267)
!267 = distinct !DILexicalBlock(scope: !198, file: !1, line: 69, column: 3)
!268 = !DILocation(line: 69, column: 7, scope: !267)
!269 = !DILocation(line: 69, column: 11, scope: !270)
!270 = distinct !DILexicalBlock(scope: !267, file: !1, line: 69, column: 3)
!271 = !DILocation(line: 69, column: 13, scope: !270)
!272 = !DILocation(line: 69, column: 12, scope: !270)
!273 = !DILocation(line: 69, column: 3, scope: !267)
!274 = !DILocation(line: 70, column: 11, scope: !275)
!275 = distinct !DILexicalBlock(scope: !276, file: !1, line: 70, column: 7)
!276 = distinct !DILexicalBlock(scope: !270, file: !1, line: 69, column: 19)
!277 = !DILocation(line: 70, column: 7, scope: !275)
!278 = !DILocation(line: 70, column: 19, scope: !275)
!279 = !DILocation(line: 70, column: 15, scope: !275)
!280 = !DILocation(line: 70, column: 13, scope: !275)
!281 = !DILocation(line: 70, column: 7, scope: !276)
!282 = !DILocation(line: 71, column: 17, scope: !283)
!283 = distinct !DILexicalBlock(scope: !275, file: !1, line: 70, column: 22)
!284 = !DILocation(line: 71, column: 21, scope: !283)
!285 = !DILocation(line: 71, column: 22, scope: !283)
!286 = !DILocation(line: 71, column: 5, scope: !283)
!287 = !DILocation(line: 72, column: 5, scope: !283)
!288 = !DILocation(line: 74, column: 3, scope: !276)
!289 = !DILocation(line: 69, column: 16, scope: !270)
!290 = !DILocation(line: 69, column: 3, scope: !270)
!291 = distinct !{!291, !273, !292}
!292 = !DILocation(line: 74, column: 3, scope: !267)
!293 = !DILocation(line: 75, column: 2, scope: !198)
!294 = !DILocation(line: 61, column: 16, scope: !194)
!295 = !DILocation(line: 61, column: 2, scope: !194)
!296 = distinct !{!296, !196, !297}
!297 = !DILocation(line: 75, column: 2, scope: !191)
!298 = !DILocation(line: 77, column: 14, scope: !173)
!299 = !DILocation(line: 77, column: 18, scope: !173)
!300 = !DILocation(line: 77, column: 19, scope: !173)
!301 = !DILocation(line: 77, column: 2, scope: !173)
!302 = !DILocation(line: 78, column: 1, scope: !173)
!303 = distinct !DISubprogram(name: "processFile", scope: !1, file: !1, line: 80, type: !304, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !6}
!306 = !DILocalVariable(name: "fileName", arg: 1, scope: !303, file: !1, line: 80, type: !6)
!307 = !DILocation(line: 80, column: 24, scope: !303)
!308 = !DILocalVariable(name: "fp", scope: !303, file: !1, line: 81, type: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !311, line: 7, baseType: !312)
!311 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !313, line: 49, size: 1728, elements: !314)
!313 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!314 = !{!315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !330, !332, !333, !334, !338, !340, !342, !346, !349, !351, !354, !357, !358, !359, !363, !364}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !312, file: !313, line: 51, baseType: !141, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !312, file: !313, line: 54, baseType: !6, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !312, file: !313, line: 55, baseType: !6, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !312, file: !313, line: 56, baseType: !6, size: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !312, file: !313, line: 57, baseType: !6, size: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !312, file: !313, line: 58, baseType: !6, size: 64, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !312, file: !313, line: 59, baseType: !6, size: 64, offset: 384)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !312, file: !313, line: 60, baseType: !6, size: 64, offset: 448)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !312, file: !313, line: 61, baseType: !6, size: 64, offset: 512)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !312, file: !313, line: 64, baseType: !6, size: 64, offset: 576)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !312, file: !313, line: 65, baseType: !6, size: 64, offset: 640)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !312, file: !313, line: 66, baseType: !6, size: 64, offset: 704)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !312, file: !313, line: 68, baseType: !328, size: 64, offset: 768)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !313, line: 36, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !312, file: !313, line: 70, baseType: !331, size: 64, offset: 832)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !312, file: !313, line: 72, baseType: !141, size: 32, offset: 896)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !312, file: !313, line: 73, baseType: !141, size: 32, offset: 928)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !312, file: !313, line: 74, baseType: !335, size: 64, offset: 960)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !336, line: 152, baseType: !337)
!336 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!337 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !312, file: !313, line: 77, baseType: !339, size: 16, offset: 1024)
!339 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !312, file: !313, line: 78, baseType: !341, size: 8, offset: 1040)
!341 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !312, file: !313, line: 79, baseType: !343, size: 8, offset: 1048)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 1)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !312, file: !313, line: 81, baseType: !347, size: 64, offset: 1088)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !313, line: 43, baseType: null)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !312, file: !313, line: 89, baseType: !350, size: 64, offset: 1152)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !336, line: 153, baseType: !337)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !312, file: !313, line: 91, baseType: !352, size: 64, offset: 1216)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !313, line: 37, flags: DIFlagFwdDecl)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !312, file: !313, line: 92, baseType: !355, size: 64, offset: 1280)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !313, line: 38, flags: DIFlagFwdDecl)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !312, file: !313, line: 93, baseType: !331, size: 64, offset: 1344)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !312, file: !313, line: 94, baseType: !4, size: 64, offset: 1408)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !312, file: !313, line: 95, baseType: !360, size: 64, offset: 1472)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !361, line: 46, baseType: !362)
!361 = !DIFile(filename: "/u/NAS_SCRATCH/yc0769/xstack/xstack-installs/llvm-install-debug/lib/clang/10.0.1/include/stddef.h", directory: "")
!362 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !312, file: !313, line: 96, baseType: !141, size: 32, offset: 1536)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !312, file: !313, line: 98, baseType: !365, size: 160, offset: 1568)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 20)
!368 = !DILocation(line: 81, column: 8, scope: !303)
!369 = !DILocation(line: 81, column: 19, scope: !303)
!370 = !DILocation(line: 81, column: 13, scope: !303)
!371 = !DILocalVariable(name: "str", scope: !303, file: !1, line: 82, type: !372)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 168, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 21)
!375 = !DILocation(line: 82, column: 7, scope: !303)
!376 = !DILocation(line: 84, column: 2, scope: !303)
!377 = !DILocation(line: 84, column: 14, scope: !303)
!378 = !DILocation(line: 84, column: 21, scope: !303)
!379 = !DILocation(line: 84, column: 8, scope: !303)
!380 = !DILocation(line: 84, column: 24, scope: !303)
!381 = !DILocation(line: 85, column: 30, scope: !303)
!382 = !DILocation(line: 85, column: 21, scope: !303)
!383 = !DILocation(line: 85, column: 3, scope: !303)
!384 = distinct !{!384, !376, !385}
!385 = !DILocation(line: 85, column: 50, scope: !303)
!386 = !DILocation(line: 87, column: 9, scope: !303)
!387 = !DILocation(line: 87, column: 2, scope: !303)
!388 = !DILocation(line: 88, column: 1, scope: !303)
!389 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 90, type: !390, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!390 = !DISubroutineType(types: !391)
!391 = !{!141, !141, !5}
!392 = !DILocalVariable(name: "argC", arg: 1, scope: !389, file: !1, line: 90, type: !141)
!393 = !DILocation(line: 90, column: 14, scope: !389)
!394 = !DILocalVariable(name: "argV", arg: 2, scope: !389, file: !1, line: 90, type: !5)
!395 = !DILocation(line: 90, column: 25, scope: !389)
!396 = !DILocation(line: 92, column: 8, scope: !397)
!397 = distinct !DILexicalBlock(scope: !389, file: !1, line: 92, column: 8)
!398 = !DILocation(line: 92, column: 12, scope: !397)
!399 = !DILocation(line: 92, column: 8, scope: !389)
!400 = !DILocation(line: 93, column: 42, scope: !397)
!401 = !DILocation(line: 93, column: 3, scope: !397)
!402 = !DILocation(line: 95, column: 13, scope: !403)
!403 = distinct !DILexicalBlock(scope: !404, file: !1, line: 95, column: 6)
!404 = distinct !DILexicalBlock(scope: !397, file: !1, line: 94, column: 6)
!405 = !DILocation(line: 95, column: 6, scope: !403)
!406 = !DILocation(line: 95, column: 25, scope: !403)
!407 = !DILocation(line: 95, column: 6, scope: !404)
!408 = !DILocation(line: 96, column: 16, scope: !403)
!409 = !DILocation(line: 96, column: 4, scope: !403)
!410 = !DILocation(line: 98, column: 31, scope: !403)
!411 = !DILocation(line: 98, column: 22, scope: !403)
!412 = !DILocation(line: 98, column: 4, scope: !403)
!413 = !DILocation(line: 100, column: 2, scope: !389)
