; ModuleID = 'draw-a-sphere-2.ll'
source_filename = "draw-a-sphere-2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@g = dso_local global [4 x i32] [i32 -1, i32 1, i32 -1, i32 1], align 16, !dbg !0
@scale = common dso_local global [8 x double] zeroinitializer, align 16, !dbg !6
@scale_u = common dso_local global [8 x double] zeroinitializer, align 16, !dbg !12
@.str = private unnamed_addr constant [8 x i8] c"out.pgm\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"w+\00", align 1
@.str.2 = private unnamed_addr constant [16 x i8] c"P5\0A256 256\0A255\0A\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local void @noise_init() #0 !dbg !22 {
entry:
  call void @llvm.dbg.value(metadata i32 1, metadata !25, metadata !DIExpression()), !dbg !26
  br label %for.cond, !dbg !27

for.cond:                                         ; preds = %for.inc, %entry
  %i.0 = phi i32 [ 1, %entry ], [ %inc, %for.inc ], !dbg !29

!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!376 = !DILocalVariable(name: "i", scope: !356, file: !3, line: 127, type: !15)
!377 = !DILocation(line: 133, column: 7, scope: !373)
!378 = !DILocation(line: 0, scope: !373)
!379 = !DILocation(line: 133, column: 25, scope: !380)
!380 = distinct !DILexicalBlock(scope: !373, file: !3, line: 133, column: 2)
!381 = !DILocation(line: 133, column: 2, scope: !373)
!382 = !DILocation(line: 133, column: 45, scope: !380)
!383 = !DILocation(line: 133, column: 48, scope: !380)
!384 = !DILocation(line: 133, column: 43, scope: !380)
!385 = !DILocation(line: 133, column: 39, scope: !380)
!386 = !DILocation(line: 133, column: 2, scope: !380)
!387 = distinct !{!387, !381, !388}
!388 = !DILocation(line: 133, column: 50, scope: !373)
!389 = !DILocation(line: 135, column: 11, scope: !390)
!390 = distinct !DILexicalBlock(scope: !356, file: !3, line: 135, column: 2)
!391 = !DILocation(line: 135, column: 7, scope: !390)
!392 = !DILocation(line: 0, scope: !390)
!393 = !DILocation(line: 135, column: 9, scope: !390)
!394 = !DILocation(line: 135, column: 25, scope: !395)
!395 = distinct !DILexicalBlock(scope: !390, file: !3, line: 135, column: 2)
!396 = !DILocation(line: 135, column: 2, scope: !390)
!397 = !DILocation(line: 136, column: 10, scope: !398)
!398 = distinct !DILexicalBlock(scope: !395, file: !3, line: 135, column: 37)
!399 = !DILocation(line: 136, column: 7, scope: !398)
!400 = !DILocation(line: 136, column: 17, scope: !398)
!401 = !DILocalVariable(name: "y", scope: !356, file: !3, line: 128, type: !9)
!402 = !DILocalVariable(name: "j", scope: !356, file: !3, line: 127, type: !15)
!403 = !DILocation(line: 137, column: 8, scope: !404)
!404 = distinct !DILexicalBlock(scope: !398, file: !3, line: 137, column: 3)
!405 = !DILocation(line: 0, scope: !404)
!406 = !DILocation(line: 137, column: 17, scope: !407)
!407 = distinct !DILexicalBlock(scope: !404, file: !3, line: 137, column: 3)
!408 = !DILocation(line: 137, column: 3, scope: !404)
!409 = !DILocation(line: 138, column: 11, scope: !410)
!410 = distinct !DILexicalBlock(scope: !407, file: !3, line: 137, column: 34)
!411 = !DILocation(line: 138, column: 8, scope: !410)
!412 = !DILocation(line: 138, column: 18, scope: !410)
!413 = !DILocalVariable(name: "x", scope: !356, file: !3, line: 128, type: !9)
!414 = !DILocation(line: 139, column: 21, scope: !410)
!415 = !DILocation(line: 139, column: 22, scope: !410)
!416 = !DILocation(line: 139, column: 29, scope: !410)
!417 = !DILocation(line: 139, column: 30, scope: !410)
!418 = !DILocation(line: 139, column: 10, scope: !410)
!419 = !DILocation(line: 139, column: 37, scope: !410)
!420 = !DILocation(line: 139, column: 42, scope: !410)
!421 = !DILocation(line: 139, column: 48, scope: !410)
!422 = !DILocation(line: 139, column: 46, scope: !410)
!423 = !DILocation(line: 139, column: 9, scope: !410)
!424 = !DILocation(line: 139, column: 7, scope: !410)
!425 = !DILocation(line: 141, column: 12, scope: !410)
!426 = !DILocation(line: 141, column: 9, scope: !410)
!427 = !DILocation(line: 141, column: 18, scope: !410)
!428 = !DILocation(line: 141, column: 15, scope: !410)
!429 = !DILocalVariable(name: "z", scope: !356, file: !3, line: 128, type: !9)
!430 = !DILocation(line: 142, column: 10, scope: !431)
!431 = distinct !DILexicalBlock(scope: !410, file: !3, line: 142, column: 8)
!432 = !DILocation(line: 142, column: 8, scope: !410)
!433 = !DILocation(line: 142, column: 15, scope: !431)
!434 = !DILocation(line: 144, column: 8, scope: !410)
!435 = !DILocation(line: 146, column: 8, scope: !410)
!436 = !DILocalVariable(name: "w", scope: !356, file: !3, line: 128, type: !9)
!437 = !DILocation(line: 148, column: 11, scope: !410)
!438 = !DILocation(line: 148, column: 16, scope: !410)
!439 = !DILocation(line: 149, column: 12, scope: !410)
!440 = !DILocation(line: 149, column: 16, scope: !410)
!441 = !DILocation(line: 149, column: 20, scope: !410)
!442 = !DILocation(line: 149, column: 25, scope: !410)
!443 = !DILocation(line: 149, column: 6, scope: !410)
!444 = !DILocation(line: 150, column: 10, scope: !445)
!445 = distinct !DILexicalBlock(scope: !410, file: !3, line: 150, column: 8)
!446 = !DILocation(line: 150, column: 8, scope: !410)
!447 = !DILocation(line: 150, column: 15, scope: !445)
!448 = !DILocation(line: 0, scope: !410)
!449 = !DILocation(line: 152, column: 11, scope: !410)
!450 = !DILocation(line: 152, column: 9, scope: !410)
!451 = !DILocation(line: 152, column: 7, scope: !410)
!452 = !DILocation(line: 153, column: 3, scope: !410)
!453 = !DILocation(line: 137, column: 25, scope: !407)
!454 = !DILocation(line: 137, column: 30, scope: !407)
!455 = !DILocation(line: 137, column: 3, scope: !407)
!456 = distinct !{!456, !408, !457}
!457 = !DILocation(line: 153, column: 3, scope: !404)
!458 = !DILocation(line: 154, column: 2, scope: !398)
!459 = !DILocation(line: 135, column: 33, scope: !395)
!460 = !DILocation(line: 135, column: 2, scope: !395)
!461 = distinct !{!461, !396, !462}
!462 = !DILocation(line: 154, column: 2, scope: !390)
!463 = !DILocation(line: 156, column: 7, scope: !356)
!464 = !DILocalVariable(name: "fp", scope: !356, file: !3, line: 129, type: !465)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !467, line: 7, baseType: !468)
!467 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !469, line: 49, size: 1728, elements: !470)
!469 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!470 = !{!471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !486, !488, !489, !490, !494, !496, !498, !502, !505, !507, !510, !513, !514, !516, !520, !521}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !468, file: !469, line: 51, baseType: !15, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !468, file: !469, line: 54, baseType: !360, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !468, file: !469, line: 55, baseType: !360, size: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !468, file: !469, line: 56, baseType: !360, size: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !468, file: !469, line: 57, baseType: !360, size: 64, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !468, file: !469, line: 58, baseType: !360, size: 64, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !468, file: !469, line: 59, baseType: !360, size: 64, offset: 384)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !468, file: !469, line: 60, baseType: !360, size: 64, offset: 448)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !468, file: !469, line: 61, baseType: !360, size: 64, offset: 512)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !468, file: !469, line: 64, baseType: !360, size: 64, offset: 576)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !468, file: !469, line: 65, baseType: !360, size: 64, offset: 640)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !468, file: !469, line: 66, baseType: !360, size: 64, offset: 704)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !468, file: !469, line: 68, baseType: !484, size: 64, offset: 768)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !469, line: 36, flags: DIFlagFwdDecl)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !468, file: !469, line: 70, baseType: !487, size: 64, offset: 832)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !468, file: !469, line: 72, baseType: !15, size: 32, offset: 896)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !468, file: !469, line: 73, baseType: !15, size: 32, offset: 928)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !468, file: !469, line: 74, baseType: !491, size: 64, offset: 960)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !492, line: 152, baseType: !493)
!492 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!493 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !468, file: !469, line: 77, baseType: !495, size: 16, offset: 1024)
!495 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !468, file: !469, line: 78, baseType: !497, size: 8, offset: 1040)
!497 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !468, file: !469, line: 79, baseType: !499, size: 8, offset: 1048)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 8, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 1)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !468, file: !469, line: 81, baseType: !503, size: 64, offset: 1088)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !469, line: 43, baseType: null)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !468, file: !469, line: 89, baseType: !506, size: 64, offset: 1152)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !492, line: 153, baseType: !493)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !468, file: !469, line: 91, baseType: !508, size: 64, offset: 1216)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !469, line: 37, flags: DIFlagFwdDecl)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !468, file: !469, line: 92, baseType: !511, size: 64, offset: 1280)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !469, line: 38, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !468, file: !469, line: 93, baseType: !487, size: 64, offset: 1344)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !468, file: !469, line: 94, baseType: !515, size: 64, offset: 1408)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !468, file: !469, line: 95, baseType: !517, size: 64, offset: 1472)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !518, line: 46, baseType: !519)
!518 = !DIFile(filename: "/u/NAS_SCRATCH/yc0769/xstack/xstack-installs-old/llvm-install-debug/lib/clang/10.0.1/include/stddef.h", directory: "")
!519 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !468, file: !469, line: 96, baseType: !15, size: 32, offset: 1536)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !468, file: !469, line: 98, baseType: !522, size: 160, offset: 1568)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 160, elements: !523)
!523 = !{!524}
!524 = !DISubrange(count: 20)
!525 = !DILocation(line: 157, column: 2, scope: !356)
!526 = !DILocation(line: 158, column: 9, scope: !356)
!527 = !DILocation(line: 158, column: 2, scope: !356)
!528 = !DILocation(line: 159, column: 2, scope: !356)
!529 = !DILocation(line: 161, column: 2, scope: !356)
