; ModuleID = 'draw-a-sphere-2.c'
source_filename = "draw-a-sphere-2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@g = dso_local global [4 x i32] [i32 -1, i32 1, i32 -1, i32 1], align 16, !dbg !0
@scale = common dso_local global [8 x double] zeroinitializer, align 16, !dbg !6
@scale_u = common dso_local global [8 x double] zeroinitializer, align 16, !dbg !12
@.str = private unnamed_addr constant [8 x i8] c"out.pgm\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"w+\00", align 1
@.str.2 = private unnamed_addr constant [16 x i8] c"P5\0A256 256\0A255\0A\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local void @noise_init() #0 !dbg !22 {
entry:
  %i = alloca i32, align 4
  call void @llvm.dbg.declare(metadata i32* %i, metadata !25, metadata !DIExpression()), !dbg !26
  store i32 1, i32* %i, align 4, !dbg !27
  br label %for.cond, !dbg !29

for.cond:                                         ; preds = %for.inc, %entry
  %0 = load i32, i32* %i, align 4, !dbg !30

!407 = !DILocalVariable(name: "r", scope: !394, file: !3, line: 112, type: !9)
!408 = !DILocation(line: 112, column: 9, scope: !394)
!409 = !DILocalVariable(name: "v", scope: !394, file: !3, line: 112, type: !410)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 3)
!413 = !DILocation(line: 112, column: 16, scope: !394)
!414 = !DILocalVariable(name: "w", scope: !394, file: !3, line: 112, type: !9)
!415 = !DILocation(line: 112, column: 22, scope: !394)
!416 = !DILocation(line: 114, column: 9, scope: !417)
!417 = distinct !DILexicalBlock(scope: !394, file: !3, line: 114, column: 2)
!418 = !DILocation(line: 114, column: 17, scope: !417)
!419 = !DILocation(line: 114, column: 7, scope: !417)
!420 = !DILocation(line: 114, column: 22, scope: !421)
!421 = distinct !DILexicalBlock(scope: !417, file: !3, line: 114, column: 2)
!422 = !DILocation(line: 114, column: 24, scope: !421)
!423 = !DILocation(line: 114, column: 2, scope: !417)
!424 = !DILocation(line: 115, column: 10, scope: !425)
!425 = distinct !DILexicalBlock(scope: !421, file: !3, line: 114, column: 40)
!426 = !DILocation(line: 115, column: 14, scope: !425)
!427 = !DILocation(line: 115, column: 12, scope: !425)
!428 = !DILocation(line: 115, column: 3, scope: !425)
!429 = !DILocation(line: 115, column: 8, scope: !425)
!430 = !DILocation(line: 115, column: 24, scope: !425)
!431 = !DILocation(line: 115, column: 28, scope: !425)
!432 = !DILocation(line: 115, column: 26, scope: !425)
!433 = !DILocation(line: 115, column: 17, scope: !425)
!434 = !DILocation(line: 115, column: 22, scope: !425)
!435 = !DILocation(line: 115, column: 38, scope: !425)
!436 = !DILocation(line: 115, column: 42, scope: !425)
!437 = !DILocation(line: 115, column: 40, scope: !425)
!438 = !DILocation(line: 115, column: 31, scope: !425)
!439 = !DILocation(line: 115, column: 36, scope: !425)
!440 = !DILocation(line: 116, column: 15, scope: !425)
!441 = !DILocation(line: 116, column: 10, scope: !425)
!442 = !DILocation(line: 116, column: 9, scope: !425)
!443 = !DILocation(line: 116, column: 5, scope: !425)
!444 = !DILocation(line: 117, column: 14, scope: !425)
!445 = !DILocation(line: 117, column: 8, scope: !425)
!446 = !DILocation(line: 117, column: 22, scope: !425)
!447 = !DILocation(line: 117, column: 20, scope: !425)
!448 = !DILocation(line: 117, column: 5, scope: !425)
!449 = !DILocation(line: 118, column: 9, scope: !425)
!450 = !DILocation(line: 118, column: 6, scope: !425)
!451 = !DILocation(line: 119, column: 2, scope: !425)
!452 = !DILocation(line: 114, column: 33, scope: !421)
!453 = !DILocation(line: 114, column: 2, scope: !421)
!454 = distinct !{!454, !423, !455}
!455 = !DILocation(line: 119, column: 2, scope: !417)
!456 = !DILocation(line: 120, column: 9, scope: !394)
!457 = !DILocation(line: 120, column: 13, scope: !394)
!458 = !DILocation(line: 120, column: 11, scope: !394)
!459 = !DILocation(line: 120, column: 2, scope: !394)
!460 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 124, type: !461, scopeLine: 125, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!461 = !DISubroutineType(types: !462)
!462 = !{!15, !15, !463}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!466 = !DILocalVariable(name: "c", arg: 1, scope: !460, file: !3, line: 124, type: !15)
!467 = !DILocation(line: 124, column: 14, scope: !460)
!468 = !DILocalVariable(name: "v", arg: 2, scope: !460, file: !3, line: 124, type: !463)
!469 = !DILocation(line: 124, column: 24, scope: !460)
!470 = !DILocalVariable(name: "pix", scope: !460, file: !3, line: 126, type: !471)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 524288, elements: !473)
!472 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!473 = !{!474}
!474 = !DISubrange(count: 65536)
!475 = !DILocation(line: 126, column: 16, scope: !460)
!476 = !DILocalVariable(name: "p", scope: !460, file: !3, line: 126, type: !477)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!478 = !DILocation(line: 126, column: 33, scope: !460)
!479 = !DILocalVariable(name: "i", scope: !460, file: !3, line: 127, type: !15)
!480 = !DILocation(line: 127, column: 6, scope: !460)
!481 = !DILocalVariable(name: "j", scope: !460, file: !3, line: 127, type: !15)
!482 = !DILocation(line: 127, column: 9, scope: !460)
!483 = !DILocalVariable(name: "x", scope: !460, file: !3, line: 128, type: !9)
!484 = !DILocation(line: 128, column: 9, scope: !460)
!485 = !DILocalVariable(name: "y", scope: !460, file: !3, line: 128, type: !9)
!486 = !DILocation(line: 128, column: 12, scope: !460)
!487 = !DILocalVariable(name: "z", scope: !460, file: !3, line: 128, type: !9)
!488 = !DILocation(line: 128, column: 15, scope: !460)
!489 = !DILocalVariable(name: "w", scope: !460, file: !3, line: 128, type: !9)
!490 = !DILocation(line: 128, column: 18, scope: !460)
!491 = !DILocalVariable(name: "fp", scope: !460, file: !3, line: 129, type: !492)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !494, line: 7, baseType: !495)
!494 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !496, line: 49, size: 1728, elements: !497)
!496 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!497 = !{!498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !513, !515, !516, !517, !521, !523, !525, !529, !532, !534, !537, !540, !541, !543, !547, !548}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !495, file: !496, line: 51, baseType: !15, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !495, file: !496, line: 54, baseType: !464, size: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !495, file: !496, line: 55, baseType: !464, size: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !495, file: !496, line: 56, baseType: !464, size: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !495, file: !496, line: 57, baseType: !464, size: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !495, file: !496, line: 58, baseType: !464, size: 64, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !495, file: !496, line: 59, baseType: !464, size: 64, offset: 384)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !495, file: !496, line: 60, baseType: !464, size: 64, offset: 448)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !495, file: !496, line: 61, baseType: !464, size: 64, offset: 512)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !495, file: !496, line: 64, baseType: !464, size: 64, offset: 576)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !495, file: !496, line: 65, baseType: !464, size: 64, offset: 640)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !495, file: !496, line: 66, baseType: !464, size: 64, offset: 704)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !495, file: !496, line: 68, baseType: !511, size: 64, offset: 768)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !496, line: 36, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !495, file: !496, line: 70, baseType: !514, size: 64, offset: 832)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !495, file: !496, line: 72, baseType: !15, size: 32, offset: 896)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !495, file: !496, line: 73, baseType: !15, size: 32, offset: 928)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !495, file: !496, line: 74, baseType: !518, size: 64, offset: 960)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !519, line: 152, baseType: !520)
!519 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!520 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !495, file: !496, line: 77, baseType: !522, size: 16, offset: 1024)
!522 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !495, file: !496, line: 78, baseType: !524, size: 8, offset: 1040)
!524 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !495, file: !496, line: 79, baseType: !526, size: 8, offset: 1048)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 8, elements: !527)
!527 = !{!528}
!528 = !DISubrange(count: 1)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !495, file: !496, line: 81, baseType: !530, size: 64, offset: 1088)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !496, line: 43, baseType: null)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !495, file: !496, line: 89, baseType: !533, size: 64, offset: 1152)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !519, line: 153, baseType: !520)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !495, file: !496, line: 91, baseType: !535, size: 64, offset: 1216)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !496, line: 37, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !495, file: !496, line: 92, baseType: !538, size: 64, offset: 1280)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !496, line: 38, flags: DIFlagFwdDecl)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !495, file: !496, line: 93, baseType: !514, size: 64, offset: 1344)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !495, file: !496, line: 94, baseType: !542, size: 64, offset: 1408)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !495, file: !496, line: 95, baseType: !544, size: 64, offset: 1472)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !545, line: 46, baseType: !546)
!545 = !DIFile(filename: "/u/NAS_SCRATCH/yc0769/xstack/llvm-install/lib/clang/10.0.1/include/stddef.h", directory: "")
!546 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !495, file: !496, line: 96, baseType: !15, size: 32, offset: 1536)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !495, file: !496, line: 98, baseType: !549, size: 160, offset: 1568)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 160, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 20)
!552 = !DILocation(line: 129, column: 8, scope: !460)
!553 = !DILocation(line: 131, column: 2, scope: !460)
!554 = !DILocation(line: 133, column: 11, scope: !555)
!555 = distinct !DILexicalBlock(scope: !460, file: !3, line: 133, column: 2)
!556 = !DILocation(line: 133, column: 9, scope: !555)
!557 = !DILocation(line: 133, column: 18, scope: !555)
!558 = !DILocation(line: 133, column: 7, scope: !555)
!559 = !DILocation(line: 133, column: 23, scope: !560)
!560 = distinct !DILexicalBlock(scope: !555, file: !3, line: 133, column: 2)
!561 = !DILocation(line: 133, column: 25, scope: !560)
!562 = !DILocation(line: 133, column: 2, scope: !555)
!563 = !DILocation(line: 133, column: 45, scope: !560)
!564 = !DILocation(line: 133, column: 48, scope: !560)
!565 = !DILocation(line: 133, column: 43, scope: !560)
!566 = !DILocation(line: 133, column: 39, scope: !560)
!567 = !DILocation(line: 133, column: 2, scope: !560)
!568 = distinct !{!568, !562, !569}
!569 = !DILocation(line: 133, column: 50, scope: !555)
!570 = !DILocation(line: 135, column: 11, scope: !571)
!571 = distinct !DILexicalBlock(scope: !460, file: !3, line: 135, column: 2)
!572 = !DILocation(line: 135, column: 9, scope: !571)
!573 = !DILocation(line: 135, column: 18, scope: !571)
!574 = !DILocation(line: 135, column: 7, scope: !571)
!575 = !DILocation(line: 135, column: 23, scope: !576)
!576 = distinct !DILexicalBlock(scope: !571, file: !3, line: 135, column: 2)
!577 = !DILocation(line: 135, column: 25, scope: !576)
!578 = !DILocation(line: 135, column: 2, scope: !571)
!579 = !DILocation(line: 136, column: 8, scope: !580)
!580 = distinct !DILexicalBlock(scope: !576, file: !3, line: 135, column: 37)
!581 = !DILocation(line: 136, column: 10, scope: !580)
!582 = !DILocation(line: 136, column: 7, scope: !580)
!583 = !DILocation(line: 136, column: 17, scope: !580)
!584 = !DILocation(line: 136, column: 5, scope: !580)
!585 = !DILocation(line: 137, column: 10, scope: !586)
!586 = distinct !DILexicalBlock(scope: !580, file: !3, line: 137, column: 3)
!587 = !DILocation(line: 137, column: 8, scope: !586)
!588 = !DILocation(line: 137, column: 15, scope: !589)
!589 = distinct !DILexicalBlock(scope: !586, file: !3, line: 137, column: 3)
!590 = !DILocation(line: 137, column: 17, scope: !589)
!591 = !DILocation(line: 137, column: 3, scope: !586)
!592 = !DILocation(line: 138, column: 9, scope: !593)
!593 = distinct !DILexicalBlock(scope: !589, file: !3, line: 137, column: 34)
!594 = !DILocation(line: 138, column: 11, scope: !593)
!595 = !DILocation(line: 138, column: 8, scope: !593)
!596 = !DILocation(line: 138, column: 18, scope: !593)
!597 = !DILocation(line: 138, column: 6, scope: !593)
!598 = !DILocation(line: 139, column: 21, scope: !593)
!599 = !DILocation(line: 139, column: 22, scope: !593)
!600 = !DILocation(line: 139, column: 29, scope: !593)
!601 = !DILocation(line: 139, column: 30, scope: !593)
!602 = !DILocation(line: 139, column: 10, scope: !593)
!603 = !DILocation(line: 139, column: 37, scope: !593)
!604 = !DILocation(line: 139, column: 42, scope: !593)
!605 = !DILocation(line: 139, column: 48, scope: !593)
!606 = !DILocation(line: 139, column: 46, scope: !593)
!607 = !DILocation(line: 139, column: 9, scope: !593)
!608 = !DILocation(line: 139, column: 5, scope: !593)
!609 = !DILocation(line: 139, column: 7, scope: !593)
!610 = !DILocation(line: 141, column: 11, scope: !593)
!611 = !DILocation(line: 141, column: 13, scope: !593)
!612 = !DILocation(line: 141, column: 12, scope: !593)
!613 = !DILocation(line: 141, column: 9, scope: !593)
!614 = !DILocation(line: 141, column: 17, scope: !593)
!615 = !DILocation(line: 141, column: 19, scope: !593)
!616 = !DILocation(line: 141, column: 18, scope: !593)
