; ModuleID = 'draw-a-sphere-2.ll'
source_filename = "draw-a-sphere-2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@g = dso_local global [4 x i32] [i32 -1, i32 1, i32 -1, i32 1], align 16, !dbg !0
@scale = common dso_local global [8 x double] zeroinitializer, align 16, !dbg !6
@scale_u = common dso_local global [8 x double] zeroinitializer, align 16, !dbg !12
@.str = private unnamed_addr constant [8 x i8] c"out.pgm\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"w+\00", align 1
@.str.2 = private unnamed_addr constant [16 x i8] c"P5\0A256 256\0A255\0A\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local void @noise_init() #0 !dbg !22 {
entry:
  %i = alloca i32, align 4
  call void @llvm.dbg.declare(metadata i32* %i, metadata !25, metadata !DIExpression()), !dbg !26
  store i32 1, i32* %i, align 4, !dbg !27
  br label %for.cond, !dbg !29

for.cond:                                         ; preds = %for.inc, %entry
  %0 = load i32, i32* %i, align 4, !dbg !30

!406 = !DILocalVariable(name: "r", scope: !393, file: !3, line: 112, type: !9)
!407 = !DILocation(line: 112, column: 9, scope: !393)
!408 = !DILocalVariable(name: "v", scope: !393, file: !3, line: 112, type: !409)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 3)
!412 = !DILocation(line: 112, column: 16, scope: !393)
!413 = !DILocalVariable(name: "w", scope: !393, file: !3, line: 112, type: !9)
!414 = !DILocation(line: 112, column: 22, scope: !393)
!415 = !DILocation(line: 114, column: 9, scope: !416)
!416 = distinct !DILexicalBlock(scope: !393, file: !3, line: 114, column: 2)
!417 = !DILocation(line: 114, column: 17, scope: !416)
!418 = !DILocation(line: 114, column: 7, scope: !416)
!419 = !DILocation(line: 114, column: 22, scope: !420)
!420 = distinct !DILexicalBlock(scope: !416, file: !3, line: 114, column: 2)
!421 = !DILocation(line: 114, column: 24, scope: !420)
!422 = !DILocation(line: 114, column: 2, scope: !416)
!423 = !DILocation(line: 115, column: 10, scope: !424)
!424 = distinct !DILexicalBlock(scope: !420, file: !3, line: 114, column: 40)
!425 = !DILocation(line: 115, column: 14, scope: !424)
!426 = !DILocation(line: 115, column: 12, scope: !424)
!427 = !DILocation(line: 115, column: 3, scope: !424)
!428 = !DILocation(line: 115, column: 8, scope: !424)
!429 = !DILocation(line: 115, column: 24, scope: !424)
!430 = !DILocation(line: 115, column: 28, scope: !424)
!431 = !DILocation(line: 115, column: 26, scope: !424)
!432 = !DILocation(line: 115, column: 17, scope: !424)
!433 = !DILocation(line: 115, column: 22, scope: !424)
!434 = !DILocation(line: 115, column: 38, scope: !424)
!435 = !DILocation(line: 115, column: 42, scope: !424)
!436 = !DILocation(line: 115, column: 40, scope: !424)
!437 = !DILocation(line: 115, column: 31, scope: !424)
!438 = !DILocation(line: 115, column: 36, scope: !424)
!439 = !DILocation(line: 116, column: 15, scope: !424)
!440 = !DILocation(line: 116, column: 10, scope: !424)
!441 = !DILocation(line: 116, column: 9, scope: !424)
!442 = !DILocation(line: 116, column: 5, scope: !424)
!443 = !DILocation(line: 117, column: 14, scope: !424)
!444 = !DILocation(line: 117, column: 8, scope: !424)
!445 = !DILocation(line: 117, column: 22, scope: !424)
!446 = !DILocation(line: 117, column: 20, scope: !424)
!447 = !DILocation(line: 117, column: 5, scope: !424)
!448 = !DILocation(line: 118, column: 9, scope: !424)
!449 = !DILocation(line: 118, column: 6, scope: !424)
!450 = !DILocation(line: 119, column: 2, scope: !424)
!451 = !DILocation(line: 114, column: 33, scope: !420)
!452 = !DILocation(line: 114, column: 2, scope: !420)
!453 = distinct !{!453, !422, !454}
!454 = !DILocation(line: 119, column: 2, scope: !416)
!455 = !DILocation(line: 120, column: 9, scope: !393)
!456 = !DILocation(line: 120, column: 13, scope: !393)
!457 = !DILocation(line: 120, column: 11, scope: !393)
!458 = !DILocation(line: 120, column: 2, scope: !393)
!459 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 124, type: !460, scopeLine: 125, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!460 = !DISubroutineType(types: !461)
!461 = !{!15, !15, !462}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!465 = !DILocalVariable(name: "c", arg: 1, scope: !459, file: !3, line: 124, type: !15)
!466 = !DILocation(line: 124, column: 14, scope: !459)
!467 = !DILocalVariable(name: "v", arg: 2, scope: !459, file: !3, line: 124, type: !462)
!468 = !DILocation(line: 124, column: 24, scope: !459)
!469 = !DILocalVariable(name: "pix", scope: !459, file: !3, line: 126, type: !470)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 524288, elements: !472)
!471 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!472 = !{!473}
!473 = !DISubrange(count: 65536)
!474 = !DILocation(line: 126, column: 16, scope: !459)
!475 = !DILocalVariable(name: "p", scope: !459, file: !3, line: 126, type: !476)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!477 = !DILocation(line: 126, column: 33, scope: !459)
!478 = !DILocalVariable(name: "i", scope: !459, file: !3, line: 127, type: !15)
!479 = !DILocation(line: 127, column: 6, scope: !459)
!480 = !DILocalVariable(name: "j", scope: !459, file: !3, line: 127, type: !15)
!481 = !DILocation(line: 127, column: 9, scope: !459)
!482 = !DILocalVariable(name: "x", scope: !459, file: !3, line: 128, type: !9)
!483 = !DILocation(line: 128, column: 9, scope: !459)
!484 = !DILocalVariable(name: "y", scope: !459, file: !3, line: 128, type: !9)
!485 = !DILocation(line: 128, column: 12, scope: !459)
!486 = !DILocalVariable(name: "z", scope: !459, file: !3, line: 128, type: !9)
!487 = !DILocation(line: 128, column: 15, scope: !459)
!488 = !DILocalVariable(name: "w", scope: !459, file: !3, line: 128, type: !9)
!489 = !DILocation(line: 128, column: 18, scope: !459)
!490 = !DILocalVariable(name: "fp", scope: !459, file: !3, line: 129, type: !491)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !493, line: 7, baseType: !494)
!493 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !495, line: 49, size: 1728, elements: !496)
!495 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!496 = !{!497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !512, !514, !515, !516, !520, !522, !524, !528, !531, !533, !536, !539, !540, !542, !546, !547}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !494, file: !495, line: 51, baseType: !15, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !494, file: !495, line: 54, baseType: !463, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !494, file: !495, line: 55, baseType: !463, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !494, file: !495, line: 56, baseType: !463, size: 64, offset: 192)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !494, file: !495, line: 57, baseType: !463, size: 64, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !494, file: !495, line: 58, baseType: !463, size: 64, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !494, file: !495, line: 59, baseType: !463, size: 64, offset: 384)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !494, file: !495, line: 60, baseType: !463, size: 64, offset: 448)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !494, file: !495, line: 61, baseType: !463, size: 64, offset: 512)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !494, file: !495, line: 64, baseType: !463, size: 64, offset: 576)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !494, file: !495, line: 65, baseType: !463, size: 64, offset: 640)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !494, file: !495, line: 66, baseType: !463, size: 64, offset: 704)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !494, file: !495, line: 68, baseType: !510, size: 64, offset: 768)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !495, line: 36, flags: DIFlagFwdDecl)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !494, file: !495, line: 70, baseType: !513, size: 64, offset: 832)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !494, file: !495, line: 72, baseType: !15, size: 32, offset: 896)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !494, file: !495, line: 73, baseType: !15, size: 32, offset: 928)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !494, file: !495, line: 74, baseType: !517, size: 64, offset: 960)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !518, line: 152, baseType: !519)
!518 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!519 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !494, file: !495, line: 77, baseType: !521, size: 16, offset: 1024)
!521 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !494, file: !495, line: 78, baseType: !523, size: 8, offset: 1040)
!523 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !494, file: !495, line: 79, baseType: !525, size: 8, offset: 1048)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 8, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 1)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !494, file: !495, line: 81, baseType: !529, size: 64, offset: 1088)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !495, line: 43, baseType: null)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !494, file: !495, line: 89, baseType: !532, size: 64, offset: 1152)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !518, line: 153, baseType: !519)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !494, file: !495, line: 91, baseType: !534, size: 64, offset: 1216)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !495, line: 37, flags: DIFlagFwdDecl)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !494, file: !495, line: 92, baseType: !537, size: 64, offset: 1280)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !495, line: 38, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !494, file: !495, line: 93, baseType: !513, size: 64, offset: 1344)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !494, file: !495, line: 94, baseType: !541, size: 64, offset: 1408)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !494, file: !495, line: 95, baseType: !543, size: 64, offset: 1472)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !544, line: 46, baseType: !545)
!544 = !DIFile(filename: "/u/NAS_SCRATCH/yc0769/xstack/xstack-installs-old/llvm-install-debug/lib/clang/10.0.1/include/stddef.h", directory: "")
!545 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !494, file: !495, line: 96, baseType: !15, size: 32, offset: 1536)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !494, file: !495, line: 98, baseType: !548, size: 160, offset: 1568)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 160, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 20)
!551 = !DILocation(line: 129, column: 8, scope: !459)
!552 = !DILocation(line: 131, column: 2, scope: !459)
!553 = !DILocation(line: 133, column: 11, scope: !554)
!554 = distinct !DILexicalBlock(scope: !459, file: !3, line: 133, column: 2)
!555 = !DILocation(line: 133, column: 9, scope: !554)
!556 = !DILocation(line: 133, column: 18, scope: !554)
!557 = !DILocation(line: 133, column: 7, scope: !554)
!558 = !DILocation(line: 133, column: 23, scope: !559)
!559 = distinct !DILexicalBlock(scope: !554, file: !3, line: 133, column: 2)
!560 = !DILocation(line: 133, column: 25, scope: !559)
!561 = !DILocation(line: 133, column: 2, scope: !554)
!562 = !DILocation(line: 133, column: 45, scope: !559)
!563 = !DILocation(line: 133, column: 48, scope: !559)
!564 = !DILocation(line: 133, column: 43, scope: !559)
!565 = !DILocation(line: 133, column: 39, scope: !559)
!566 = !DILocation(line: 133, column: 2, scope: !559)
!567 = distinct !{!567, !561, !568}
!568 = !DILocation(line: 133, column: 50, scope: !554)
!569 = !DILocation(line: 135, column: 11, scope: !570)
!570 = distinct !DILexicalBlock(scope: !459, file: !3, line: 135, column: 2)
!571 = !DILocation(line: 135, column: 9, scope: !570)
!572 = !DILocation(line: 135, column: 18, scope: !570)
!573 = !DILocation(line: 135, column: 7, scope: !570)
!574 = !DILocation(line: 135, column: 23, scope: !575)
!575 = distinct !DILexicalBlock(scope: !570, file: !3, line: 135, column: 2)
!576 = !DILocation(line: 135, column: 25, scope: !575)
!577 = !DILocation(line: 135, column: 2, scope: !570)
!578 = !DILocation(line: 136, column: 8, scope: !579)
!579 = distinct !DILexicalBlock(scope: !575, file: !3, line: 135, column: 37)
!580 = !DILocation(line: 136, column: 10, scope: !579)
!581 = !DILocation(line: 136, column: 7, scope: !579)
!582 = !DILocation(line: 136, column: 17, scope: !579)
!583 = !DILocation(line: 136, column: 5, scope: !579)
!584 = !DILocation(line: 137, column: 10, scope: !585)
!585 = distinct !DILexicalBlock(scope: !579, file: !3, line: 137, column: 3)
!586 = !DILocation(line: 137, column: 8, scope: !585)
!587 = !DILocation(line: 137, column: 15, scope: !588)
!588 = distinct !DILexicalBlock(scope: !585, file: !3, line: 137, column: 3)
!589 = !DILocation(line: 137, column: 17, scope: !588)
!590 = !DILocation(line: 137, column: 3, scope: !585)
!591 = !DILocation(line: 138, column: 9, scope: !592)
!592 = distinct !DILexicalBlock(scope: !588, file: !3, line: 137, column: 34)
!593 = !DILocation(line: 138, column: 11, scope: !592)
!594 = !DILocation(line: 138, column: 8, scope: !592)
!595 = !DILocation(line: 138, column: 18, scope: !592)
!596 = !DILocation(line: 138, column: 6, scope: !592)
!597 = !DILocation(line: 139, column: 21, scope: !592)
!598 = !DILocation(line: 139, column: 22, scope: !592)
!599 = !DILocation(line: 139, column: 29, scope: !592)
!600 = !DILocation(line: 139, column: 30, scope: !592)
!601 = !DILocation(line: 139, column: 10, scope: !592)
!602 = !DILocation(line: 139, column: 37, scope: !592)
!603 = !DILocation(line: 139, column: 42, scope: !592)
!604 = !DILocation(line: 139, column: 48, scope: !592)
!605 = !DILocation(line: 139, column: 46, scope: !592)
!606 = !DILocation(line: 139, column: 9, scope: !592)
!607 = !DILocation(line: 139, column: 5, scope: !592)
!608 = !DILocation(line: 139, column: 7, scope: !592)
!609 = !DILocation(line: 141, column: 11, scope: !592)
!610 = !DILocation(line: 141, column: 13, scope: !592)
!611 = !DILocation(line: 141, column: 12, scope: !592)
!612 = !DILocation(line: 141, column: 9, scope: !592)
!613 = !DILocation(line: 141, column: 17, scope: !592)
!614 = !DILocation(line: 141, column: 19, scope: !592)
!615 = !DILocation(line: 141, column: 18, scope: !592)
