; ModuleID = 'aliquot-sequence-classifications-2.ll'
source_filename = "aliquot-sequence-classifications-2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [38 x i8] c"\0AInteger : %llu, Type : %s, Series : \00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"%llu, \00", align 1
@.str.2 = private unnamed_addr constant [5 x i8] c"%llu\00", align 1
@.str.3 = private unnamed_addr constant [12 x i8] c"Terminating\00", align 1
@.str.4 = private unnamed_addr constant [8 x i8] c"Perfect\00", align 1
@.str.5 = private unnamed_addr constant [9 x i8] c"Amicable\00", align 1
@.str.6 = private unnamed_addr constant [9 x i8] c"Aspiring\00", align 1
@.str.7 = private unnamed_addr constant [9 x i8] c"Sociable\00", align 1
@.str.8 = private unnamed_addr constant [7 x i8] c"Cyclic\00", align 1
@.str.9 = private unnamed_addr constant [16 x i8] c"Non-Terminating\00", align 1
@.str.10 = private unnamed_addr constant [2 x i8] c"r\00", align 1

!151 = !DILocation(line: 0, scope: !150)
!152 = !DILocation(line: 61, column: 11, scope: !153)
!153 = distinct !DILexicalBlock(scope: !150, file: !1, line: 61, column: 2)
!154 = !DILocation(line: 61, column: 2, scope: !150)
!155 = !DILocation(line: 62, column: 34, scope: !156)
!156 = distinct !DILexicalBlock(scope: !153, file: !1, line: 61, column: 19)
!157 = !DILocation(line: 62, column: 29, scope: !156)
!158 = !DILocation(line: 62, column: 12, scope: !156)
!159 = !DILocation(line: 62, column: 3, scope: !156)
!160 = !DILocation(line: 62, column: 10, scope: !156)
!161 = !DILocation(line: 64, column: 6, scope: !162)
!162 = distinct !DILexicalBlock(scope: !156, file: !1, line: 64, column: 6)
!163 = !DILocation(line: 64, column: 12, scope: !162)
!164 = !DILocation(line: 64, column: 15, scope: !162)
!165 = !DILocation(line: 64, column: 17, scope: !162)
!166 = !DILocation(line: 64, column: 23, scope: !162)
!167 = !DILocation(line: 64, column: 26, scope: !162)
!168 = !DILocation(line: 64, column: 29, scope: !162)
!169 = !DILocation(line: 64, column: 42, scope: !162)
!170 = !DILocation(line: 64, column: 37, scope: !162)
!171 = !DILocation(line: 64, column: 35, scope: !162)
!172 = !DILocation(line: 64, column: 46, scope: !162)
!173 = !DILocation(line: 64, column: 49, scope: !162)
!174 = !DILocation(line: 64, column: 55, scope: !162)
!175 = !DILocation(line: 64, column: 6, scope: !156)
!176 = !DILocation(line: 65, column: 16, scope: !177)
!177 = distinct !DILexicalBlock(scope: !162, file: !1, line: 64, column: 60)
!178 = !DILocation(line: 65, column: 21, scope: !177)
!179 = !DILocation(line: 65, column: 25, scope: !177)
!180 = !DILocation(line: 65, column: 31, scope: !177)
!181 = !DILocation(line: 65, column: 24, scope: !177)
!182 = !DILocation(line: 65, column: 51, scope: !177)
!183 = !DILocation(line: 65, column: 57, scope: !177)
!184 = !DILocation(line: 65, column: 61, scope: !177)
!185 = !DILocation(line: 65, column: 65, scope: !177)
!186 = !DILocation(line: 65, column: 50, scope: !177)
!187 = !DILocation(line: 65, column: 81, scope: !177)
!188 = !DILocation(line: 65, column: 87, scope: !177)
!189 = !DILocation(line: 65, column: 91, scope: !177)
!190 = !DILocation(line: 65, column: 95, scope: !177)
!191 = !DILocation(line: 65, column: 80, scope: !177)
!192 = !DILocation(line: 65, column: 112, scope: !177)
!193 = !DILocation(line: 65, column: 125, scope: !177)
!194 = !DILocation(line: 65, column: 120, scope: !177)
!195 = !DILocation(line: 65, column: 118, scope: !177)
!196 = !DILocation(line: 65, column: 129, scope: !177)
!197 = !DILocation(line: 65, column: 132, scope: !177)
!198 = !DILocation(line: 65, column: 138, scope: !177)
!199 = !DILocation(line: 0, scope: !177)
!200 = !DILocation(line: 65, column: 111, scope: !177)
!201 = !DILocation(line: 65, column: 4, scope: !177)
!202 = !DILocation(line: 66, column: 4, scope: !177)
!203 = !DILocalVariable(name: "j", scope: !136, file: !1, line: 57, type: !112)
!204 = !DILocation(line: 69, column: 7, scope: !205)
!205 = distinct !DILexicalBlock(scope: !156, file: !1, line: 69, column: 3)
!206 = !DILocation(line: 0, scope: !205)
!207 = !DILocation(line: 69, column: 12, scope: !208)
!208 = distinct !DILexicalBlock(scope: !205, file: !1, line: 69, column: 3)
!209 = !DILocation(line: 69, column: 3, scope: !205)
!210 = !DILocation(line: 70, column: 7, scope: !211)
!211 = distinct !DILexicalBlock(scope: !212, file: !1, line: 70, column: 7)
!212 = distinct !DILexicalBlock(scope: !208, file: !1, line: 69, column: 19)
!213 = !DILocation(line: 70, column: 15, scope: !211)
!214 = !DILocation(line: 70, column: 13, scope: !211)
!215 = !DILocation(line: 70, column: 7, scope: !212)
!216 = !DILocation(line: 71, column: 17, scope: !217)
!217 = distinct !DILexicalBlock(scope: !211, file: !1, line: 70, column: 22)
!218 = !DILocation(line: 71, column: 22, scope: !217)
!219 = !DILocation(line: 71, column: 5, scope: !217)
!220 = !DILocation(line: 72, column: 5, scope: !217)
!221 = !DILocation(line: 74, column: 3, scope: !212)
!222 = !DILocation(line: 69, column: 16, scope: !208)
!223 = !DILocation(line: 69, column: 3, scope: !208)
!224 = distinct !{!224, !209, !225}
!225 = !DILocation(line: 74, column: 3, scope: !205)
!226 = !DILocation(line: 75, column: 2, scope: !156)
!227 = !DILocation(line: 61, column: 16, scope: !153)
!228 = !DILocation(line: 61, column: 2, scope: !153)
!229 = distinct !{!229, !154, !230}
!230 = !DILocation(line: 75, column: 2, scope: !150)
!231 = !DILocation(line: 77, column: 14, scope: !136)
!232 = !DILocation(line: 77, column: 19, scope: !136)
!233 = !DILocation(line: 77, column: 2, scope: !136)
!234 = !DILocation(line: 78, column: 1, scope: !136)
!235 = distinct !DISubprogram(name: "processFile", scope: !1, file: !1, line: 80, type: !236, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!236 = !DISubroutineType(types: !237)
!237 = !{null, !6}
!238 = !DILocalVariable(name: "fileName", arg: 1, scope: !235, file: !1, line: 80, type: !6)
!239 = !DILocation(line: 0, scope: !235)
!240 = !DILocation(line: 81, column: 13, scope: !235)
!241 = !DILocalVariable(name: "fp", scope: !235, file: !1, line: 81, type: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !244, line: 7, baseType: !245)
!244 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !246, line: 49, size: 1728, elements: !247)
!246 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!247 = !{!248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !263, !265, !266, !267, !271, !273, !275, !279, !282, !284, !287, !290, !291, !292, !296, !297}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !245, file: !246, line: 51, baseType: !112, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !245, file: !246, line: 54, baseType: !6, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !245, file: !246, line: 55, baseType: !6, size: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !245, file: !246, line: 56, baseType: !6, size: 64, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !245, file: !246, line: 57, baseType: !6, size: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !245, file: !246, line: 58, baseType: !6, size: 64, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !245, file: !246, line: 59, baseType: !6, size: 64, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !245, file: !246, line: 60, baseType: !6, size: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !245, file: !246, line: 61, baseType: !6, size: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !245, file: !246, line: 64, baseType: !6, size: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !245, file: !246, line: 65, baseType: !6, size: 64, offset: 640)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !245, file: !246, line: 66, baseType: !6, size: 64, offset: 704)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !245, file: !246, line: 68, baseType: !261, size: 64, offset: 768)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !246, line: 36, flags: DIFlagFwdDecl)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !245, file: !246, line: 70, baseType: !264, size: 64, offset: 832)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !245, file: !246, line: 72, baseType: !112, size: 32, offset: 896)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !245, file: !246, line: 73, baseType: !112, size: 32, offset: 928)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !245, file: !246, line: 74, baseType: !268, size: 64, offset: 960)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !269, line: 152, baseType: !270)
!269 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!270 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !245, file: !246, line: 77, baseType: !272, size: 16, offset: 1024)
!272 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !245, file: !246, line: 78, baseType: !274, size: 8, offset: 1040)
!274 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !245, file: !246, line: 79, baseType: !276, size: 8, offset: 1048)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 1)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !245, file: !246, line: 81, baseType: !280, size: 64, offset: 1088)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !246, line: 43, baseType: null)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !245, file: !246, line: 89, baseType: !283, size: 64, offset: 1152)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !269, line: 153, baseType: !270)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !245, file: !246, line: 91, baseType: !285, size: 64, offset: 1216)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !246, line: 37, flags: DIFlagFwdDecl)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !245, file: !246, line: 92, baseType: !288, size: 64, offset: 1280)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !246, line: 38, flags: DIFlagFwdDecl)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !245, file: !246, line: 93, baseType: !264, size: 64, offset: 1344)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !245, file: !246, line: 94, baseType: !4, size: 64, offset: 1408)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !245, file: !246, line: 95, baseType: !293, size: 64, offset: 1472)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !294, line: 46, baseType: !295)
!294 = !DIFile(filename: "/u/NAS_SCRATCH/yc0769/xstack/llvm-install/lib/clang/10.0.1/include/stddef.h", directory: "")
!295 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !245, file: !246, line: 96, baseType: !112, size: 32, offset: 1536)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !245, file: !246, line: 98, baseType: !298, size: 160, offset: 1568)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 20)
!301 = !DILocalVariable(name: "str", scope: !235, file: !1, line: 82, type: !302)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 168, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 21)
!305 = !DILocation(line: 82, column: 7, scope: !235)
!306 = !DILocation(line: 84, column: 2, scope: !235)
!307 = !DILocation(line: 84, column: 14, scope: !235)
!308 = !DILocation(line: 84, column: 8, scope: !235)
!309 = !DILocation(line: 84, column: 24, scope: !235)
!310 = !DILocation(line: 85, column: 30, scope: !235)
!311 = !DILocation(line: 85, column: 21, scope: !235)
!312 = !DILocation(line: 85, column: 3, scope: !235)
!313 = distinct !{!313, !306, !314}
!314 = !DILocation(line: 85, column: 50, scope: !235)
!315 = !DILocation(line: 87, column: 2, scope: !235)
!316 = !DILocation(line: 88, column: 1, scope: !235)
!317 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 90, type: !318, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!318 = !DISubroutineType(types: !319)
!319 = !{!112, !112, !5}
!320 = !DILocalVariable(name: "argC", arg: 1, scope: !317, file: !1, line: 90, type: !112)
!321 = !DILocation(line: 0, scope: !317)
!322 = !DILocalVariable(name: "argV", arg: 2, scope: !317, file: !1, line: 90, type: !5)
!323 = !DILocation(line: 92, column: 12, scope: !324)
!324 = distinct !DILexicalBlock(scope: !317, file: !1, line: 92, column: 8)
!325 = !DILocation(line: 92, column: 8, scope: !317)
!326 = !DILocation(line: 93, column: 42, scope: !324)
!327 = !DILocation(line: 93, column: 3, scope: !324)
!328 = !DILocation(line: 95, column: 13, scope: !329)
!329 = distinct !DILexicalBlock(scope: !330, file: !1, line: 95, column: 6)
!330 = distinct !DILexicalBlock(scope: !324, file: !1, line: 94, column: 6)
!331 = !DILocation(line: 95, column: 6, scope: !329)
!332 = !DILocation(line: 95, column: 25, scope: !329)
!333 = !DILocation(line: 95, column: 6, scope: !330)
!334 = !DILocation(line: 96, column: 16, scope: !329)
!335 = !DILocation(line: 96, column: 4, scope: !329)
!336 = !DILocation(line: 98, column: 31, scope: !329)
!337 = !DILocation(line: 98, column: 22, scope: !329)
!338 = !DILocation(line: 98, column: 4, scope: !329)
!339 = !DILocation(line: 100, column: 2, scope: !317)
