; ModuleID = 'aliquot-sequence-classifications-2.c'
source_filename = "aliquot-sequence-classifications-2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [38 x i8] c"\0AInteger : %llu, Type : %s, Series : \00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"%llu, \00", align 1
@.str.2 = private unnamed_addr constant [5 x i8] c"%llu\00", align 1
@.str.3 = private unnamed_addr constant [12 x i8] c"Terminating\00", align 1
@.str.4 = private unnamed_addr constant [8 x i8] c"Perfect\00", align 1
@.str.5 = private unnamed_addr constant [9 x i8] c"Amicable\00", align 1
@.str.6 = private unnamed_addr constant [9 x i8] c"Aspiring\00", align 1
@.str.7 = private unnamed_addr constant [9 x i8] c"Sociable\00", align 1
@.str.8 = private unnamed_addr constant [7 x i8] c"Cyclic\00", align 1
@.str.9 = private unnamed_addr constant [16 x i8] c"Non-Terminating\00", align 1
@.str.10 = private unnamed_addr constant [2 x i8] c"r\00", align 1

!218 = !DILocation(line: 64, column: 41, scope: !207)
!219 = !DILocation(line: 64, column: 42, scope: !207)
!220 = !DILocation(line: 64, column: 37, scope: !207)
!221 = !DILocation(line: 64, column: 35, scope: !207)
!222 = !DILocation(line: 64, column: 46, scope: !207)
!223 = !DILocation(line: 64, column: 53, scope: !207)
!224 = !DILocation(line: 64, column: 49, scope: !207)
!225 = !DILocation(line: 64, column: 57, scope: !207)
!226 = !DILocation(line: 64, column: 55, scope: !207)
!227 = !DILocation(line: 64, column: 6, scope: !199)
!228 = !DILocation(line: 65, column: 16, scope: !229)
!229 = distinct !DILexicalBlock(scope: !207, file: !1, line: 64, column: 60)
!230 = !DILocation(line: 65, column: 20, scope: !229)
!231 = !DILocation(line: 65, column: 21, scope: !229)
!232 = !DILocation(line: 65, column: 29, scope: !229)
!233 = !DILocation(line: 65, column: 25, scope: !229)
!234 = !DILocation(line: 65, column: 31, scope: !229)
!235 = !DILocation(line: 65, column: 24, scope: !229)
!236 = !DILocation(line: 65, column: 55, scope: !229)
!237 = !DILocation(line: 65, column: 51, scope: !229)
!238 = !DILocation(line: 65, column: 59, scope: !229)
!239 = !DILocation(line: 65, column: 57, scope: !229)
!240 = !DILocation(line: 65, column: 61, scope: !229)
!241 = !DILocation(line: 65, column: 64, scope: !229)
!242 = !DILocation(line: 65, column: 65, scope: !229)
!243 = !DILocation(line: 65, column: 50, scope: !229)
!244 = !DILocation(line: 65, column: 85, scope: !229)
!245 = !DILocation(line: 65, column: 81, scope: !229)
!246 = !DILocation(line: 65, column: 89, scope: !229)
!247 = !DILocation(line: 65, column: 87, scope: !229)
!248 = !DILocation(line: 65, column: 91, scope: !229)
!249 = !DILocation(line: 65, column: 94, scope: !229)
!250 = !DILocation(line: 65, column: 95, scope: !229)
!251 = !DILocation(line: 65, column: 80, scope: !229)
!252 = !DILocation(line: 65, column: 116, scope: !229)
!253 = !DILocation(line: 65, column: 112, scope: !229)
!254 = !DILocation(line: 65, column: 124, scope: !229)
!255 = !DILocation(line: 65, column: 125, scope: !229)
!256 = !DILocation(line: 65, column: 120, scope: !229)
!257 = !DILocation(line: 65, column: 118, scope: !229)
!258 = !DILocation(line: 65, column: 129, scope: !229)
!259 = !DILocation(line: 65, column: 136, scope: !229)
!260 = !DILocation(line: 65, column: 132, scope: !229)
!261 = !DILocation(line: 65, column: 140, scope: !229)
!262 = !DILocation(line: 65, column: 138, scope: !229)
!263 = !DILocation(line: 0, scope: !229)
!264 = !DILocation(line: 65, column: 111, scope: !229)
!265 = !DILocation(line: 65, column: 4, scope: !229)
!266 = !DILocation(line: 66, column: 4, scope: !229)
!267 = !DILocation(line: 69, column: 8, scope: !268)
!268 = distinct !DILexicalBlock(scope: !199, file: !1, line: 69, column: 3)
!269 = !DILocation(line: 69, column: 7, scope: !268)
!270 = !DILocation(line: 69, column: 11, scope: !271)
!271 = distinct !DILexicalBlock(scope: !268, file: !1, line: 69, column: 3)
!272 = !DILocation(line: 69, column: 13, scope: !271)
!273 = !DILocation(line: 69, column: 12, scope: !271)
!274 = !DILocation(line: 69, column: 3, scope: !268)
!275 = !DILocation(line: 70, column: 11, scope: !276)
!276 = distinct !DILexicalBlock(scope: !277, file: !1, line: 70, column: 7)
!277 = distinct !DILexicalBlock(scope: !271, file: !1, line: 69, column: 19)
!278 = !DILocation(line: 70, column: 7, scope: !276)
!279 = !DILocation(line: 70, column: 19, scope: !276)
!280 = !DILocation(line: 70, column: 15, scope: !276)
!281 = !DILocation(line: 70, column: 13, scope: !276)
!282 = !DILocation(line: 70, column: 7, scope: !277)
!283 = !DILocation(line: 71, column: 17, scope: !284)
!284 = distinct !DILexicalBlock(scope: !276, file: !1, line: 70, column: 22)
!285 = !DILocation(line: 71, column: 21, scope: !284)
!286 = !DILocation(line: 71, column: 22, scope: !284)
!287 = !DILocation(line: 71, column: 5, scope: !284)
!288 = !DILocation(line: 72, column: 5, scope: !284)
!289 = !DILocation(line: 74, column: 3, scope: !277)
!290 = !DILocation(line: 69, column: 16, scope: !271)
!291 = !DILocation(line: 69, column: 3, scope: !271)
!292 = distinct !{!292, !274, !293}
!293 = !DILocation(line: 74, column: 3, scope: !268)
!294 = !DILocation(line: 75, column: 2, scope: !199)
!295 = !DILocation(line: 61, column: 16, scope: !195)
!296 = !DILocation(line: 61, column: 2, scope: !195)
!297 = distinct !{!297, !197, !298}
!298 = !DILocation(line: 75, column: 2, scope: !192)
!299 = !DILocation(line: 77, column: 14, scope: !174)
!300 = !DILocation(line: 77, column: 18, scope: !174)
!301 = !DILocation(line: 77, column: 19, scope: !174)
!302 = !DILocation(line: 77, column: 2, scope: !174)
!303 = !DILocation(line: 78, column: 1, scope: !174)
!304 = distinct !DISubprogram(name: "processFile", scope: !1, file: !1, line: 80, type: !305, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !6}
!307 = !DILocalVariable(name: "fileName", arg: 1, scope: !304, file: !1, line: 80, type: !6)
!308 = !DILocation(line: 80, column: 24, scope: !304)
!309 = !DILocalVariable(name: "fp", scope: !304, file: !1, line: 81, type: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !312, line: 7, baseType: !313)
!312 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !314, line: 49, size: 1728, elements: !315)
!314 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!315 = !{!316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !331, !333, !334, !335, !339, !341, !343, !347, !350, !352, !355, !358, !359, !360, !364, !365}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !313, file: !314, line: 51, baseType: !142, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !313, file: !314, line: 54, baseType: !6, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !313, file: !314, line: 55, baseType: !6, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !313, file: !314, line: 56, baseType: !6, size: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !313, file: !314, line: 57, baseType: !6, size: 64, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !313, file: !314, line: 58, baseType: !6, size: 64, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !313, file: !314, line: 59, baseType: !6, size: 64, offset: 384)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !313, file: !314, line: 60, baseType: !6, size: 64, offset: 448)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !313, file: !314, line: 61, baseType: !6, size: 64, offset: 512)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !313, file: !314, line: 64, baseType: !6, size: 64, offset: 576)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !313, file: !314, line: 65, baseType: !6, size: 64, offset: 640)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !313, file: !314, line: 66, baseType: !6, size: 64, offset: 704)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !313, file: !314, line: 68, baseType: !329, size: 64, offset: 768)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !314, line: 36, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !313, file: !314, line: 70, baseType: !332, size: 64, offset: 832)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !313, file: !314, line: 72, baseType: !142, size: 32, offset: 896)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !313, file: !314, line: 73, baseType: !142, size: 32, offset: 928)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !313, file: !314, line: 74, baseType: !336, size: 64, offset: 960)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !337, line: 152, baseType: !338)
!337 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!338 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !313, file: !314, line: 77, baseType: !340, size: 16, offset: 1024)
!340 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !313, file: !314, line: 78, baseType: !342, size: 8, offset: 1040)
!342 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !313, file: !314, line: 79, baseType: !344, size: 8, offset: 1048)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 1)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !313, file: !314, line: 81, baseType: !348, size: 64, offset: 1088)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !314, line: 43, baseType: null)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !313, file: !314, line: 89, baseType: !351, size: 64, offset: 1152)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !337, line: 153, baseType: !338)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !313, file: !314, line: 91, baseType: !353, size: 64, offset: 1216)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !314, line: 37, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !313, file: !314, line: 92, baseType: !356, size: 64, offset: 1280)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !314, line: 38, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !313, file: !314, line: 93, baseType: !332, size: 64, offset: 1344)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !313, file: !314, line: 94, baseType: !4, size: 64, offset: 1408)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !313, file: !314, line: 95, baseType: !361, size: 64, offset: 1472)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !362, line: 46, baseType: !363)
!362 = !DIFile(filename: "/u/NAS_SCRATCH/yc0769/xstack/llvm-install/lib/clang/10.0.1/include/stddef.h", directory: "")
!363 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !313, file: !314, line: 96, baseType: !142, size: 32, offset: 1536)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !313, file: !314, line: 98, baseType: !366, size: 160, offset: 1568)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 20)
!369 = !DILocation(line: 81, column: 8, scope: !304)
!370 = !DILocation(line: 81, column: 19, scope: !304)
!371 = !DILocation(line: 81, column: 13, scope: !304)
!372 = !DILocalVariable(name: "str", scope: !304, file: !1, line: 82, type: !373)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 168, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 21)
!376 = !DILocation(line: 82, column: 7, scope: !304)
!377 = !DILocation(line: 84, column: 2, scope: !304)
!378 = !DILocation(line: 84, column: 14, scope: !304)
!379 = !DILocation(line: 84, column: 21, scope: !304)
!380 = !DILocation(line: 84, column: 8, scope: !304)
!381 = !DILocation(line: 84, column: 24, scope: !304)
!382 = !DILocation(line: 85, column: 30, scope: !304)
!383 = !DILocation(line: 85, column: 21, scope: !304)
!384 = !DILocation(line: 85, column: 3, scope: !304)
!385 = distinct !{!385, !377, !386}
!386 = !DILocation(line: 85, column: 50, scope: !304)
!387 = !DILocation(line: 87, column: 9, scope: !304)
!388 = !DILocation(line: 87, column: 2, scope: !304)
!389 = !DILocation(line: 88, column: 1, scope: !304)
!390 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 90, type: !391, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!391 = !DISubroutineType(types: !392)
!392 = !{!142, !142, !5}
!393 = !DILocalVariable(name: "argC", arg: 1, scope: !390, file: !1, line: 90, type: !142)
!394 = !DILocation(line: 90, column: 14, scope: !390)
!395 = !DILocalVariable(name: "argV", arg: 2, scope: !390, file: !1, line: 90, type: !5)
!396 = !DILocation(line: 90, column: 25, scope: !390)
!397 = !DILocation(line: 92, column: 8, scope: !398)
!398 = distinct !DILexicalBlock(scope: !390, file: !1, line: 92, column: 8)
!399 = !DILocation(line: 92, column: 12, scope: !398)
!400 = !DILocation(line: 92, column: 8, scope: !390)
!401 = !DILocation(line: 93, column: 42, scope: !398)
!402 = !DILocation(line: 93, column: 3, scope: !398)
!403 = !DILocation(line: 95, column: 13, scope: !404)
!404 = distinct !DILexicalBlock(scope: !405, file: !1, line: 95, column: 6)
!405 = distinct !DILexicalBlock(scope: !398, file: !1, line: 94, column: 6)
!406 = !DILocation(line: 95, column: 6, scope: !404)
!407 = !DILocation(line: 95, column: 25, scope: !404)
!408 = !DILocation(line: 95, column: 6, scope: !405)
!409 = !DILocation(line: 96, column: 16, scope: !404)
!410 = !DILocation(line: 96, column: 4, scope: !404)
!411 = !DILocation(line: 98, column: 31, scope: !404)
!412 = !DILocation(line: 98, column: 22, scope: !404)
!413 = !DILocation(line: 98, column: 4, scope: !404)
!414 = !DILocation(line: 100, column: 2, scope: !390)
