; ModuleID = 'anagrams-2.ll'
source_filename = "anagrams-2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.kw_t = type { i8*, i8*, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [13 x i8] c"unixdict.txt\00", align 1
@.str.1 = private unnamed_addr constant [4 x i8] c"%s \00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @lst_cmp(i8* %a, i8* %b) #0 !dbg !20 {
entry:
  call void @llvm.dbg.value(metadata i8* %a, metadata !25, metadata !DIExpression()), !dbg !26
  call void @llvm.dbg.value(metadata i8* %b, metadata !27, metadata !DIExpression()), !dbg !26
  %0 = bitcast i8* %a to %struct.kw_t*, !dbg !28
  %key = getelementptr inbounds %struct.kw_t, %struct.kw_t* %0, i32 0, i32 0, !dbg !29
  %1 = load i8*, i8** %key, align 8, !dbg !29
  %2 = bitcast i8* %b to %struct.kw_t*, !dbg !30
  %key1 = getelementptr inbounds %struct.kw_t, %struct.kw_t* %2, i32 0, i32 0, !dbg !31
  %3 = load i8*, i8** %key1, align 8, !dbg !31
  %call = call i32 @strcmp(i8* %1, i8* %3) #6, !dbg !32
  ret i32 %call, !dbg !33
}

; Function Attrs: nounwind readnone speculatable willreturn

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "anagrams-2.c", directory: "/scratch/yc0769/xstack_benchmark/rosetta/Anagrams-2")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "kw_t", file: !1, line: 9, baseType: !7)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 9, size: 192, elements: !8)
!8 = !{!9, !13, !14}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !7, file: !1, line: 9, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !7, file: !1, line: 9, baseType: !10, size: 64, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "cnt", scope: !7, file: !1, line: 9, baseType: !15, size: 32, offset: 128)
!15 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!16 = !{i32 7, !"Dwarf Version", i32 4}
!17 = !{i32 2, !"Debug Info Version", i32 3}
!18 = !{i32 1, !"wchar_size", i32 4}
!19 = !{!"clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!20 = distinct !DISubprogram(name: "lst_cmp", scope: !1, file: !1, line: 11, type: !21, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!21 = !DISubroutineType(types: !22)
!22 = !{!15, !23, !23}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!25 = !DILocalVariable(name: "a", arg: 1, scope: !20, file: !1, line: 11, type: !23)
!26 = !DILocation(line: 0, scope: !20)
!27 = !DILocalVariable(name: "b", arg: 2, scope: !20, file: !1, line: 11, type: !23)
!28 = !DILocation(line: 13, column: 17, scope: !20)
!29 = !DILocation(line: 13, column: 34, scope: !20)
!30 = !DILocation(line: 13, column: 40, scope: !20)
!31 = !DILocation(line: 13, column: 57, scope: !20)
!32 = !DILocation(line: 13, column: 9, scope: !20)
!33 = !DILocation(line: 13, column: 2, scope: !20)
!34 = distinct !DISubprogram(name: "sort_letters", scope: !1, file: !1, line: 17, type: !35, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !37}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!38 = !DILocalVariable(name: "s", arg: 1, scope: !34, file: !1, line: 17, type: !37)
!39 = !DILocation(line: 0, scope: !34)
!40 = !DILocalVariable(name: "i", scope: !34, file: !1, line: 19, type: !15)
!41 = !DILocation(line: 21, column: 7, scope: !42)
!42 = distinct !DILexicalBlock(scope: !34, file: !1, line: 21, column: 2)
!43 = !DILocation(line: 0, scope: !42)
!44 = !DILocation(line: 21, column: 14, scope: !45)
!45 = distinct !DILexicalBlock(scope: !42, file: !1, line: 21, column: 2)
!46 = !DILocation(line: 21, column: 19, scope: !45)
!47 = !DILocation(line: 21, column: 2, scope: !42)
!48 = !DILocation(line: 22, column: 14, scope: !49)
!49 = distinct !DILexicalBlock(scope: !50, file: !1, line: 22, column: 3)
!50 = distinct !DILexicalBlock(scope: !45, file: !1, line: 21, column: 33)
!51 = !DILocalVariable(name: "j", scope: !34, file: !1, line: 19, type: !15)
!52 = !DILocation(line: 22, column: 8, scope: !49)
!53 = !DILocation(line: 0, scope: !49)
!54 = !DILocation(line: 22, column: 19, scope: !55)
!55 = distinct !DILexicalBlock(scope: !49, file: !1, line: 22, column: 3)
!56 = !DILocation(line: 22, column: 24, scope: !55)
!57 = !DILocation(line: 22, column: 3, scope: !49)
!58 = !DILocation(line: 23, column: 8, scope: !59)
!59 = distinct !DILexicalBlock(scope: !55, file: !1, line: 23, column: 8)
!60 = !DILocation(line: 23, column: 15, scope: !59)
!61 = !DILocation(line: 23, column: 13, scope: !59)
!62 = !DILocation(line: 23, column: 8, scope: !55)
!63 = !DILocation(line: 24, column: 9, scope: !64)
!64 = distinct !DILexicalBlock(scope: !59, file: !1, line: 23, column: 21)
!65 = !DILocalVariable(name: "t", scope: !34, file: !1, line: 20, type: !12)
!66 = !DILocation(line: 24, column: 22, scope: !64)
!67 = !DILocation(line: 24, column: 15, scope: !64)
!68 = !DILocation(line: 24, column: 20, scope: !64)
!69 = !DILocation(line: 24, column: 28, scope: !64)
!70 = !DILocation(line: 24, column: 33, scope: !64)
!71 = !DILocation(line: 25, column: 4, scope: !64)
!72 = !DILocation(line: 23, column: 18, scope: !59)
!73 = !DILocation(line: 22, column: 34, scope: !55)
!74 = !DILocation(line: 22, column: 3, scope: !55)
!75 = distinct !{!75, !57, !76}
!76 = !DILocation(line: 25, column: 4, scope: !49)
!77 = !DILocation(line: 26, column: 2, scope: !50)
!78 = !DILocation(line: 21, column: 29, scope: !45)
!79 = !DILocation(line: 21, column: 2, scope: !45)
!80 = distinct !{!80, !47, !81}
!81 = !DILocation(line: 26, column: 2, scope: !42)
!82 = !DILocation(line: 27, column: 1, scope: !34)
!83 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 29, type: !84, scopeLine: 30, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!84 = !DISubroutineType(types: !85)
!85 = !{!15}
!86 = !DILocalVariable(name: "s", scope: !83, file: !1, line: 31, type: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !88, line: 46, size: 1152, elements: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!89 = !{!90, !94, !96, !98, !101, !103, !105, !106, !107, !110, !112, !114, !122, !123, !124}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !87, file: !88, line: 48, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !92, line: 145, baseType: !93)
!92 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!93 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !87, file: !88, line: 53, baseType: !95, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !92, line: 148, baseType: !93)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !87, file: !88, line: 61, baseType: !97, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !92, line: 151, baseType: !93)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !87, file: !88, line: 62, baseType: !99, size: 32, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !92, line: 150, baseType: !100)
!100 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !87, file: !88, line: 64, baseType: !102, size: 32, offset: 224)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !92, line: 146, baseType: !100)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !87, file: !88, line: 65, baseType: !104, size: 32, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !92, line: 147, baseType: !100)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !87, file: !88, line: 67, baseType: !15, size: 32, offset: 288)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !87, file: !88, line: 69, baseType: !91, size: 64, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !87, file: !88, line: 74, baseType: !108, size: 64, offset: 384)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !92, line: 152, baseType: !109)
!109 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !87, file: !88, line: 78, baseType: !111, size: 64, offset: 448)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !92, line: 174, baseType: !109)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !87, file: !88, line: 80, baseType: !113, size: 64, offset: 512)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !92, line: 179, baseType: !109)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !87, file: !88, line: 91, baseType: !115, size: 128, offset: 576)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !116, line: 10, size: 128, elements: !117)
!116 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!117 = !{!118, !120}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !115, file: !116, line: 12, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !92, line: 160, baseType: !109)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !115, file: !116, line: 16, baseType: !121, size: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !92, line: 196, baseType: !109)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !87, file: !88, line: 92, baseType: !115, size: 128, offset: 704)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !87, file: !88, line: 93, baseType: !115, size: 128, offset: 832)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !87, file: !88, line: 106, baseType: !125, size: 192, offset: 960)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 192, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 3)
!128 = !DILocation(line: 31, column: 14, scope: !83)
!129 = !DILocalVariable(name: "n_word", scope: !83, file: !1, line: 34, type: !15)
!130 = !DILocation(line: 0, scope: !83)
!131 = !DILocation(line: 37, column: 11, scope: !83)
!132 = !DILocalVariable(name: "fd", scope: !83, file: !1, line: 37, type: !15)
!133 = !DILocation(line: 38, column: 9, scope: !134)
!134 = distinct !DILexicalBlock(scope: !83, file: !1, line: 38, column: 6)
!135 = !DILocation(line: 38, column: 6, scope: !83)
!136 = !DILocation(line: 38, column: 16, scope: !134)
!137 = !DILocation(line: 39, column: 2, scope: !83)
!138 = !DILocation(line: 40, column: 19, scope: !83)
!139 = !DILocation(line: 40, column: 27, scope: !83)
!140 = !DILocation(line: 40, column: 10, scope: !83)
!141 = !DILocalVariable(name: "words", scope: !83, file: !1, line: 32, type: !37)
!142 = !DILocation(line: 41, column: 20, scope: !83)
!143 = !DILocation(line: 41, column: 16, scope: !83)
!144 = !DILocalVariable(name: "keys", scope: !83, file: !1, line: 32, type: !37)
!145 = !DILocation(line: 43, column: 20, scope: !83)
!146 = !DILocation(line: 43, column: 2, scope: !83)
!147 = !DILocation(line: 44, column: 24, scope: !83)
!148 = !DILocation(line: 44, column: 2, scope: !83)
!149 = !DILocalVariable(name: "j", scope: !83, file: !1, line: 33, type: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !151, line: 46, baseType: !93)
!151 = !DIFile(filename: "/u/NAS_SCRATCH/yc0769/xstack/xstack-installs/llvm-install-debug/lib/clang/10.0.1/include/stddef.h", directory: "")
!152 = !DILocalVariable(name: "i", scope: !83, file: !1, line: 33, type: !150)
!153 = !DILocation(line: 47, column: 7, scope: !154)
!154 = distinct !DILexicalBlock(scope: !83, file: !1, line: 47, column: 2)
!155 = !DILocation(line: 0, scope: !154)
!156 = !DILocation(line: 47, column: 24, scope: !157)
!157 = distinct !DILexicalBlock(scope: !154, file: !1, line: 47, column: 2)
!158 = !DILocation(line: 47, column: 20, scope: !157)
!159 = !DILocation(line: 47, column: 2, scope: !154)
!160 = !DILocation(line: 48, column: 7, scope: !161)
!161 = distinct !DILexicalBlock(scope: !162, file: !1, line: 48, column: 7)
!162 = distinct !DILexicalBlock(scope: !157, file: !1, line: 47, column: 38)
!163 = !DILocation(line: 48, column: 16, scope: !161)
!164 = !DILocation(line: 48, column: 7, scope: !162)
!165 = !DILocation(line: 49, column: 15, scope: !166)
!166 = distinct !DILexicalBlock(scope: !161, file: !1, line: 48, column: 25)
!167 = !DILocation(line: 49, column: 23, scope: !166)
!168 = !DILocation(line: 49, column: 4, scope: !166)
!169 = !DILocation(line: 49, column: 13, scope: !166)
!170 = !DILocation(line: 50, column: 22, scope: !166)
!171 = !DILocation(line: 50, column: 4, scope: !166)
!172 = !DILocation(line: 51, column: 10, scope: !166)
!173 = !DILocation(line: 52, column: 11, scope: !166)
!174 = !DILocation(line: 53, column: 3, scope: !166)
!175 = !DILocation(line: 54, column: 2, scope: !162)
!176 = !DILocation(line: 47, column: 34, scope: !157)
!177 = !DILocation(line: 47, column: 2, scope: !157)
!178 = distinct !{!178, !159, !179}
!179 = !DILocation(line: 54, column: 2, scope: !154)
!180 = !DILocation(line: 56, column: 16, scope: !83)
!181 = !DILocation(line: 56, column: 9, scope: !83)
!182 = !DILocalVariable(name: "list", scope: !83, file: !1, line: 35, type: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!184 = !DILocalVariable(name: "k", scope: !83, file: !1, line: 33, type: !150)
!185 = !DILocation(line: 59, column: 7, scope: !186)
!186 = distinct !DILexicalBlock(scope: !83, file: !1, line: 59, column: 2)
!187 = !DILocation(line: 0, scope: !186)
!188 = !DILocation(line: 59, column: 28, scope: !189)
