; ModuleID = 'anagrams-2.ll'
source_filename = "anagrams-2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.kw_t = type { i8*, i8*, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [13 x i8] c"unixdict.txt\00", align 1
@.str.1 = private unnamed_addr constant [4 x i8] c"%s \00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @lst_cmp(i8* %a, i8* %b) #0 !dbg !20 {
entry:
  %a.addr = alloca i8*, align 8
  %b.addr = alloca i8*, align 8
  store i8* %a, i8** %a.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %a.addr, metadata !25, metadata !DIExpression()), !dbg !26
  store i8* %b, i8** %b.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %b.addr, metadata !27, metadata !DIExpression()), !dbg !28
  %0 = load i8*, i8** %a.addr, align 8, !dbg !29
  %1 = bitcast i8* %0 to %struct.kw_t*, !dbg !30
  %key = getelementptr inbounds %struct.kw_t, %struct.kw_t* %1, i32 0, i32 0, !dbg !31
  %2 = load i8*, i8** %key, align 8, !dbg !31
  %3 = load i8*, i8** %b.addr, align 8, !dbg !32
  %4 = bitcast i8* %3 to %struct.kw_t*, !dbg !33

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "anagrams-2.c", directory: "/scratch/yc0769/xstack_benchmark/rosetta/Anagrams-2")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "kw_t", file: !1, line: 9, baseType: !7)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 9, size: 192, elements: !8)
!8 = !{!9, !13, !14}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !7, file: !1, line: 9, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !7, file: !1, line: 9, baseType: !10, size: 64, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "cnt", scope: !7, file: !1, line: 9, baseType: !15, size: 32, offset: 128)
!15 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!16 = !{i32 7, !"Dwarf Version", i32 4}
!17 = !{i32 2, !"Debug Info Version", i32 3}
!18 = !{i32 1, !"wchar_size", i32 4}
!19 = !{!"clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!20 = distinct !DISubprogram(name: "lst_cmp", scope: !1, file: !1, line: 11, type: !21, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!21 = !DISubroutineType(types: !22)
!22 = !{!15, !23, !23}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!25 = !DILocalVariable(name: "a", arg: 1, scope: !20, file: !1, line: 11, type: !23)
!26 = !DILocation(line: 11, column: 25, scope: !20)
!27 = !DILocalVariable(name: "b", arg: 2, scope: !20, file: !1, line: 11, type: !23)
!28 = !DILocation(line: 11, column: 40, scope: !20)
!29 = !DILocation(line: 13, column: 30, scope: !20)
!30 = !DILocation(line: 13, column: 17, scope: !20)
!31 = !DILocation(line: 13, column: 34, scope: !20)
!32 = !DILocation(line: 13, column: 53, scope: !20)
!33 = !DILocation(line: 13, column: 40, scope: !20)
!34 = !DILocation(line: 13, column: 57, scope: !20)
!35 = !DILocation(line: 13, column: 9, scope: !20)
!36 = !DILocation(line: 13, column: 2, scope: !20)
!37 = distinct !DISubprogram(name: "sort_letters", scope: !1, file: !1, line: 17, type: !38, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!38 = !DISubroutineType(types: !39)
!39 = !{null, !40}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!41 = !DILocalVariable(name: "s", arg: 1, scope: !37, file: !1, line: 17, type: !40)
!42 = !DILocation(line: 17, column: 25, scope: !37)
!43 = !DILocalVariable(name: "i", scope: !37, file: !1, line: 19, type: !15)
!44 = !DILocation(line: 19, column: 6, scope: !37)
!45 = !DILocalVariable(name: "j", scope: !37, file: !1, line: 19, type: !15)
!46 = !DILocation(line: 19, column: 9, scope: !37)
!47 = !DILocalVariable(name: "t", scope: !37, file: !1, line: 20, type: !12)
!48 = !DILocation(line: 20, column: 7, scope: !37)
!49 = !DILocation(line: 21, column: 9, scope: !50)
!50 = distinct !DILexicalBlock(scope: !37, file: !1, line: 21, column: 2)
!51 = !DILocation(line: 21, column: 7, scope: !50)
!52 = !DILocation(line: 21, column: 14, scope: !53)
!53 = distinct !DILexicalBlock(scope: !50, file: !1, line: 21, column: 2)
!54 = !DILocation(line: 21, column: 16, scope: !53)
!55 = !DILocation(line: 21, column: 19, scope: !53)
!56 = !DILocation(line: 21, column: 2, scope: !50)
!57 = !DILocation(line: 22, column: 12, scope: !58)
!58 = distinct !DILexicalBlock(scope: !59, file: !1, line: 22, column: 3)
!59 = distinct !DILexicalBlock(scope: !53, file: !1, line: 21, column: 33)
!60 = !DILocation(line: 22, column: 14, scope: !58)
!61 = !DILocation(line: 22, column: 10, scope: !58)
!62 = !DILocation(line: 22, column: 8, scope: !58)
!63 = !DILocation(line: 22, column: 19, scope: !64)
!64 = distinct !DILexicalBlock(scope: !58, file: !1, line: 22, column: 3)
!65 = !DILocation(line: 22, column: 21, scope: !64)
!66 = !DILocation(line: 22, column: 24, scope: !64)
!67 = !DILocation(line: 22, column: 3, scope: !58)
!68 = !DILocation(line: 23, column: 8, scope: !69)
!69 = distinct !DILexicalBlock(scope: !64, file: !1, line: 23, column: 8)
!70 = !DILocation(line: 23, column: 10, scope: !69)
!71 = !DILocation(line: 23, column: 15, scope: !69)
!72 = !DILocation(line: 23, column: 17, scope: !69)
!73 = !DILocation(line: 23, column: 13, scope: !69)
!74 = !DILocation(line: 23, column: 8, scope: !64)
!75 = !DILocation(line: 24, column: 9, scope: !76)
!76 = distinct !DILexicalBlock(scope: !69, file: !1, line: 23, column: 21)
!77 = !DILocation(line: 24, column: 11, scope: !76)
!78 = !DILocation(line: 24, column: 7, scope: !76)
!79 = !DILocation(line: 24, column: 22, scope: !76)
!80 = !DILocation(line: 24, column: 24, scope: !76)
!81 = !DILocation(line: 24, column: 15, scope: !76)
!82 = !DILocation(line: 24, column: 17, scope: !76)
!83 = !DILocation(line: 24, column: 20, scope: !76)
!84 = !DILocation(line: 24, column: 35, scope: !76)
!85 = !DILocation(line: 24, column: 28, scope: !76)
!86 = !DILocation(line: 24, column: 30, scope: !76)
!87 = !DILocation(line: 24, column: 33, scope: !76)
!88 = !DILocation(line: 25, column: 4, scope: !76)
!89 = !DILocation(line: 23, column: 18, scope: !69)
!90 = !DILocation(line: 22, column: 34, scope: !64)
!91 = !DILocation(line: 22, column: 3, scope: !64)
!92 = distinct !{!92, !67, !93}
!93 = !DILocation(line: 25, column: 4, scope: !58)
!94 = !DILocation(line: 26, column: 2, scope: !59)
!95 = !DILocation(line: 21, column: 29, scope: !53)
!96 = !DILocation(line: 21, column: 2, scope: !53)
!97 = distinct !{!97, !56, !98}
!98 = !DILocation(line: 26, column: 2, scope: !50)
!99 = !DILocation(line: 27, column: 1, scope: !37)
!100 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 29, type: !101, scopeLine: 30, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!101 = !DISubroutineType(types: !102)
!102 = !{!15}
!103 = !DILocalVariable(name: "s", scope: !100, file: !1, line: 31, type: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !105, line: 46, size: 1152, elements: !106)
!105 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!106 = !{!107, !111, !113, !115, !118, !120, !122, !123, !124, !127, !129, !131, !139, !140, !141}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !104, file: !105, line: 48, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !109, line: 145, baseType: !110)
!109 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!110 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !104, file: !105, line: 53, baseType: !112, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !109, line: 148, baseType: !110)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !104, file: !105, line: 61, baseType: !114, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !109, line: 151, baseType: !110)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !104, file: !105, line: 62, baseType: !116, size: 32, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !109, line: 150, baseType: !117)
!117 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !104, file: !105, line: 64, baseType: !119, size: 32, offset: 224)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !109, line: 146, baseType: !117)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !104, file: !105, line: 65, baseType: !121, size: 32, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !109, line: 147, baseType: !117)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !104, file: !105, line: 67, baseType: !15, size: 32, offset: 288)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !104, file: !105, line: 69, baseType: !108, size: 64, offset: 320)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !104, file: !105, line: 74, baseType: !125, size: 64, offset: 384)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !109, line: 152, baseType: !126)
!126 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !104, file: !105, line: 78, baseType: !128, size: 64, offset: 448)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !109, line: 174, baseType: !126)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !104, file: !105, line: 80, baseType: !130, size: 64, offset: 512)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !109, line: 179, baseType: !126)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !104, file: !105, line: 91, baseType: !132, size: 128, offset: 576)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !133, line: 10, size: 128, elements: !134)
!133 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!134 = !{!135, !137}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !132, file: !133, line: 12, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !109, line: 160, baseType: !126)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !132, file: !133, line: 16, baseType: !138, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !109, line: 196, baseType: !126)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !104, file: !105, line: 92, baseType: !132, size: 128, offset: 704)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !104, file: !105, line: 93, baseType: !132, size: 128, offset: 832)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !104, file: !105, line: 106, baseType: !142, size: 192, offset: 960)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 192, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 3)
!145 = !DILocation(line: 31, column: 14, scope: !100)
!146 = !DILocalVariable(name: "words", scope: !100, file: !1, line: 32, type: !40)
!147 = !DILocation(line: 32, column: 8, scope: !100)
!148 = !DILocalVariable(name: "keys", scope: !100, file: !1, line: 32, type: !40)
!149 = !DILocation(line: 32, column: 16, scope: !100)
!150 = !DILocalVariable(name: "i", scope: !100, file: !1, line: 33, type: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !152, line: 46, baseType: !110)
!152 = !DIFile(filename: "/u/NAS_SCRATCH/yc0769/xstack/xstack-installs/llvm-install-debug/lib/clang/10.0.1/include/stddef.h", directory: "")
!153 = !DILocation(line: 33, column: 9, scope: !100)
!154 = !DILocalVariable(name: "j", scope: !100, file: !1, line: 33, type: !151)
!155 = !DILocation(line: 33, column: 12, scope: !100)
!156 = !DILocalVariable(name: "k", scope: !100, file: !1, line: 33, type: !151)
!157 = !DILocation(line: 33, column: 15, scope: !100)
!158 = !DILocalVariable(name: "longest", scope: !100, file: !1, line: 33, type: !151)
!159 = !DILocation(line: 33, column: 18, scope: !100)
!160 = !DILocalVariable(name: "offset", scope: !100, file: !1, line: 33, type: !151)
!161 = !DILocation(line: 33, column: 27, scope: !100)
!162 = !DILocalVariable(name: "n_word", scope: !100, file: !1, line: 34, type: !15)
!163 = !DILocation(line: 34, column: 6, scope: !100)
!164 = !DILocalVariable(name: "list", scope: !100, file: !1, line: 35, type: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!166 = !DILocation(line: 35, column: 8, scope: !100)
!167 = !DILocalVariable(name: "fd", scope: !100, file: !1, line: 37, type: !15)
!168 = !DILocation(line: 37, column: 6, scope: !100)
!169 = !DILocation(line: 37, column: 11, scope: !100)
!170 = !DILocation(line: 38, column: 6, scope: !171)
!171 = distinct !DILexicalBlock(scope: !100, file: !1, line: 38, column: 6)
!172 = !DILocation(line: 38, column: 9, scope: !171)
!173 = !DILocation(line: 38, column: 6, scope: !100)
!174 = !DILocation(line: 38, column: 16, scope: !171)
!175 = !DILocation(line: 39, column: 8, scope: !100)
!176 = !DILocation(line: 39, column: 2, scope: !100)
!177 = !DILocation(line: 40, column: 19, scope: !100)
!178 = !DILocation(line: 40, column: 27, scope: !100)
!179 = !DILocation(line: 40, column: 10, scope: !100)
!180 = !DILocation(line: 40, column: 8, scope: !100)
!181 = !DILocation(line: 41, column: 10, scope: !100)
!182 = !DILocation(line: 41, column: 20, scope: !100)
!183 = !DILocation(line: 41, column: 16, scope: !100)
!184 = !DILocation(line: 41, column: 8, scope: !100)
!185 = !DILocation(line: 43, column: 7, scope: !100)
!186 = !DILocation(line: 43, column: 11, scope: !100)
!187 = !DILocation(line: 43, column: 20, scope: !100)
!188 = !DILocation(line: 43, column: 2, scope: !100)
!189 = !DILocation(line: 44, column: 9, scope: !100)
!190 = !DILocation(line: 44, column: 15, scope: !100)
!191 = !DILocation(line: 44, column: 24, scope: !100)
!192 = !DILocation(line: 44, column: 2, scope: !100)
!193 = !DILocation(line: 47, column: 13, scope: !194)
!194 = distinct !DILexicalBlock(scope: !100, file: !1, line: 47, column: 2)
!195 = !DILocation(line: 47, column: 9, scope: !194)
!196 = !DILocation(line: 47, column: 7, scope: !194)
!197 = !DILocation(line: 47, column: 18, scope: !198)
!198 = distinct !DILexicalBlock(scope: !194, file: !1, line: 47, column: 2)
!199 = !DILocation(line: 47, column: 24, scope: !198)
!200 = !DILocation(line: 47, column: 20, scope: !198)
!201 = !DILocation(line: 47, column: 2, scope: !194)
!202 = !DILocation(line: 48, column: 7, scope: !203)
!203 = distinct !DILexicalBlock(scope: !204, file: !1, line: 48, column: 7)
