; ModuleID = 'canny-edge-detector.ll'
source_filename = "canny-edge-detector.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.bmpfile_magic_t = type { [2 x i8] }
%struct.bitmap_info_header_t = type { i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32 }
%struct.bmpfile_header_t = type { i32, i16, i16, i32 }
%struct.rgb_t = type { i8, i8, i8, i8 }

@.str = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str.1 = private unnamed_addr constant [8 x i8] c"fopen()\00", align 1
@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str.2 = private unnamed_addr constant [28 x i8] c"Not a BMP file: magic=%c%c\0A\00", align 1
@.str.3 = private unnamed_addr constant [40 x i8] c"Warning, compression is not supported.\0A\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"wb\00", align 1
@__const.save_bmp.mag = private unnamed_addr constant %struct.bmpfile_magic_t { [2 x i8] c"BM" }, align 1
@.str.5 = private unnamed_addr constant [12 x i8] c"kn % 2 == 1\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ih", scope: !2, file: !3, line: 429, type: !32, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 422, type: !4, scopeLine: 423, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !14)
!3 = !DIFile(filename: "canny-edge-detector.c", directory: "/scratch/yc0769/xstack_benchmark/rosetta/Canny-edge-detector")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7, !8}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!8 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !14, retainedTypes: !15, globals: !31, splitDebugInlining: false, nameTableKind: None)
!14 = !{}
!15 = !{!16, !17, !23, !25, !27, !6, !28, !29, !30}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !19, line: 25, baseType: !20)
!19 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !21, line: 40, baseType: !22)
!21 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!22 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "pixel_t", file: !3, line: 63, baseType: !24)
!24 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !19, line: 24, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !21, line: 38, baseType: !27)
!27 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!28 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!31 = !{!0}
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_info_header_t", file: !3, line: 52, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 40, size: 320, elements: !34)
!34 = !{!35, !39, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "header_sz", scope: !33, file: !3, line: 41, baseType: !36, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !19, line: 26, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !21, line: 42, baseType: !38)
!38 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !33, file: !3, line: 42, baseType: !40, size: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !41, line: 26, baseType: !42)
!41 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !21, line: 41, baseType: !6)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !33, file: !3, line: 43, baseType: !40, size: 32, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "nplanes", scope: !33, file: !3, line: 44, baseType: !18, size: 16, offset: 96)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "bitspp", scope: !33, file: !3, line: 45, baseType: !18, size: 16, offset: 112)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "compress_type", scope: !33, file: !3, line: 46, baseType: !36, size: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "bmp_bytesz", scope: !33, file: !3, line: 47, baseType: !36, size: 32, offset: 160)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "hres", scope: !33, file: !3, line: 48, baseType: !40, size: 32, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "vres", scope: !33, file: !3, line: 49, baseType: !40, size: 32, offset: 224)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !33, file: !3, line: 50, baseType: !36, size: 32, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "nimpcolors", scope: !33, file: !3, line: 51, baseType: !36, size: 32, offset: 288)
!52 = !{i32 7, !"Dwarf Version", i32 4}
!53 = !{i32 2, !"Debug Info Version", i32 3}
!54 = !{i32 1, !"wchar_size", i32 4}
!55 = !{!"clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!56 = distinct !DISubprogram(name: "load_bmp", scope: !3, file: !3, line: 65, type: !57, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !14)
!57 = !DISubroutineType(types: !58)
!58 = !{!30, !10, !59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!60 = !DILocalVariable(name: "filename", arg: 1, scope: !56, file: !3, line: 65, type: !10)
!61 = !DILocation(line: 65, column: 31, scope: !56)
!62 = !DILocalVariable(name: "bitmapInfoHeader", arg: 2, scope: !56, file: !3, line: 66, type: !59)
!63 = !DILocation(line: 66, column: 41, scope: !56)
!64 = !DILocalVariable(name: "filePtr", scope: !56, file: !3, line: 68, type: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !67, line: 7, baseType: !68)
!67 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !69, line: 49, size: 1728, elements: !70)
!69 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!70 = !{!71, !72, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !87, !89, !90, !91, !94, !95, !97, !101, !104, !106, !109, !112, !113, !114, !118, !119}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !68, file: !69, line: 51, baseType: !6, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !68, file: !69, line: 54, baseType: !73, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !68, file: !69, line: 55, baseType: !73, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !68, file: !69, line: 56, baseType: !73, size: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !68, file: !69, line: 57, baseType: !73, size: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !68, file: !69, line: 58, baseType: !73, size: 64, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !68, file: !69, line: 59, baseType: !73, size: 64, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !68, file: !69, line: 60, baseType: !73, size: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !68, file: !69, line: 61, baseType: !73, size: 64, offset: 512)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !68, file: !69, line: 64, baseType: !73, size: 64, offset: 576)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !68, file: !69, line: 65, baseType: !73, size: 64, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !68, file: !69, line: 66, baseType: !73, size: 64, offset: 704)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !68, file: !69, line: 68, baseType: !85, size: 64, offset: 768)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !69, line: 36, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !68, file: !69, line: 70, baseType: !88, size: 64, offset: 832)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !68, file: !69, line: 72, baseType: !6, size: 32, offset: 896)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !68, file: !69, line: 73, baseType: !6, size: 32, offset: 928)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !68, file: !69, line: 74, baseType: !92, size: 64, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !21, line: 152, baseType: !93)
!93 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !68, file: !69, line: 77, baseType: !22, size: 16, offset: 1024)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !68, file: !69, line: 78, baseType: !96, size: 8, offset: 1040)
!96 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !68, file: !69, line: 79, baseType: !98, size: 8, offset: 1048)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 1)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !68, file: !69, line: 81, baseType: !102, size: 64, offset: 1088)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !69, line: 43, baseType: null)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !68, file: !69, line: 89, baseType: !105, size: 64, offset: 1152)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !21, line: 153, baseType: !93)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !68, file: !69, line: 91, baseType: !107, size: 64, offset: 1216)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !69, line: 37, flags: DIFlagFwdDecl)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !68, file: !69, line: 92, baseType: !110, size: 64, offset: 1280)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !69, line: 38, flags: DIFlagFwdDecl)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !68, file: !69, line: 93, baseType: !88, size: 64, offset: 1344)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !68, file: !69, line: 94, baseType: !16, size: 64, offset: 1408)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !68, file: !69, line: 95, baseType: !115, size: 64, offset: 1472)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !116, line: 46, baseType: !117)
!116 = !DIFile(filename: "/u/NAS_SCRATCH/yc0769/xstack/xstack-installs/llvm-install-debug/lib/clang/10.0.1/include/stddef.h", directory: "")
!117 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !68, file: !69, line: 96, baseType: !6, size: 32, offset: 1536)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !68, file: !69, line: 98, baseType: !120, size: 160, offset: 1568)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 20)
!123 = !DILocation(line: 68, column: 11, scope: !56)
!124 = !DILocation(line: 68, column: 27, scope: !56)
!125 = !DILocation(line: 68, column: 21, scope: !56)
!126 = !DILocation(line: 69, column: 9, scope: !127)
!127 = distinct !DILexicalBlock(scope: !56, file: !3, line: 69, column: 9)
!128 = !DILocation(line: 69, column: 17, scope: !127)
!129 = !DILocation(line: 69, column: 9, scope: !56)
!130 = !DILocation(line: 70, column: 9, scope: !131)
!131 = distinct !DILexicalBlock(scope: !127, file: !3, line: 69, column: 26)
!132 = !DILocation(line: 71, column: 9, scope: !131)
!133 = !DILocalVariable(name: "mag", scope: !56, file: !3, line: 74, type: !134)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "bmpfile_magic_t", file: !3, line: 31, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 29, size: 16, elements: !136)
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !135, file: !3, line: 30, baseType: !138, size: 16)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 16, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 2)
!141 = !DILocation(line: 74, column: 21, scope: !56)
!142 = !DILocation(line: 75, column: 15, scope: !143)
!143 = distinct !DILexicalBlock(scope: !56, file: !3, line: 75, column: 9)
!144 = !DILocation(line: 75, column: 49, scope: !143)
!145 = !DILocation(line: 75, column: 9, scope: !143)
!146 = !DILocation(line: 75, column: 58, scope: !143)
!147 = !DILocation(line: 75, column: 9, scope: !56)
!148 = !DILocation(line: 76, column: 16, scope: !149)
!149 = distinct !DILexicalBlock(scope: !143, file: !3, line: 75, column: 64)
!150 = !DILocation(line: 76, column: 9, scope: !149)
!151 = !DILocation(line: 77, column: 9, scope: !149)
!152 = !DILocation(line: 83, column: 26, scope: !153)
!153 = distinct !DILexicalBlock(scope: !56, file: !3, line: 83, column: 9)
!154 = !DILocation(line: 83, column: 9, scope: !153)
!155 = !DILocation(line: 83, column: 33, scope: !153)
!156 = !DILocation(line: 83, column: 9, scope: !56)
!157 = !DILocation(line: 84, column: 17, scope: !158)
!158 = distinct !DILexicalBlock(scope: !153, file: !3, line: 83, column: 44)
!159 = !DILocation(line: 85, column: 21, scope: !158)
!160 = !DILocation(line: 85, column: 17, scope: !158)
!161 = !DILocation(line: 85, column: 35, scope: !158)
!162 = !DILocation(line: 85, column: 31, scope: !158)
!163 = !DILocation(line: 84, column: 9, scope: !158)
!164 = !DILocation(line: 86, column: 16, scope: !158)
!165 = !DILocation(line: 86, column: 9, scope: !158)
!166 = !DILocation(line: 87, column: 9, scope: !158)
!167 = !DILocalVariable(name: "bitmapFileHeader", scope: !56, file: !3, line: 90, type: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "bmpfile_header_t", file: !3, line: 38, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 33, size: 96, elements: !170)
!170 = !{!171, !172, !173, !174}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "filesz", scope: !169, file: !3, line: 34, baseType: !36, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "creator1", scope: !169, file: !3, line: 35, baseType: !18, size: 16, offset: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "creator2", scope: !169, file: !3, line: 36, baseType: !18, size: 16, offset: 48)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "bmp_offset", scope: !169, file: !3, line: 37, baseType: !36, size: 32, offset: 64)
!175 = !DILocation(line: 90, column: 22, scope: !56)
!176 = !DILocation(line: 92, column: 15, scope: !177)
!177 = distinct !DILexicalBlock(scope: !56, file: !3, line: 92, column: 9)
!178 = !DILocation(line: 93, column: 18, scope: !177)
!179 = !DILocation(line: 92, column: 9, scope: !177)
!180 = !DILocation(line: 93, column: 27, scope: !177)
!181 = !DILocation(line: 92, column: 9, scope: !56)
!182 = !DILocation(line: 94, column: 16, scope: !183)
!183 = distinct !DILexicalBlock(scope: !177, file: !3, line: 93, column: 33)
!184 = !DILocation(line: 94, column: 9, scope: !183)
!185 = !DILocation(line: 95, column: 9, scope: !183)
!186 = !DILocation(line: 99, column: 15, scope: !187)
!187 = distinct !DILexicalBlock(scope: !56, file: !3, line: 99, column: 9)
!188 = !DILocation(line: 100, column: 18, scope: !187)
!189 = !DILocation(line: 99, column: 9, scope: !187)
!190 = !DILocation(line: 100, column: 27, scope: !187)
!191 = !DILocation(line: 99, column: 9, scope: !56)
!192 = !DILocation(line: 101, column: 16, scope: !193)
!193 = distinct !DILexicalBlock(scope: !187, file: !3, line: 100, column: 33)
!194 = !DILocation(line: 101, column: 9, scope: !193)
!195 = !DILocation(line: 102, column: 9, scope: !193)
!196 = !DILocation(line: 105, column: 9, scope: !197)
!197 = distinct !DILexicalBlock(scope: !56, file: !3, line: 105, column: 9)
!198 = !DILocation(line: 105, column: 27, scope: !197)
!199 = !DILocation(line: 105, column: 41, scope: !197)
!200 = !DILocation(line: 105, column: 9, scope: !56)
!201 = !DILocation(line: 106, column: 17, scope: !197)
!202 = !DILocation(line: 106, column: 9, scope: !197)
!203 = !DILocation(line: 109, column: 15, scope: !204)
!204 = distinct !DILexicalBlock(scope: !56, file: !3, line: 109, column: 9)
!205 = !DILocation(line: 109, column: 41, scope: !204)
!206 = !DILocation(line: 109, column: 24, scope: !204)
!207 = !DILocation(line: 109, column: 9, scope: !204)
!208 = !DILocation(line: 109, column: 9, scope: !56)
!209 = !DILocation(line: 110, column: 16, scope: !210)
!210 = distinct !DILexicalBlock(scope: !204, file: !3, line: 109, column: 64)
!211 = !DILocation(line: 110, column: 9, scope: !210)
!212 = !DILocation(line: 111, column: 9, scope: !210)
!213 = !DILocalVariable(name: "bitmapImage", scope: !56, file: !3, line: 115, type: !30)
!214 = !DILocation(line: 115, column: 14, scope: !56)
!215 = !DILocation(line: 115, column: 35, scope: !56)
!216 = !DILocation(line: 115, column: 53, scope: !56)
!217 = !DILocation(line: 115, column: 64, scope: !56)
!218 = !DILocation(line: 115, column: 28, scope: !56)
!219 = !DILocation(line: 119, column: 9, scope: !220)
!220 = distinct !DILexicalBlock(scope: !56, file: !3, line: 119, column: 9)
!221 = !DILocation(line: 119, column: 21, scope: !220)
!222 = !DILocation(line: 119, column: 9, scope: !56)
!223 = !DILocation(line: 120, column: 16, scope: !224)
!224 = distinct !DILexicalBlock(scope: !220, file: !3, line: 119, column: 30)
!225 = !DILocation(line: 120, column: 9, scope: !224)
!226 = !DILocation(line: 121, column: 9, scope: !224)
!227 = !DILocalVariable(name: "pad", scope: !56, file: !3, line: 125, type: !115)
!228 = !DILocation(line: 125, column: 12, scope: !56)
!229 = !DILocalVariable(name: "count", scope: !56, file: !3, line: 125, type: !115)
!230 = !DILocation(line: 125, column: 17, scope: !56)
!231 = !DILocalVariable(name: "c", scope: !56, file: !3, line: 126, type: !27)
!232 = !DILocation(line: 126, column: 19, scope: !56)
!233 = !DILocation(line: 127, column: 18, scope: !56)
!234 = !DILocation(line: 127, column: 36, scope: !56)
!235 = !DILocation(line: 127, column: 43, scope: !56)
!236 = !DILocation(line: 127, column: 61, scope: !56)
!237 = !DILocation(line: 127, column: 42, scope: !56)
!238 = !DILocation(line: 127, column: 66, scope: !56)
!239 = !DILocation(line: 127, column: 13, scope: !56)
!240 = !DILocation(line: 127, column: 12, scope: !56)
!241 = !DILocation(line: 127, column: 74, scope: !56)
!242 = !DILocation(line: 127, column: 92, scope: !56)
!243 = !DILocation(line: 127, column: 72, scope: !56)
!244 = !DILocation(line: 127, column: 11, scope: !56)
!245 = !DILocation(line: 127, column: 9, scope: !56)
!246 = !DILocalVariable(name: "i", scope: !247, file: !3, line: 128, type: !115)
!247 = distinct !DILexicalBlock(scope: !56, file: !3, line: 128, column: 5)
!248 = !DILocation(line: 128, column: 16, scope: !247)
!249 = !DILocation(line: 128, column: 9, scope: !247)
!250 = !DILocation(line: 128, column: 21, scope: !251)
!251 = distinct !DILexicalBlock(scope: !247, file: !3, line: 128, column: 5)
!252 = !DILocation(line: 128, column: 23, scope: !251)
!253 = !DILocation(line: 128, column: 41, scope: !251)
!254 = !DILocation(line: 128, column: 22, scope: !251)
!255 = !DILocation(line: 128, column: 5, scope: !247)
!256 = !DILocalVariable(name: "j", scope: !257, file: !3, line: 129, type: !115)
!257 = distinct !DILexicalBlock(scope: !258, file: !3, line: 129, column: 6)
!258 = distinct !DILexicalBlock(scope: !251, file: !3, line: 128, column: 53)
!259 = !DILocation(line: 129, column: 17, scope: !257)
!260 = !DILocation(line: 129, column: 10, scope: !257)
!261 = !DILocation(line: 129, column: 22, scope: !262)
!262 = distinct !DILexicalBlock(scope: !257, file: !3, line: 129, column: 6)
!263 = !DILocation(line: 129, column: 24, scope: !262)
!264 = !DILocation(line: 129, column: 42, scope: !262)
!265 = !DILocation(line: 129, column: 23, scope: !262)
!266 = !DILocation(line: 129, column: 6, scope: !257)
!267 = !DILocation(line: 130, column: 47, scope: !268)
!268 = distinct !DILexicalBlock(scope: !269, file: !3, line: 130, column: 11)
!269 = distinct !DILexicalBlock(scope: !262, file: !3, line: 129, column: 53)
!270 = !DILocation(line: 130, column: 11, scope: !268)
!271 = !DILocation(line: 130, column: 56, scope: !268)
!272 = !DILocation(line: 130, column: 11, scope: !269)
!273 = !DILocation(line: 131, column: 15, scope: !274)
!274 = distinct !DILexicalBlock(scope: !268, file: !3, line: 130, column: 62)
!275 = !DILocation(line: 131, column: 8, scope: !274)
!276 = !DILocation(line: 132, column: 8, scope: !274)
!277 = !DILocation(line: 134, column: 40, scope: !269)
!278 = !DILocation(line: 134, column: 30, scope: !269)
!279 = !DILocation(line: 134, column: 7, scope: !269)
!280 = !DILocation(line: 134, column: 24, scope: !269)
!281 = !DILocation(line: 134, column: 28, scope: !269)
!282 = !DILocation(line: 135, column: 6, scope: !269)
!283 = !DILocation(line: 129, column: 50, scope: !262)
!284 = !DILocation(line: 129, column: 6, scope: !262)
!285 = distinct !{!285, !266, !286}
!286 = !DILocation(line: 135, column: 6, scope: !257)
!287 = !DILocation(line: 136, column: 12, scope: !258)
!288 = !DILocation(line: 136, column: 21, scope: !258)
!289 = !DILocation(line: 136, column: 6, scope: !258)
!290 = !DILocation(line: 137, column: 5, scope: !258)
!291 = !DILocation(line: 128, column: 50, scope: !251)
!292 = !DILocation(line: 128, column: 5, scope: !251)
!293 = distinct !{!293, !255, !294}
!294 = !DILocation(line: 137, column: 5, scope: !247)
!295 = !DILocation(line: 143, column: 12, scope: !56)
!296 = !DILocation(line: 143, column: 5, scope: !56)
!297 = !DILocation(line: 144, column: 12, scope: !56)
!298 = !DILocation(line: 144, column: 5, scope: !56)
!299 = !DILocation(line: 145, column: 1, scope: !56)
!300 = distinct !DISubprogram(name: "save_bmp", scope: !3, file: !3, line: 148, type: !301, scopeLine: 150, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !14)
!301 = !DISubroutineType(types: !302)
!302 = !{!303, !10, !304, !306}
!303 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!308 = !DILocalVariable(name: "filename", arg: 1, scope: !300, file: !3, line: 148, type: !10)
!309 = !DILocation(line: 148, column: 27, scope: !300)
!310 = !DILocalVariable(name: "bmp_ih", arg: 2, scope: !300, file: !3, line: 148, type: !304)
!311 = !DILocation(line: 148, column: 65, scope: !300)
!312 = !DILocalVariable(name: "data", arg: 3, scope: !300, file: !3, line: 149, type: !306)
!313 = !DILocation(line: 149, column: 30, scope: !300)
!314 = !DILocalVariable(name: "filePtr", scope: !300, file: !3, line: 151, type: !65)
!315 = !DILocation(line: 151, column: 11, scope: !300)
!316 = !DILocation(line: 151, column: 27, scope: !300)
!317 = !DILocation(line: 151, column: 21, scope: !300)
!318 = !DILocation(line: 152, column: 9, scope: !319)
!319 = distinct !DILexicalBlock(scope: !300, file: !3, line: 152, column: 9)
!320 = !DILocation(line: 152, column: 17, scope: !319)
!321 = !DILocation(line: 152, column: 9, scope: !300)
!322 = !DILocation(line: 153, column: 9, scope: !319)
!323 = !DILocalVariable(name: "mag", scope: !300, file: !3, line: 155, type: !134)
!324 = !DILocation(line: 155, column: 21, scope: !300)
!325 = !DILocation(line: 156, column: 16, scope: !326)
!326 = distinct !DILexicalBlock(scope: !300, file: !3, line: 156, column: 9)
!327 = !DILocation(line: 156, column: 50, scope: !326)
!328 = !DILocation(line: 156, column: 9, scope: !326)
!329 = !DILocation(line: 156, column: 59, scope: !326)
!330 = !DILocation(line: 156, column: 9, scope: !300)
!331 = !DILocation(line: 157, column: 16, scope: !332)
!332 = distinct !DILexicalBlock(scope: !326, file: !3, line: 156, column: 65)
!333 = !DILocation(line: 157, column: 9, scope: !332)
!334 = !DILocation(line: 158, column: 9, scope: !332)
!335 = !DILocalVariable(name: "offset", scope: !300, file: !3, line: 161, type: !336)
!336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!337 = !DILocation(line: 161, column: 20, scope: !300)
!338 = !DILocation(line: 164, column: 37, scope: !300)
!339 = !DILocation(line: 164, column: 45, scope: !300)
!340 = !DILocation(line: 164, column: 34, scope: !300)
!341 = !DILocation(line: 164, column: 53, scope: !300)
!342 = !DILocation(line: 164, column: 29, scope: !300)
!343 = !DILocation(line: 163, column: 58, scope: !300)
!344 = !DILocation(line: 161, column: 29, scope: !300)
!345 = !DILocalVariable(name: "bmp_fh", scope: !300, file: !3, line: 166, type: !346)
!346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!347 = !DILocation(line: 166, column: 28, scope: !300)
!348 = !DILocation(line: 166, column: 37, scope: !300)
!349 = !DILocation(line: 167, column: 19, scope: !300)
!350 = !DILocation(line: 167, column: 28, scope: !300)
!351 = !DILocation(line: 167, column: 36, scope: !300)
!352 = !DILocation(line: 167, column: 26, scope: !300)
!353 = !DILocation(line: 170, column: 23, scope: !300)
!354 = !DILocation(line: 173, column: 16, scope: !355)
!355 = distinct !DILexicalBlock(scope: !300, file: !3, line: 173, column: 9)
!356 = !DILocation(line: 173, column: 54, scope: !355)
!357 = !DILocation(line: 173, column: 9, scope: !355)
!358 = !DILocation(line: 173, column: 63, scope: !355)
!359 = !DILocation(line: 173, column: 9, scope: !300)
!360 = !DILocation(line: 174, column: 16, scope: !361)
!361 = distinct !DILexicalBlock(scope: !355, file: !3, line: 173, column: 69)
!362 = !DILocation(line: 174, column: 9, scope: !361)
!363 = !DILocation(line: 175, column: 9, scope: !361)
!364 = !DILocation(line: 177, column: 16, scope: !365)
!365 = distinct !DILexicalBlock(scope: !300, file: !3, line: 177, column: 9)
!366 = !DILocation(line: 177, column: 57, scope: !365)
!367 = !DILocation(line: 177, column: 9, scope: !365)
!368 = !DILocation(line: 177, column: 66, scope: !365)
!369 = !DILocation(line: 177, column: 9, scope: !300)
!370 = !DILocation(line: 178, column: 16, scope: !371)
!371 = distinct !DILexicalBlock(scope: !365, file: !3, line: 177, column: 72)
!372 = !DILocation(line: 178, column: 9, scope: !371)
!373 = !DILocation(line: 179, column: 9, scope: !371)
!374 = !DILocalVariable(name: "i", scope: !375, file: !3, line: 183, type: !115)
!375 = distinct !DILexicalBlock(scope: !300, file: !3, line: 183, column: 5)
!376 = !DILocation(line: 183, column: 17, scope: !375)
!377 = !DILocation(line: 183, column: 10, scope: !375)
!378 = !DILocation(line: 183, column: 24, scope: !379)
!379 = distinct !DILexicalBlock(scope: !375, file: !3, line: 183, column: 5)
!380 = !DILocation(line: 183, column: 35, scope: !379)
!381 = !DILocation(line: 183, column: 43, scope: !379)
!382 = !DILocation(line: 183, column: 32, scope: !379)
!383 = !DILocation(line: 183, column: 28, scope: !379)
!384 = !DILocation(line: 183, column: 26, scope: !379)
!385 = !DILocation(line: 183, column: 5, scope: !375)
!386 = !DILocalVariable(name: "color", scope: !387, file: !3, line: 184, type: !388)
!387 = distinct !DILexicalBlock(scope: !379, file: !3, line: 183, column: 57)
!388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "rgb_t", file: !3, line: 59, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 54, size: 32, elements: !391)
!391 = !{!392, !393, !394, !395}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !390, file: !3, line: 55, baseType: !25, size: 8)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !390, file: !3, line: 56, baseType: !25, size: 8, offset: 8)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !390, file: !3, line: 57, baseType: !25, size: 8, offset: 16)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "nothing", scope: !390, file: !3, line: 58, baseType: !25, size: 8, offset: 24)
!396 = !DILocation(line: 184, column: 21, scope: !387)
!397 = !DILocation(line: 184, column: 29, scope: !387)
!398 = !DILocation(line: 184, column: 39, scope: !387)
!399 = !DILocation(line: 184, column: 30, scope: !387)
!400 = !DILocation(line: 184, column: 51, scope: !387)
!401 = !DILocation(line: 184, column: 42, scope: !387)
!402 = !DILocation(line: 184, column: 63, scope: !387)
!403 = !DILocation(line: 184, column: 54, scope: !387)
!404 = !DILocation(line: 185, column: 20, scope: !405)
!405 = distinct !DILexicalBlock(scope: !387, file: !3, line: 185, column: 13)
!406 = !DILocation(line: 185, column: 46, scope: !405)
!407 = !DILocation(line: 185, column: 13, scope: !405)
!408 = !DILocation(line: 185, column: 55, scope: !405)
!409 = !DILocation(line: 185, column: 13, scope: !387)
!410 = !DILocation(line: 186, column: 20, scope: !411)
!411 = distinct !DILexicalBlock(scope: !405, file: !3, line: 185, column: 61)
!412 = !DILocation(line: 186, column: 13, scope: !411)
!413 = !DILocation(line: 187, column: 13, scope: !411)
!414 = !DILocation(line: 189, column: 5, scope: !387)
!415 = !DILocation(line: 183, column: 53, scope: !379)
!416 = !DILocation(line: 183, column: 5, scope: !379)
!417 = distinct !{!417, !385, !418}
!418 = !DILocation(line: 189, column: 5, scope: !375)
!419 = !DILocalVariable(name: "pad", scope: !300, file: !3, line: 196, type: !115)
!420 = !DILocation(line: 196, column: 12, scope: !300)
!421 = !DILocation(line: 196, column: 25, scope: !300)
!422 = !DILocation(line: 196, column: 33, scope: !300)
!423 = !DILocation(line: 196, column: 40, scope: !300)
!424 = !DILocation(line: 196, column: 48, scope: !300)
!425 = !DILocation(line: 196, column: 39, scope: !300)
!426 = !DILocation(line: 196, column: 53, scope: !300)
!427 = !DILocation(line: 196, column: 20, scope: !300)
!428 = !DILocation(line: 196, column: 19, scope: !300)
!429 = !DILocation(line: 196, column: 61, scope: !300)
!430 = !DILocation(line: 196, column: 69, scope: !300)
!431 = !DILocation(line: 196, column: 59, scope: !300)
!432 = !DILocation(line: 196, column: 18, scope: !300)
!433 = !DILocalVariable(name: "c", scope: !300, file: !3, line: 197, type: !27)
!434 = !DILocation(line: 197, column: 19, scope: !300)
!435 = !DILocalVariable(name: "i", scope: !436, file: !3, line: 198, type: !115)
!436 = distinct !DILexicalBlock(scope: !300, file: !3, line: 198, column: 5)
!437 = !DILocation(line: 198, column: 16, scope: !436)
!438 = !DILocation(line: 198, column: 9, scope: !436)
!439 = !DILocation(line: 198, column: 21, scope: !440)
!440 = distinct !DILexicalBlock(scope: !436, file: !3, line: 198, column: 5)
!441 = !DILocation(line: 198, column: 25, scope: !440)
!442 = !DILocation(line: 198, column: 33, scope: !440)
!443 = !DILocation(line: 198, column: 23, scope: !440)
!444 = !DILocation(line: 198, column: 5, scope: !436)
!445 = !DILocalVariable(name: "j", scope: !446, file: !3, line: 199, type: !115)
!446 = distinct !DILexicalBlock(scope: !447, file: !3, line: 199, column: 6)
!447 = distinct !DILexicalBlock(scope: !440, file: !3, line: 198, column: 46)
!448 = !DILocation(line: 199, column: 17, scope: !446)
!449 = !DILocation(line: 199, column: 10, scope: !446)
!450 = !DILocation(line: 199, column: 22, scope: !451)
!451 = distinct !DILexicalBlock(scope: !446, file: !3, line: 199, column: 6)
!452 = !DILocation(line: 199, column: 26, scope: !451)
!453 = !DILocation(line: 199, column: 34, scope: !451)
!454 = !DILocation(line: 199, column: 24, scope: !451)
!455 = !DILocation(line: 199, column: 6, scope: !446)
!456 = !DILocation(line: 200, column: 27, scope: !457)
!457 = distinct !DILexicalBlock(scope: !451, file: !3, line: 199, column: 46)
!458 = !DILocation(line: 200, column: 32, scope: !457)
!459 = !DILocation(line: 200, column: 36, scope: !457)
!460 = !DILocation(line: 200, column: 44, scope: !457)
!461 = !DILocation(line: 200, column: 50, scope: !457)
