; ModuleID = 'canny-edge-detector.c'
source_filename = "canny-edge-detector.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.bmpfile_magic_t = type { [2 x i8] }
%struct.bitmap_info_header_t = type { i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32 }
%struct.bmpfile_header_t = type { i32, i16, i16, i32 }
%struct.rgb_t = type { i8, i8, i8, i8 }

@.str = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str.1 = private unnamed_addr constant [8 x i8] c"fopen()\00", align 1
@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str.2 = private unnamed_addr constant [28 x i8] c"Not a BMP file: magic=%c%c\0A\00", align 1
@.str.3 = private unnamed_addr constant [40 x i8] c"Warning, compression is not supported.\0A\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"wb\00", align 1
@__const.save_bmp.mag = private unnamed_addr constant %struct.bmpfile_magic_t { [2 x i8] c"BM" }, align 1
@.str.5 = private unnamed_addr constant [12 x i8] c"kn % 2 == 1\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ih", scope: !2, file: !3, line: 429, type: !32, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 422, type: !4, scopeLine: 423, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !14)
!3 = !DIFile(filename: "canny-edge-detector.c", directory: "/scratch/yc0769/xstack_benchmark/rosetta/Canny-edge-detector")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7, !8}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!8 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git 078de928eea94413164fbdff5fab7bdcf0f60aa7)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !14, retainedTypes: !15, globals: !31, splitDebugInlining: false, nameTableKind: None)
!14 = !{}
!15 = !{!16, !17, !23, !25, !27, !6, !28, !29, !30}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !19, line: 25, baseType: !20)
!19 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !21, line: 40, baseType: !22)
!21 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!22 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "pixel_t", file: !3, line: 63, baseType: !24)
!24 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !19, line: 24, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !21, line: 38, baseType: !27)
!27 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!28 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!31 = !{!0}
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_info_header_t", file: !3, line: 52, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 40, size: 320, elements: !34)
!34 = !{!35, !39, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "header_sz", scope: !33, file: !3, line: 41, baseType: !36, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !19, line: 26, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !21, line: 42, baseType: !38)
!38 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !33, file: !3, line: 42, baseType: !40, size: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !41, line: 26, baseType: !42)
!41 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !21, line: 41, baseType: !6)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !33, file: !3, line: 43, baseType: !40, size: 32, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "nplanes", scope: !33, file: !3, line: 44, baseType: !18, size: 16, offset: 96)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "bitspp", scope: !33, file: !3, line: 45, baseType: !18, size: 16, offset: 112)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "compress_type", scope: !33, file: !3, line: 46, baseType: !36, size: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "bmp_bytesz", scope: !33, file: !3, line: 47, baseType: !36, size: 32, offset: 160)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "hres", scope: !33, file: !3, line: 48, baseType: !40, size: 32, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "vres", scope: !33, file: !3, line: 49, baseType: !40, size: 32, offset: 224)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !33, file: !3, line: 50, baseType: !36, size: 32, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "nimpcolors", scope: !33, file: !3, line: 51, baseType: !36, size: 32, offset: 288)
!52 = !{i32 7, !"Dwarf Version", i32 4}
!53 = !{i32 2, !"Debug Info Version", i32 3}
!54 = !{i32 1, !"wchar_size", i32 4}
!55 = !{!"clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git 078de928eea94413164fbdff5fab7bdcf0f60aa7)"}
!56 = distinct !DISubprogram(name: "load_bmp", scope: !3, file: !3, line: 65, type: !57, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !14)
!57 = !DISubroutineType(types: !58)
!58 = !{!30, !10, !59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!60 = !DILocalVariable(name: "filename", arg: 1, scope: !56, file: !3, line: 65, type: !10)
!61 = !DILocation(line: 65, column: 31, scope: !56)
!62 = !DILocalVariable(name: "bitmapInfoHeader", arg: 2, scope: !56, file: !3, line: 66, type: !59)
!63 = !DILocation(line: 66, column: 41, scope: !56)
!64 = !DILocalVariable(name: "filePtr", scope: !56, file: !3, line: 68, type: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !67, line: 7, baseType: !68)
!67 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !69, line: 49, size: 1728, elements: !70)
!69 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!70 = !{!71, !72, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !87, !89, !90, !91, !94, !95, !97, !101, !104, !106, !109, !112, !113, !114, !118, !119}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !68, file: !69, line: 51, baseType: !6, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !68, file: !69, line: 54, baseType: !73, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !68, file: !69, line: 55, baseType: !73, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !68, file: !69, line: 56, baseType: !73, size: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !68, file: !69, line: 57, baseType: !73, size: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !68, file: !69, line: 58, baseType: !73, size: 64, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !68, file: !69, line: 59, baseType: !73, size: 64, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !68, file: !69, line: 60, baseType: !73, size: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !68, file: !69, line: 61, baseType: !73, size: 64, offset: 512)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !68, file: !69, line: 64, baseType: !73, size: 64, offset: 576)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !68, file: !69, line: 65, baseType: !73, size: 64, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !68, file: !69, line: 66, baseType: !73, size: 64, offset: 704)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !68, file: !69, line: 68, baseType: !85, size: 64, offset: 768)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !69, line: 36, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !68, file: !69, line: 70, baseType: !88, size: 64, offset: 832)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !68, file: !69, line: 72, baseType: !6, size: 32, offset: 896)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !68, file: !69, line: 73, baseType: !6, size: 32, offset: 928)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !68, file: !69, line: 74, baseType: !92, size: 64, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !21, line: 152, baseType: !93)
!93 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !68, file: !69, line: 77, baseType: !22, size: 16, offset: 1024)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !68, file: !69, line: 78, baseType: !96, size: 8, offset: 1040)
!96 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !68, file: !69, line: 79, baseType: !98, size: 8, offset: 1048)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 1)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !68, file: !69, line: 81, baseType: !102, size: 64, offset: 1088)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !69, line: 43, baseType: null)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !68, file: !69, line: 89, baseType: !105, size: 64, offset: 1152)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !21, line: 153, baseType: !93)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !68, file: !69, line: 91, baseType: !107, size: 64, offset: 1216)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !69, line: 37, flags: DIFlagFwdDecl)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !68, file: !69, line: 92, baseType: !110, size: 64, offset: 1280)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !69, line: 38, flags: DIFlagFwdDecl)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !68, file: !69, line: 93, baseType: !88, size: 64, offset: 1344)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !68, file: !69, line: 94, baseType: !16, size: 64, offset: 1408)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !68, file: !69, line: 95, baseType: !115, size: 64, offset: 1472)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !116, line: 46, baseType: !117)
!116 = !DIFile(filename: "/u/NAS_SCRATCH/yc0769/xstack/llvm-install/lib/clang/10.0.1/include/stddef.h", directory: "")
!117 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !68, file: !69, line: 96, baseType: !6, size: 32, offset: 1536)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !68, file: !69, line: 98, baseType: !120, size: 160, offset: 1568)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 20)
!123 = !DILocation(line: 68, column: 11, scope: !56)
!124 = !DILocation(line: 68, column: 27, scope: !56)
!125 = !DILocation(line: 68, column: 21, scope: !56)
!126 = !DILocation(line: 69, column: 9, scope: !127)
!127 = distinct !DILexicalBlock(scope: !56, file: !3, line: 69, column: 9)
!128 = !DILocation(line: 69, column: 17, scope: !127)
!129 = !DILocation(line: 69, column: 9, scope: !56)
!130 = !{!"if"}
!131 = !DILocation(line: 70, column: 9, scope: !132)
!132 = distinct !DILexicalBlock(scope: !127, file: !3, line: 69, column: 26)
!133 = !DILocation(line: 71, column: 9, scope: !132)
!134 = !DILocalVariable(name: "mag", scope: !56, file: !3, line: 74, type: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "bmpfile_magic_t", file: !3, line: 31, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 29, size: 16, elements: !137)
!137 = !{!138}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !136, file: !3, line: 30, baseType: !139, size: 16)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 16, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 2)
!142 = !DILocation(line: 74, column: 21, scope: !56)
!143 = !DILocation(line: 75, column: 15, scope: !144)
!144 = distinct !DILexicalBlock(scope: !56, file: !3, line: 75, column: 9)
!145 = !DILocation(line: 75, column: 49, scope: !144)
!146 = !DILocation(line: 75, column: 9, scope: !144)
!147 = !DILocation(line: 75, column: 58, scope: !144)
!148 = !DILocation(line: 75, column: 9, scope: !56)
!149 = !DILocation(line: 76, column: 16, scope: !150)
!150 = distinct !DILexicalBlock(scope: !144, file: !3, line: 75, column: 64)
!151 = !DILocation(line: 76, column: 9, scope: !150)
!152 = !DILocation(line: 77, column: 9, scope: !150)
!153 = !DILocation(line: 83, column: 26, scope: !154)
!154 = distinct !DILexicalBlock(scope: !56, file: !3, line: 83, column: 9)
!155 = !DILocation(line: 83, column: 9, scope: !154)
!156 = !DILocation(line: 83, column: 33, scope: !154)
!157 = !DILocation(line: 83, column: 9, scope: !56)
!158 = !DILocation(line: 84, column: 17, scope: !159)
!159 = distinct !DILexicalBlock(scope: !154, file: !3, line: 83, column: 44)
!160 = !DILocation(line: 85, column: 21, scope: !159)
!161 = !DILocation(line: 85, column: 17, scope: !159)
!162 = !DILocation(line: 85, column: 35, scope: !159)
!163 = !DILocation(line: 85, column: 31, scope: !159)
!164 = !DILocation(line: 84, column: 9, scope: !159)
!165 = !DILocation(line: 86, column: 16, scope: !159)
!166 = !DILocation(line: 86, column: 9, scope: !159)
!167 = !DILocation(line: 87, column: 9, scope: !159)
!168 = !DILocalVariable(name: "bitmapFileHeader", scope: !56, file: !3, line: 90, type: !169)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "bmpfile_header_t", file: !3, line: 38, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 33, size: 96, elements: !171)
!171 = !{!172, !173, !174, !175}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "filesz", scope: !170, file: !3, line: 34, baseType: !36, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "creator1", scope: !170, file: !3, line: 35, baseType: !18, size: 16, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "creator2", scope: !170, file: !3, line: 36, baseType: !18, size: 16, offset: 48)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "bmp_offset", scope: !170, file: !3, line: 37, baseType: !36, size: 32, offset: 64)
!176 = !DILocation(line: 90, column: 22, scope: !56)
!177 = !DILocation(line: 92, column: 15, scope: !178)
!178 = distinct !DILexicalBlock(scope: !56, file: !3, line: 92, column: 9)
!179 = !DILocation(line: 93, column: 18, scope: !178)
!180 = !DILocation(line: 92, column: 9, scope: !178)
!181 = !DILocation(line: 93, column: 27, scope: !178)
!182 = !DILocation(line: 92, column: 9, scope: !56)
!183 = !DILocation(line: 94, column: 16, scope: !184)
!184 = distinct !DILexicalBlock(scope: !178, file: !3, line: 93, column: 33)
!185 = !DILocation(line: 94, column: 9, scope: !184)
!186 = !DILocation(line: 95, column: 9, scope: !184)
!187 = !DILocation(line: 99, column: 15, scope: !188)
!188 = distinct !DILexicalBlock(scope: !56, file: !3, line: 99, column: 9)
!189 = !DILocation(line: 100, column: 18, scope: !188)
!190 = !DILocation(line: 99, column: 9, scope: !188)
!191 = !DILocation(line: 100, column: 27, scope: !188)
!192 = !DILocation(line: 99, column: 9, scope: !56)
!193 = !DILocation(line: 101, column: 16, scope: !194)
!194 = distinct !DILexicalBlock(scope: !188, file: !3, line: 100, column: 33)
!195 = !DILocation(line: 101, column: 9, scope: !194)
!196 = !DILocation(line: 102, column: 9, scope: !194)
!197 = !DILocation(line: 105, column: 9, scope: !198)
!198 = distinct !DILexicalBlock(scope: !56, file: !3, line: 105, column: 9)
!199 = !DILocation(line: 105, column: 27, scope: !198)
!200 = !DILocation(line: 105, column: 41, scope: !198)
!201 = !DILocation(line: 105, column: 9, scope: !56)
!202 = !DILocation(line: 106, column: 17, scope: !198)
!203 = !DILocation(line: 106, column: 9, scope: !198)
!204 = !DILocation(line: 109, column: 15, scope: !205)
!205 = distinct !DILexicalBlock(scope: !56, file: !3, line: 109, column: 9)
!206 = !DILocation(line: 109, column: 41, scope: !205)
!207 = !DILocation(line: 109, column: 24, scope: !205)
!208 = !DILocation(line: 109, column: 9, scope: !205)
!209 = !DILocation(line: 109, column: 9, scope: !56)
!210 = !DILocation(line: 110, column: 16, scope: !211)
!211 = distinct !DILexicalBlock(scope: !205, file: !3, line: 109, column: 64)
!212 = !DILocation(line: 110, column: 9, scope: !211)
!213 = !DILocation(line: 111, column: 9, scope: !211)
!214 = !DILocalVariable(name: "bitmapImage", scope: !56, file: !3, line: 115, type: !30)
!215 = !DILocation(line: 115, column: 14, scope: !56)
!216 = !DILocation(line: 115, column: 35, scope: !56)
!217 = !DILocation(line: 115, column: 53, scope: !56)
!218 = !DILocation(line: 115, column: 64, scope: !56)
!219 = !DILocation(line: 115, column: 28, scope: !56)
!220 = !DILocation(line: 119, column: 9, scope: !221)
!221 = distinct !DILexicalBlock(scope: !56, file: !3, line: 119, column: 9)
!222 = !DILocation(line: 119, column: 21, scope: !221)
!223 = !DILocation(line: 119, column: 9, scope: !56)
!224 = !DILocation(line: 120, column: 16, scope: !225)
!225 = distinct !DILexicalBlock(scope: !221, file: !3, line: 119, column: 30)
!226 = !DILocation(line: 120, column: 9, scope: !225)
!227 = !DILocation(line: 121, column: 9, scope: !225)
!228 = !DILocalVariable(name: "pad", scope: !56, file: !3, line: 125, type: !115)
!229 = !DILocation(line: 125, column: 12, scope: !56)
!230 = !DILocalVariable(name: "count", scope: !56, file: !3, line: 125, type: !115)
!231 = !DILocation(line: 125, column: 17, scope: !56)
!232 = !DILocalVariable(name: "c", scope: !56, file: !3, line: 126, type: !27)
!233 = !DILocation(line: 126, column: 19, scope: !56)
!234 = !DILocation(line: 127, column: 18, scope: !56)
!235 = !DILocation(line: 127, column: 36, scope: !56)
!236 = !DILocation(line: 127, column: 43, scope: !56)
!237 = !DILocation(line: 127, column: 61, scope: !56)
!238 = !DILocation(line: 127, column: 42, scope: !56)
!239 = !DILocation(line: 127, column: 66, scope: !56)
!240 = !DILocation(line: 127, column: 13, scope: !56)
!241 = !DILocation(line: 127, column: 12, scope: !56)
!242 = !DILocation(line: 127, column: 74, scope: !56)
!243 = !DILocation(line: 127, column: 92, scope: !56)
!244 = !DILocation(line: 127, column: 72, scope: !56)
!245 = !DILocation(line: 127, column: 11, scope: !56)
!246 = !DILocation(line: 127, column: 9, scope: !56)
!247 = !DILocalVariable(name: "i", scope: !248, file: !3, line: 128, type: !115)
!248 = distinct !DILexicalBlock(scope: !56, file: !3, line: 128, column: 5)
!249 = !DILocation(line: 128, column: 16, scope: !248)
!250 = !DILocation(line: 128, column: 9, scope: !248)
!251 = !DILocation(line: 128, column: 21, scope: !252)
!252 = distinct !DILexicalBlock(scope: !248, file: !3, line: 128, column: 5)
!253 = !DILocation(line: 128, column: 23, scope: !252)
!254 = !DILocation(line: 128, column: 41, scope: !252)
!255 = !DILocation(line: 128, column: 22, scope: !252)
!256 = !DILocation(line: 128, column: 5, scope: !248)
!257 = !DILocalVariable(name: "j", scope: !258, file: !3, line: 129, type: !115)
!258 = distinct !DILexicalBlock(scope: !259, file: !3, line: 129, column: 6)
!259 = distinct !DILexicalBlock(scope: !252, file: !3, line: 128, column: 53)
!260 = !DILocation(line: 129, column: 17, scope: !258)
!261 = !DILocation(line: 129, column: 10, scope: !258)
!262 = !DILocation(line: 129, column: 22, scope: !263)
!263 = distinct !DILexicalBlock(scope: !258, file: !3, line: 129, column: 6)
!264 = !DILocation(line: 129, column: 24, scope: !263)
!265 = !DILocation(line: 129, column: 42, scope: !263)
!266 = !DILocation(line: 129, column: 23, scope: !263)
!267 = !DILocation(line: 129, column: 6, scope: !258)
!268 = !DILocation(line: 130, column: 47, scope: !269)
!269 = distinct !DILexicalBlock(scope: !270, file: !3, line: 130, column: 11)
!270 = distinct !DILexicalBlock(scope: !263, file: !3, line: 129, column: 53)
!271 = !DILocation(line: 130, column: 11, scope: !269)
!272 = !DILocation(line: 130, column: 56, scope: !269)
!273 = !DILocation(line: 130, column: 11, scope: !270)
!274 = !DILocation(line: 131, column: 15, scope: !275)
!275 = distinct !DILexicalBlock(scope: !269, file: !3, line: 130, column: 62)
!276 = !DILocation(line: 131, column: 8, scope: !275)
!277 = !DILocation(line: 132, column: 8, scope: !275)
!278 = !DILocation(line: 134, column: 40, scope: !270)
!279 = !DILocation(line: 134, column: 30, scope: !270)
!280 = !DILocation(line: 134, column: 7, scope: !270)
!281 = !DILocation(line: 134, column: 24, scope: !270)
!282 = !DILocation(line: 134, column: 28, scope: !270)
!283 = !DILocation(line: 135, column: 6, scope: !270)
!284 = !DILocation(line: 129, column: 50, scope: !263)
!285 = !DILocation(line: 129, column: 6, scope: !263)
!286 = distinct !{!286, !267, !287}
!287 = !DILocation(line: 135, column: 6, scope: !258)
!288 = !DILocation(line: 136, column: 12, scope: !259)
!289 = !DILocation(line: 136, column: 21, scope: !259)
!290 = !DILocation(line: 136, column: 6, scope: !259)
!291 = !DILocation(line: 137, column: 5, scope: !259)
!292 = !DILocation(line: 128, column: 50, scope: !252)
!293 = !DILocation(line: 128, column: 5, scope: !252)
!294 = distinct !{!294, !256, !295}
!295 = !DILocation(line: 137, column: 5, scope: !248)
!296 = !DILocation(line: 143, column: 12, scope: !56)
!297 = !DILocation(line: 143, column: 5, scope: !56)
!298 = !DILocation(line: 144, column: 12, scope: !56)
!299 = !DILocation(line: 144, column: 5, scope: !56)
!300 = !DILocation(line: 145, column: 1, scope: !56)
!301 = distinct !DISubprogram(name: "save_bmp", scope: !3, file: !3, line: 148, type: !302, scopeLine: 150, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !14)
!302 = !DISubroutineType(types: !303)
!303 = !{!304, !10, !305, !307}
!304 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!309 = !DILocalVariable(name: "filename", arg: 1, scope: !301, file: !3, line: 148, type: !10)
!310 = !DILocation(line: 148, column: 27, scope: !301)
!311 = !DILocalVariable(name: "bmp_ih", arg: 2, scope: !301, file: !3, line: 148, type: !305)
!312 = !DILocation(line: 148, column: 65, scope: !301)
!313 = !DILocalVariable(name: "data", arg: 3, scope: !301, file: !3, line: 149, type: !307)
!314 = !DILocation(line: 149, column: 30, scope: !301)
!315 = !DILocalVariable(name: "filePtr", scope: !301, file: !3, line: 151, type: !65)
!316 = !DILocation(line: 151, column: 11, scope: !301)
!317 = !DILocation(line: 151, column: 27, scope: !301)
!318 = !DILocation(line: 151, column: 21, scope: !301)
!319 = !DILocation(line: 152, column: 9, scope: !320)
!320 = distinct !DILexicalBlock(scope: !301, file: !3, line: 152, column: 9)
!321 = !DILocation(line: 152, column: 17, scope: !320)
!322 = !DILocation(line: 152, column: 9, scope: !301)
!323 = !DILocation(line: 153, column: 9, scope: !320)
!324 = !DILocalVariable(name: "mag", scope: !301, file: !3, line: 155, type: !135)
!325 = !DILocation(line: 155, column: 21, scope: !301)
!326 = !DILocation(line: 156, column: 16, scope: !327)
!327 = distinct !DILexicalBlock(scope: !301, file: !3, line: 156, column: 9)
!328 = !DILocation(line: 156, column: 50, scope: !327)
!329 = !DILocation(line: 156, column: 9, scope: !327)
!330 = !DILocation(line: 156, column: 59, scope: !327)
!331 = !DILocation(line: 156, column: 9, scope: !301)
!332 = !DILocation(line: 157, column: 16, scope: !333)
!333 = distinct !DILexicalBlock(scope: !327, file: !3, line: 156, column: 65)
!334 = !DILocation(line: 157, column: 9, scope: !333)
!335 = !DILocation(line: 158, column: 9, scope: !333)
!336 = !DILocalVariable(name: "offset", scope: !301, file: !3, line: 161, type: !337)
!337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!338 = !DILocation(line: 161, column: 20, scope: !301)
!339 = !DILocation(line: 164, column: 37, scope: !301)
!340 = !DILocation(line: 164, column: 45, scope: !301)
!341 = !DILocation(line: 164, column: 34, scope: !301)
!342 = !DILocation(line: 164, column: 53, scope: !301)
!343 = !DILocation(line: 164, column: 29, scope: !301)
!344 = !DILocation(line: 163, column: 58, scope: !301)
!345 = !DILocation(line: 161, column: 29, scope: !301)
!346 = !DILocalVariable(name: "bmp_fh", scope: !301, file: !3, line: 166, type: !347)
!347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!348 = !DILocation(line: 166, column: 28, scope: !301)
!349 = !DILocation(line: 166, column: 37, scope: !301)
!350 = !DILocation(line: 167, column: 19, scope: !301)
!351 = !DILocation(line: 167, column: 28, scope: !301)
!352 = !DILocation(line: 167, column: 36, scope: !301)
!353 = !DILocation(line: 167, column: 26, scope: !301)
!354 = !DILocation(line: 170, column: 23, scope: !301)
!355 = !DILocation(line: 173, column: 16, scope: !356)
!356 = distinct !DILexicalBlock(scope: !301, file: !3, line: 173, column: 9)
!357 = !DILocation(line: 173, column: 54, scope: !356)
!358 = !DILocation(line: 173, column: 9, scope: !356)
!359 = !DILocation(line: 173, column: 63, scope: !356)
!360 = !DILocation(line: 173, column: 9, scope: !301)
!361 = !DILocation(line: 174, column: 16, scope: !362)
!362 = distinct !DILexicalBlock(scope: !356, file: !3, line: 173, column: 69)
!363 = !DILocation(line: 174, column: 9, scope: !362)
!364 = !DILocation(line: 175, column: 9, scope: !362)
!365 = !DILocation(line: 177, column: 16, scope: !366)
!366 = distinct !DILexicalBlock(scope: !301, file: !3, line: 177, column: 9)
!367 = !DILocation(line: 177, column: 57, scope: !366)
!368 = !DILocation(line: 177, column: 9, scope: !366)
!369 = !DILocation(line: 177, column: 66, scope: !366)
!370 = !DILocation(line: 177, column: 9, scope: !301)
!371 = !DILocation(line: 178, column: 16, scope: !372)
!372 = distinct !DILexicalBlock(scope: !366, file: !3, line: 177, column: 72)
!373 = !DILocation(line: 178, column: 9, scope: !372)
!374 = !DILocation(line: 179, column: 9, scope: !372)
!375 = !DILocalVariable(name: "i", scope: !376, file: !3, line: 183, type: !115)
!376 = distinct !DILexicalBlock(scope: !301, file: !3, line: 183, column: 5)
!377 = !DILocation(line: 183, column: 17, scope: !376)
!378 = !DILocation(line: 183, column: 10, scope: !376)
!379 = !DILocation(line: 183, column: 24, scope: !380)
!380 = distinct !DILexicalBlock(scope: !376, file: !3, line: 183, column: 5)
!381 = !DILocation(line: 183, column: 35, scope: !380)
!382 = !DILocation(line: 183, column: 43, scope: !380)
!383 = !DILocation(line: 183, column: 32, scope: !380)
!384 = !DILocation(line: 183, column: 28, scope: !380)
!385 = !DILocation(line: 183, column: 26, scope: !380)
!386 = !DILocation(line: 183, column: 5, scope: !376)
!387 = !DILocalVariable(name: "color", scope: !388, file: !3, line: 184, type: !389)
!388 = distinct !DILexicalBlock(scope: !380, file: !3, line: 183, column: 57)
!389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "rgb_t", file: !3, line: 59, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 54, size: 32, elements: !392)
!392 = !{!393, !394, !395, !396}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !391, file: !3, line: 55, baseType: !25, size: 8)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !391, file: !3, line: 56, baseType: !25, size: 8, offset: 8)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !391, file: !3, line: 57, baseType: !25, size: 8, offset: 16)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "nothing", scope: !391, file: !3, line: 58, baseType: !25, size: 8, offset: 24)
!397 = !DILocation(line: 184, column: 21, scope: !388)
!398 = !DILocation(line: 184, column: 29, scope: !388)
!399 = !DILocation(line: 184, column: 39, scope: !388)
!400 = !DILocation(line: 184, column: 30, scope: !388)
!401 = !DILocation(line: 184, column: 51, scope: !388)
!402 = !DILocation(line: 184, column: 42, scope: !388)
!403 = !DILocation(line: 184, column: 63, scope: !388)
!404 = !DILocation(line: 184, column: 54, scope: !388)
!405 = !DILocation(line: 185, column: 20, scope: !406)
!406 = distinct !DILexicalBlock(scope: !388, file: !3, line: 185, column: 13)
!407 = !DILocation(line: 185, column: 46, scope: !406)
!408 = !DILocation(line: 185, column: 13, scope: !406)
!409 = !DILocation(line: 185, column: 55, scope: !406)
!410 = !DILocation(line: 185, column: 13, scope: !388)
!411 = !DILocation(line: 186, column: 20, scope: !412)
!412 = distinct !DILexicalBlock(scope: !406, file: !3, line: 185, column: 61)
!413 = !DILocation(line: 186, column: 13, scope: !412)
!414 = !DILocation(line: 187, column: 13, scope: !412)
!415 = !DILocation(line: 189, column: 5, scope: !388)
!416 = !DILocation(line: 183, column: 53, scope: !380)
!417 = !DILocation(line: 183, column: 5, scope: !380)
!418 = distinct !{!418, !386, !419}
!419 = !DILocation(line: 189, column: 5, scope: !376)
!420 = !DILocalVariable(name: "pad", scope: !301, file: !3, line: 196, type: !115)
!421 = !DILocation(line: 196, column: 12, scope: !301)
!422 = !DILocation(line: 196, column: 25, scope: !301)
!423 = !DILocation(line: 196, column: 33, scope: !301)
!424 = !DILocation(line: 196, column: 40, scope: !301)
!425 = !DILocation(line: 196, column: 48, scope: !301)
!426 = !DILocation(line: 196, column: 39, scope: !301)
!427 = !DILocation(line: 196, column: 53, scope: !301)
!428 = !DILocation(line: 196, column: 20, scope: !301)
!429 = !DILocation(line: 196, column: 19, scope: !301)
!430 = !DILocation(line: 196, column: 61, scope: !301)
!431 = !DILocation(line: 196, column: 69, scope: !301)
!432 = !DILocation(line: 196, column: 59, scope: !301)
!433 = !DILocation(line: 196, column: 18, scope: !301)
!434 = !DILocalVariable(name: "c", scope: !301, file: !3, line: 197, type: !27)
!435 = !DILocation(line: 197, column: 19, scope: !301)
!436 = !DILocalVariable(name: "i", scope: !437, file: !3, line: 198, type: !115)
!437 = distinct !DILexicalBlock(scope: !301, file: !3, line: 198, column: 5)
!438 = !DILocation(line: 198, column: 16, scope: !437)
!439 = !DILocation(line: 198, column: 9, scope: !437)
!440 = !DILocation(line: 198, column: 21, scope: !441)
!441 = distinct !DILexicalBlock(scope: !437, file: !3, line: 198, column: 5)
!442 = !DILocation(line: 198, column: 25, scope: !441)
!443 = !DILocation(line: 198, column: 33, scope: !441)
!444 = !DILocation(line: 198, column: 23, scope: !441)
!445 = !DILocation(line: 198, column: 5, scope: !437)
!446 = !DILocalVariable(name: "j", scope: !447, file: !3, line: 199, type: !115)
!447 = distinct !DILexicalBlock(scope: !448, file: !3, line: 199, column: 6)
!448 = distinct !DILexicalBlock(scope: !441, file: !3, line: 198, column: 46)
!449 = !DILocation(line: 199, column: 17, scope: !447)
!450 = !DILocation(line: 199, column: 10, scope: !447)
!451 = !DILocation(line: 199, column: 22, scope: !452)
!452 = distinct !DILexicalBlock(scope: !447, file: !3, line: 199, column: 6)
!453 = !DILocation(line: 199, column: 26, scope: !452)
!454 = !DILocation(line: 199, column: 34, scope: !452)
!455 = !DILocation(line: 199, column: 24, scope: !452)
!456 = !DILocation(line: 199, column: 6, scope: !447)
!457 = !DILocation(line: 200, column: 27, scope: !458)
!458 = distinct !DILexicalBlock(scope: !452, file: !3, line: 199, column: 46)
!459 = !DILocation(line: 200, column: 32, scope: !458)
!460 = !DILocation(line: 200, column: 36, scope: !458)
!461 = !DILocation(line: 200, column: 44, scope: !458)
!462 = !DILocation(line: 200, column: 50, scope: !458)
