; ModuleID = 'anagrams-deranged-anagrams.bc'
source_filename = "anagrams-deranged-anagrams.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.node = type { [10 x %union.node*] }
%struct.word = type { i8*, %struct.word* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [27 x i8] c"zqxjkvbpygfwmucldrhsnioate\00", align 1
@freq = dso_local global i8* getelementptr inbounds ([27 x i8], [27 x i8]* @.str, i32 0, i32 0), align 8, !dbg !0
@char_to_idx = common dso_local global [128 x i32] zeroinitializer, align 16, !dbg !8
@.str.1 = private unnamed_addr constant [13 x i8] c"unixdict.txt\00", align 1
@.str.2 = private unnamed_addr constant [28 x i8] c"longest derangement: %s %s\0A\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @deranged(i8* %s1, i8* %s2) #0 !dbg !21 {
entry:
  %retval = alloca i32, align 4
  %s1.addr = alloca i8*, align 8
  %s2.addr = alloca i8*, align 8
  %i = alloca i32, align 4
  store i8* %s1, i8** %s1.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %s1.addr, metadata !24, metadata !DIExpression()), !dbg !25
  store i8* %s2, i8** %s2.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %s2.addr, metadata !26, metadata !DIExpression()), !dbg !27

!18 = !{i32 2, !"Debug Info Version", i32 3}
!19 = !{i32 1, !"wchar_size", i32 4}
!20 = !{!"clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!21 = distinct !DISubprogram(name: "deranged", scope: !3, file: !3, line: 24, type: !22, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!22 = !DISubroutineType(types: !23)
!23 = !{!11, !14, !14}
!24 = !DILocalVariable(name: "s1", arg: 1, scope: !21, file: !3, line: 24, type: !14)
!25 = !DILocation(line: 24, column: 26, scope: !21)
!26 = !DILocalVariable(name: "s2", arg: 2, scope: !21, file: !3, line: 24, type: !14)
!27 = !DILocation(line: 24, column: 42, scope: !21)
!28 = !DILocalVariable(name: "i", scope: !21, file: !3, line: 26, type: !11)
!29 = !DILocation(line: 26, column: 6, scope: !21)
!30 = !DILocation(line: 27, column: 9, scope: !31)
!31 = distinct !DILexicalBlock(scope: !21, file: !3, line: 27, column: 2)
!32 = !DILocation(line: 27, column: 7, scope: !31)
!33 = !DILocation(line: 27, column: 14, scope: !34)
!34 = distinct !DILexicalBlock(scope: !31, file: !3, line: 27, column: 2)
!35 = !DILocation(line: 27, column: 17, scope: !34)
!36 = !DILocation(line: 27, column: 2, scope: !31)
!37 = !DILocation(line: 28, column: 7, scope: !38)
!38 = distinct !DILexicalBlock(scope: !34, file: !3, line: 28, column: 7)
!39 = !DILocation(line: 28, column: 10, scope: !38)
!40 = !DILocation(line: 28, column: 16, scope: !38)
!41 = !DILocation(line: 28, column: 19, scope: !38)
!42 = !DILocation(line: 28, column: 13, scope: !38)
!43 = !DILocation(line: 28, column: 7, scope: !34)
!44 = !DILocation(line: 28, column: 23, scope: !38)
!45 = !DILocation(line: 28, column: 20, scope: !38)
!46 = !DILocation(line: 27, column: 22, scope: !34)
!47 = !DILocation(line: 27, column: 2, scope: !34)
!48 = distinct !{!48, !36, !49}
!49 = !DILocation(line: 28, column: 30, scope: !31)
!50 = !DILocation(line: 29, column: 2, scope: !21)
!51 = !DILocation(line: 30, column: 1, scope: !21)
!52 = distinct !DISubprogram(name: "count_letters", scope: !3, file: !3, line: 32, type: !53, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!53 = !DISubroutineType(types: !54)
!54 = !{!11, !14, !55}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!56 = !DILocalVariable(name: "s", arg: 1, scope: !52, file: !3, line: 32, type: !14)
!57 = !DILocation(line: 32, column: 31, scope: !52)
!58 = !DILocalVariable(name: "c", arg: 2, scope: !52, file: !3, line: 32, type: !55)
!59 = !DILocation(line: 32, column: 49, scope: !52)
!60 = !DILocalVariable(name: "i", scope: !52, file: !3, line: 34, type: !11)
!61 = !DILocation(line: 34, column: 6, scope: !52)
!62 = !DILocalVariable(name: "len", scope: !52, file: !3, line: 34, type: !11)
!63 = !DILocation(line: 34, column: 9, scope: !52)
!64 = !DILocation(line: 35, column: 9, scope: !52)
!65 = !DILocation(line: 35, column: 2, scope: !52)
!66 = !DILocation(line: 36, column: 15, scope: !67)
!67 = distinct !DILexicalBlock(scope: !52, file: !3, line: 36, column: 2)
!68 = !DILocation(line: 36, column: 11, scope: !67)
!69 = !DILocation(line: 36, column: 7, scope: !67)
!70 = !DILocation(line: 36, column: 20, scope: !71)
!71 = distinct !DILexicalBlock(scope: !67, file: !3, line: 36, column: 2)
!72 = !DILocation(line: 36, column: 22, scope: !71)
!73 = !DILocation(line: 36, column: 2, scope: !67)
!74 = !DILocation(line: 37, column: 7, scope: !75)
!75 = distinct !DILexicalBlock(scope: !76, file: !3, line: 37, column: 7)
!76 = distinct !DILexicalBlock(scope: !71, file: !3, line: 36, column: 31)
!77 = !DILocation(line: 37, column: 9, scope: !75)
!78 = !DILocation(line: 37, column: 12, scope: !75)
!79 = !DILocation(line: 37, column: 18, scope: !75)
!80 = !DILocation(line: 37, column: 21, scope: !75)
!81 = !DILocation(line: 37, column: 23, scope: !75)
!82 = !DILocation(line: 37, column: 26, scope: !75)
!83 = !DILocation(line: 37, column: 7, scope: !76)
!84 = !DILocation(line: 38, column: 4, scope: !75)
!85 = !DILocation(line: 39, column: 6, scope: !76)
!86 = !DILocation(line: 39, column: 10, scope: !76)
!87 = !DILocation(line: 39, column: 39, scope: !76)
!88 = !DILocation(line: 39, column: 41, scope: !76)
!89 = !DILocation(line: 39, column: 12, scope: !76)
!90 = !DILocation(line: 39, column: 45, scope: !76)
!91 = !DILocation(line: 40, column: 2, scope: !76)
!92 = !DILocation(line: 36, column: 27, scope: !71)
!93 = !DILocation(line: 36, column: 2, scope: !71)
!94 = distinct !{!94, !73, !95}
!95 = !DILocation(line: 40, column: 2, scope: !67)
!96 = !DILocation(line: 41, column: 9, scope: !52)
!97 = !DILocation(line: 41, column: 2, scope: !52)
!98 = !DILocation(line: 42, column: 1, scope: !52)
!99 = distinct !DISubprogram(name: "insert", scope: !3, file: !3, line: 44, type: !100, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!100 = !DISubroutineType(types: !101)
!101 = !{!14, !102, !14, !55}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "node", file: !3, line: 19, size: 640, elements: !104)
!104 = !{!105, !109}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "down", scope: !103, file: !3, line: 20, baseType: !106, size: 640)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 640, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 10)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !103, file: !3, line: 21, baseType: !110, size: 640)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 640, elements: !107)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "word", file: !3, line: 14, size: 128, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !112, file: !3, line: 15, baseType: !14, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !112, file: !3, line: 16, baseType: !111, size: 64, offset: 64)
!116 = !DILocalVariable(name: "root", arg: 1, scope: !99, file: !3, line: 44, type: !102)
!117 = !DILocation(line: 44, column: 33, scope: !99)
!118 = !DILocalVariable(name: "s", arg: 2, scope: !99, file: !3, line: 44, type: !14)
!119 = !DILocation(line: 44, column: 51, scope: !99)
!120 = !DILocalVariable(name: "cnt", arg: 3, scope: !99, file: !3, line: 44, type: !55)
!121 = !DILocation(line: 44, column: 69, scope: !99)
!122 = !DILocalVariable(name: "i", scope: !99, file: !3, line: 46, type: !11)
!123 = !DILocation(line: 46, column: 6, scope: !99)
!124 = !DILocalVariable(name: "n", scope: !99, file: !3, line: 47, type: !102)
!125 = !DILocation(line: 47, column: 14, scope: !99)
!126 = !DILocalVariable(name: "v", scope: !99, file: !3, line: 48, type: !111)
!127 = !DILocation(line: 48, column: 15, scope: !99)
!128 = !DILocalVariable(name: "w", scope: !99, file: !3, line: 48, type: !111)
!129 = !DILocation(line: 48, column: 19, scope: !99)
!130 = !DILocation(line: 50, column: 9, scope: !131)
!131 = distinct !DILexicalBlock(scope: !99, file: !3, line: 50, column: 2)
!132 = !DILocation(line: 50, column: 7, scope: !131)
!133 = !DILocation(line: 50, column: 14, scope: !134)
!134 = distinct !DILexicalBlock(scope: !131, file: !3, line: 50, column: 2)
!135 = !DILocation(line: 50, column: 16, scope: !134)
!136 = !DILocation(line: 50, column: 2, scope: !131)
!137 = !DILocation(line: 51, column: 13, scope: !138)
!138 = distinct !DILexicalBlock(scope: !139, file: !3, line: 51, column: 7)
!139 = distinct !DILexicalBlock(scope: !134, file: !3, line: 50, column: 37)
!140 = !DILocation(line: 51, column: 19, scope: !138)
!141 = !DILocation(line: 51, column: 24, scope: !138)
!142 = !DILocation(line: 51, column: 28, scope: !138)
!143 = !DILocation(line: 51, column: 11, scope: !138)
!144 = !DILocation(line: 51, column: 7, scope: !139)
!145 = !DILocation(line: 52, column: 29, scope: !138)
!146 = !DILocation(line: 52, column: 27, scope: !138)
!147 = !DILocation(line: 52, column: 4, scope: !138)
!148 = !DILocation(line: 52, column: 10, scope: !138)
!149 = !DILocation(line: 52, column: 15, scope: !138)
!150 = !DILocation(line: 52, column: 19, scope: !138)
!151 = !DILocation(line: 52, column: 23, scope: !138)
!152 = !DILocation(line: 53, column: 2, scope: !139)
!153 = !DILocation(line: 50, column: 23, scope: !134)
!154 = !DILocation(line: 50, column: 34, scope: !134)
!155 = !DILocation(line: 50, column: 32, scope: !134)
!156 = !DILocation(line: 50, column: 2, scope: !134)
!157 = distinct !{!157, !136, !158}
!158 = !DILocation(line: 53, column: 2, scope: !131)
!159 = !DILocation(line: 55, column: 6, scope: !99)
!160 = !DILocation(line: 55, column: 4, scope: !99)
!161 = !DILocation(line: 56, column: 9, scope: !99)
!162 = !DILocation(line: 56, column: 2, scope: !99)
!163 = !DILocation(line: 56, column: 5, scope: !99)
!164 = !DILocation(line: 56, column: 7, scope: !99)
!165 = !DILocation(line: 57, column: 12, scope: !99)
!166 = !DILocation(line: 57, column: 18, scope: !99)
!167 = !DILocation(line: 57, column: 23, scope: !99)
!168 = !DILocation(line: 57, column: 2, scope: !99)
!169 = !DILocation(line: 57, column: 5, scope: !99)
!170 = !DILocation(line: 57, column: 10, scope: !99)
!171 = !DILocation(line: 58, column: 24, scope: !99)
!172 = !DILocation(line: 58, column: 2, scope: !99)
!173 = !DILocation(line: 58, column: 8, scope: !99)
!174 = !DILocation(line: 58, column: 13, scope: !99)
!175 = !DILocation(line: 58, column: 22, scope: !99)
!176 = !DILocation(line: 60, column: 11, scope: !177)
!177 = distinct !DILexicalBlock(scope: !99, file: !3, line: 60, column: 2)
!178 = !DILocation(line: 60, column: 14, scope: !177)
!179 = !DILocation(line: 60, column: 9, scope: !177)
!180 = !DILocation(line: 60, column: 7, scope: !177)
!181 = !DILocation(line: 60, column: 20, scope: !182)
!182 = distinct !DILexicalBlock(scope: !177, file: !3, line: 60, column: 2)
!183 = !DILocation(line: 60, column: 2, scope: !177)
!184 = !DILocation(line: 61, column: 16, scope: !185)
!185 = distinct !DILexicalBlock(scope: !186, file: !3, line: 61, column: 7)
!186 = distinct !DILexicalBlock(scope: !182, file: !3, line: 60, column: 36)
!187 = !DILocation(line: 61, column: 19, scope: !185)
!188 = !DILocation(line: 61, column: 22, scope: !185)
!189 = !DILocation(line: 61, column: 25, scope: !185)
!190 = !DILocation(line: 61, column: 7, scope: !185)
!191 = !DILocation(line: 61, column: 7, scope: !186)
!192 = !DILocation(line: 62, column: 11, scope: !185)
!193 = !DILocation(line: 62, column: 14, scope: !185)
!194 = !DILocation(line: 62, column: 4, scope: !185)
!195 = !DILocation(line: 63, column: 2, scope: !186)
!196 = !DILocation(line: 60, column: 27, scope: !182)
!197 = !DILocation(line: 60, column: 30, scope: !182)
!198 = !DILocation(line: 60, column: 25, scope: !182)
!199 = !DILocation(line: 60, column: 2, scope: !182)
!200 = distinct !{!200, !183, !201}
!201 = !DILocation(line: 63, column: 2, scope: !177)
!202 = !DILocation(line: 64, column: 2, scope: !99)
!203 = !DILocation(line: 65, column: 1, scope: !99)
!204 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 67, type: !205, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!205 = !DISubroutineType(types: !206)
!206 = !{!11, !11, !207}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!209 = !DILocalVariable(name: "c", arg: 1, scope: !204, file: !3, line: 67, type: !11)
!210 = !DILocation(line: 67, column: 14, scope: !204)
!211 = !DILocalVariable(name: "v", arg: 2, scope: !204, file: !3, line: 67, type: !207)
!212 = !DILocation(line: 67, column: 24, scope: !204)
!213 = !DILocalVariable(name: "i", scope: !204, file: !3, line: 69, type: !11)
!214 = !DILocation(line: 69, column: 6, scope: !204)
!215 = !DILocalVariable(name: "j", scope: !204, file: !3, line: 69, type: !11)
!216 = !DILocation(line: 69, column: 9, scope: !204)
!217 = !DILocalVariable(name: "words", scope: !204, file: !3, line: 70, type: !208)
!218 = !DILocation(line: 70, column: 8, scope: !204)
!219 = !DILocalVariable(name: "st", scope: !204, file: !3, line: 71, type: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !221, line: 46, size: 1152, elements: !222)
!221 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!222 = !{!223, !227, !229, !231, !234, !236, !238, !239, !240, !243, !245, !247, !255, !256, !257}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !220, file: !221, line: 48, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !225, line: 145, baseType: !226)
!225 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!226 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !220, file: !221, line: 53, baseType: !228, size: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !225, line: 148, baseType: !226)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !220, file: !221, line: 61, baseType: !230, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !225, line: 151, baseType: !226)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !220, file: !221, line: 62, baseType: !232, size: 32, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !225, line: 150, baseType: !233)
!233 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !220, file: !221, line: 64, baseType: !235, size: 32, offset: 224)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !225, line: 146, baseType: !233)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !220, file: !221, line: 65, baseType: !237, size: 32, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !225, line: 147, baseType: !233)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !220, file: !221, line: 67, baseType: !11, size: 32, offset: 288)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !220, file: !221, line: 69, baseType: !224, size: 64, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !220, file: !221, line: 74, baseType: !241, size: 64, offset: 384)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !225, line: 152, baseType: !242)
!242 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !220, file: !221, line: 78, baseType: !244, size: 64, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !225, line: 174, baseType: !242)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !220, file: !221, line: 80, baseType: !246, size: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !225, line: 179, baseType: !242)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !220, file: !221, line: 91, baseType: !248, size: 128, offset: 576)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !249, line: 10, size: 128, elements: !250)
!249 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!250 = !{!251, !253}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !248, file: !249, line: 12, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !225, line: 160, baseType: !242)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !248, file: !249, line: 16, baseType: !254, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !225, line: 196, baseType: !242)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !220, file: !221, line: 92, baseType: !248, size: 128, offset: 704)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !220, file: !221, line: 93, baseType: !248, size: 128, offset: 832)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !220, file: !221, line: 106, baseType: !258, size: 192, offset: 960)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 192, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 3)
!261 = !DILocation(line: 71, column: 14, scope: !204)
!262 = !DILocalVariable(name: "fd", scope: !204, file: !3, line: 73, type: !11)
!263 = !DILocation(line: 73, column: 6, scope: !204)
!264 = !DILocation(line: 73, column: 16, scope: !204)
!265 = !DILocation(line: 73, column: 18, scope: !204)
!266 = !DILocation(line: 73, column: 41, scope: !204)
!267 = !DILocation(line: 73, column: 11, scope: !204)
!268 = !DILocation(line: 74, column: 12, scope: !269)
!269 = distinct !DILexicalBlock(scope: !204, file: !3, line: 74, column: 6)
!270 = !DILocation(line: 74, column: 6, scope: !269)
!271 = !DILocation(line: 74, column: 21, scope: !269)
!272 = !DILocation(line: 74, column: 6, scope: !204)
!273 = !DILocation(line: 74, column: 26, scope: !269)
!274 = !DILocation(line: 76, column: 20, scope: !204)
!275 = !DILocation(line: 76, column: 10, scope: !204)
!276 = !DILocation(line: 76, column: 8, scope: !204)
!277 = !DILocation(line: 77, column: 7, scope: !204)
!278 = !DILocation(line: 77, column: 11, scope: !204)
!279 = !DILocation(line: 77, column: 21, scope: !204)
!280 = !DILocation(line: 77, column: 2, scope: !204)
!281 = !DILocation(line: 78, column: 8, scope: !204)
!282 = !DILocation(line: 78, column: 2, scope: !204)
!283 = !DILocalVariable(name: "root", scope: !204, file: !3, line: 80, type: !103)
!284 = !DILocation(line: 80, column: 13, scope: !204)
!285 = !DILocalVariable(name: "cnt", scope: !204, file: !3, line: 81, type: !286)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 208, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 26)
!289 = !DILocation(line: 81, column: 16, scope: !204)
!290 = !DILocalVariable(name: "best_len", scope: !204, file: !3, line: 82, type: !11)
!291 = !DILocation(line: 82, column: 6, scope: !204)
!292 = !DILocalVariable(name: "b1", scope: !204, file: !3, line: 83, type: !14)
!293 = !DILocation(line: 83, column: 14, scope: !204)
!294 = !DILocalVariable(name: "b2", scope: !204, file: !3, line: 83, type: !14)
!295 = !DILocation(line: 83, column: 19, scope: !204)
!296 = !DILocation(line: 85, column: 9, scope: !297)
!297 = distinct !DILexicalBlock(scope: !204, file: !3, line: 85, column: 2)
!298 = !DILocation(line: 85, column: 7, scope: !297)
!299 = !DILocation(line: 85, column: 14, scope: !300)
!300 = distinct !DILexicalBlock(scope: !297, file: !3, line: 85, column: 2)
!301 = !DILocation(line: 85, column: 19, scope: !300)
!302 = !DILocation(line: 85, column: 2, scope: !297)
!303 = !DILocation(line: 86, column: 41, scope: !300)
!304 = !DILocation(line: 86, column: 30, scope: !300)
!305 = !DILocation(line: 86, column: 35, scope: !300)
!306 = !DILocation(line: 86, column: 3, scope: !300)
!307 = !DILocation(line: 86, column: 39, scope: !300)
!308 = !DILocation(line: 85, column: 24, scope: !300)
!309 = !DILocation(line: 85, column: 2, scope: !300)
!310 = distinct !{!310, !302, !311}
!311 = !DILocation(line: 86, column: 41, scope: !297)
!312 = !DILocation(line: 89, column: 13, scope: !313)
!313 = distinct !DILexicalBlock(scope: !204, file: !3, line: 89, column: 2)
!314 = !DILocation(line: 89, column: 9, scope: !313)
!315 = !DILocation(line: 89, column: 7, scope: !313)
!316 = !DILocation(line: 89, column: 18, scope: !317)
!317 = distinct !DILexicalBlock(scope: !313, file: !3, line: 89, column: 2)
!318 = !DILocation(line: 89, column: 25, scope: !317)
!319 = !DILocation(line: 89, column: 20, scope: !317)
!320 = !DILocation(line: 89, column: 2, scope: !313)
!321 = !DILocation(line: 90, column: 7, scope: !322)
!322 = distinct !DILexicalBlock(scope: !323, file: !3, line: 90, column: 7)
!323 = distinct !DILexicalBlock(scope: !317, file: !3, line: 89, column: 39)
!324 = !DILocation(line: 90, column: 13, scope: !322)
