; ModuleID = 'anagrams-deranged-anagrams.c'
source_filename = "anagrams-deranged-anagrams.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.node = type { [10 x %union.node*] }
%struct.word = type { i8*, %struct.word* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [27 x i8] c"zqxjkvbpygfwmucldrhsnioate\00", align 1
@freq = dso_local global i8* getelementptr inbounds ([27 x i8], [27 x i8]* @.str, i32 0, i32 0), align 8, !dbg !0
@char_to_idx = common dso_local global [128 x i32] zeroinitializer, align 16, !dbg !8
@.str.1 = private unnamed_addr constant [13 x i8] c"unixdict.txt\00", align 1
@.str.2 = private unnamed_addr constant [28 x i8] c"longest derangement: %s %s\0A\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @deranged(i8* %s1, i8* %s2) #0 !dbg !21 {
entry:
  %retval = alloca i32, align 4
  %s1.addr = alloca i8*, align 8
  %s2.addr = alloca i8*, align 8
  %i = alloca i32, align 4
  store i8* %s1, i8** %s1.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %s1.addr, metadata !24, metadata !DIExpression()), !dbg !25
  store i8* %s2, i8** %s2.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %s2.addr, metadata !26, metadata !DIExpression()), !dbg !27

!19 = !{i32 1, !"wchar_size", i32 4}
!20 = !{!"clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git 078de928eea94413164fbdff5fab7bdcf0f60aa7)"}
!21 = distinct !DISubprogram(name: "deranged", scope: !3, file: !3, line: 24, type: !22, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!22 = !DISubroutineType(types: !23)
!23 = !{!11, !14, !14}
!24 = !DILocalVariable(name: "s1", arg: 1, scope: !21, file: !3, line: 24, type: !14)
!25 = !DILocation(line: 24, column: 26, scope: !21)
!26 = !DILocalVariable(name: "s2", arg: 2, scope: !21, file: !3, line: 24, type: !14)
!27 = !DILocation(line: 24, column: 42, scope: !21)
!28 = !DILocalVariable(name: "i", scope: !21, file: !3, line: 26, type: !11)
!29 = !DILocation(line: 26, column: 6, scope: !21)
!30 = !DILocation(line: 27, column: 9, scope: !31)
!31 = distinct !DILexicalBlock(scope: !21, file: !3, line: 27, column: 2)
!32 = !DILocation(line: 27, column: 7, scope: !31)
!33 = !DILocation(line: 27, column: 14, scope: !34)
!34 = distinct !DILexicalBlock(scope: !31, file: !3, line: 27, column: 2)
!35 = !DILocation(line: 27, column: 17, scope: !34)
!36 = !DILocation(line: 27, column: 2, scope: !31)
!37 = !DILocation(line: 28, column: 7, scope: !38)
!38 = distinct !DILexicalBlock(scope: !34, file: !3, line: 28, column: 7)
!39 = !DILocation(line: 28, column: 10, scope: !38)
!40 = !DILocation(line: 28, column: 16, scope: !38)
!41 = !DILocation(line: 28, column: 19, scope: !38)
!42 = !DILocation(line: 28, column: 13, scope: !38)
!43 = !DILocation(line: 28, column: 7, scope: !34)
!44 = !{!"if"}
!45 = !DILocation(line: 28, column: 23, scope: !38)
!46 = !DILocation(line: 28, column: 20, scope: !38)
!47 = !DILocation(line: 27, column: 22, scope: !34)
!48 = !DILocation(line: 27, column: 2, scope: !34)
!49 = distinct !{!49, !36, !50}
!50 = !DILocation(line: 28, column: 30, scope: !31)
!51 = !DILocation(line: 29, column: 2, scope: !21)
!52 = !DILocation(line: 30, column: 1, scope: !21)
!53 = distinct !DISubprogram(name: "count_letters", scope: !3, file: !3, line: 32, type: !54, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!54 = !DISubroutineType(types: !55)
!55 = !{!11, !14, !56}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!57 = !DILocalVariable(name: "s", arg: 1, scope: !53, file: !3, line: 32, type: !14)
!58 = !DILocation(line: 32, column: 31, scope: !53)
!59 = !DILocalVariable(name: "c", arg: 2, scope: !53, file: !3, line: 32, type: !56)
!60 = !DILocation(line: 32, column: 49, scope: !53)
!61 = !DILocalVariable(name: "i", scope: !53, file: !3, line: 34, type: !11)
!62 = !DILocation(line: 34, column: 6, scope: !53)
!63 = !DILocalVariable(name: "len", scope: !53, file: !3, line: 34, type: !11)
!64 = !DILocation(line: 34, column: 9, scope: !53)
!65 = !DILocation(line: 35, column: 9, scope: !53)
!66 = !DILocation(line: 35, column: 2, scope: !53)
!67 = !DILocation(line: 36, column: 15, scope: !68)
!68 = distinct !DILexicalBlock(scope: !53, file: !3, line: 36, column: 2)
!69 = !DILocation(line: 36, column: 11, scope: !68)
!70 = !DILocation(line: 36, column: 7, scope: !68)
!71 = !DILocation(line: 36, column: 20, scope: !72)
!72 = distinct !DILexicalBlock(scope: !68, file: !3, line: 36, column: 2)
!73 = !DILocation(line: 36, column: 22, scope: !72)
!74 = !DILocation(line: 36, column: 2, scope: !68)
!75 = !DILocation(line: 37, column: 7, scope: !76)
!76 = distinct !DILexicalBlock(scope: !77, file: !3, line: 37, column: 7)
!77 = distinct !DILexicalBlock(scope: !72, file: !3, line: 36, column: 31)
!78 = !DILocation(line: 37, column: 9, scope: !76)
!79 = !DILocation(line: 37, column: 12, scope: !76)
!80 = !DILocation(line: 37, column: 18, scope: !76)
!81 = !DILocation(line: 37, column: 21, scope: !76)
!82 = !DILocation(line: 37, column: 23, scope: !76)
!83 = !DILocation(line: 37, column: 26, scope: !76)
!84 = !DILocation(line: 37, column: 7, scope: !77)
!85 = !DILocation(line: 38, column: 4, scope: !76)
!86 = !DILocation(line: 39, column: 6, scope: !77)
!87 = !DILocation(line: 39, column: 10, scope: !77)
!88 = !DILocation(line: 39, column: 39, scope: !77)
!89 = !DILocation(line: 39, column: 41, scope: !77)
!90 = !DILocation(line: 39, column: 12, scope: !77)
!91 = !DILocation(line: 39, column: 45, scope: !77)
!92 = !DILocation(line: 40, column: 2, scope: !77)
!93 = !DILocation(line: 36, column: 27, scope: !72)
!94 = !DILocation(line: 36, column: 2, scope: !72)
!95 = distinct !{!95, !74, !96}
!96 = !DILocation(line: 40, column: 2, scope: !68)
!97 = !DILocation(line: 41, column: 9, scope: !53)
!98 = !DILocation(line: 41, column: 2, scope: !53)
!99 = !DILocation(line: 42, column: 1, scope: !53)
!100 = distinct !DISubprogram(name: "insert", scope: !3, file: !3, line: 44, type: !101, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!101 = !DISubroutineType(types: !102)
!102 = !{!14, !103, !14, !56}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "node", file: !3, line: 19, size: 640, elements: !105)
!105 = !{!106, !110}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "down", scope: !104, file: !3, line: 20, baseType: !107, size: 640)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 640, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 10)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !104, file: !3, line: 21, baseType: !111, size: 640)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 640, elements: !108)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "word", file: !3, line: 14, size: 128, elements: !114)
!114 = !{!115, !116}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !113, file: !3, line: 15, baseType: !14, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !113, file: !3, line: 16, baseType: !112, size: 64, offset: 64)
!117 = !DILocalVariable(name: "root", arg: 1, scope: !100, file: !3, line: 44, type: !103)
!118 = !DILocation(line: 44, column: 33, scope: !100)
!119 = !DILocalVariable(name: "s", arg: 2, scope: !100, file: !3, line: 44, type: !14)
!120 = !DILocation(line: 44, column: 51, scope: !100)
!121 = !DILocalVariable(name: "cnt", arg: 3, scope: !100, file: !3, line: 44, type: !56)
!122 = !DILocation(line: 44, column: 69, scope: !100)
!123 = !DILocalVariable(name: "i", scope: !100, file: !3, line: 46, type: !11)
!124 = !DILocation(line: 46, column: 6, scope: !100)
!125 = !DILocalVariable(name: "n", scope: !100, file: !3, line: 47, type: !103)
!126 = !DILocation(line: 47, column: 14, scope: !100)
!127 = !DILocalVariable(name: "v", scope: !100, file: !3, line: 48, type: !112)
!128 = !DILocation(line: 48, column: 15, scope: !100)
!129 = !DILocalVariable(name: "w", scope: !100, file: !3, line: 48, type: !112)
!130 = !DILocation(line: 48, column: 19, scope: !100)
!131 = !DILocation(line: 50, column: 9, scope: !132)
!132 = distinct !DILexicalBlock(scope: !100, file: !3, line: 50, column: 2)
!133 = !DILocation(line: 50, column: 7, scope: !132)
!134 = !DILocation(line: 50, column: 14, scope: !135)
!135 = distinct !DILexicalBlock(scope: !132, file: !3, line: 50, column: 2)
!136 = !DILocation(line: 50, column: 16, scope: !135)
!137 = !DILocation(line: 50, column: 2, scope: !132)
!138 = !DILocation(line: 51, column: 13, scope: !139)
!139 = distinct !DILexicalBlock(scope: !140, file: !3, line: 51, column: 7)
!140 = distinct !DILexicalBlock(scope: !135, file: !3, line: 50, column: 37)
!141 = !DILocation(line: 51, column: 19, scope: !139)
!142 = !DILocation(line: 51, column: 24, scope: !139)
!143 = !DILocation(line: 51, column: 28, scope: !139)
!144 = !DILocation(line: 51, column: 11, scope: !139)
!145 = !DILocation(line: 51, column: 7, scope: !140)
!146 = !DILocation(line: 52, column: 29, scope: !139)
!147 = !DILocation(line: 52, column: 27, scope: !139)
!148 = !DILocation(line: 52, column: 4, scope: !139)
!149 = !DILocation(line: 52, column: 10, scope: !139)
!150 = !DILocation(line: 52, column: 15, scope: !139)
!151 = !DILocation(line: 52, column: 19, scope: !139)
!152 = !DILocation(line: 52, column: 23, scope: !139)
!153 = !DILocation(line: 53, column: 2, scope: !140)
!154 = !DILocation(line: 50, column: 23, scope: !135)
!155 = !DILocation(line: 50, column: 34, scope: !135)
!156 = !DILocation(line: 50, column: 32, scope: !135)
!157 = !DILocation(line: 50, column: 2, scope: !135)
!158 = distinct !{!158, !137, !159}
!159 = !DILocation(line: 53, column: 2, scope: !132)
!160 = !DILocation(line: 55, column: 6, scope: !100)
!161 = !DILocation(line: 55, column: 4, scope: !100)
!162 = !DILocation(line: 56, column: 9, scope: !100)
!163 = !DILocation(line: 56, column: 2, scope: !100)
!164 = !DILocation(line: 56, column: 5, scope: !100)
!165 = !DILocation(line: 56, column: 7, scope: !100)
!166 = !DILocation(line: 57, column: 12, scope: !100)
!167 = !DILocation(line: 57, column: 18, scope: !100)
!168 = !DILocation(line: 57, column: 23, scope: !100)
!169 = !DILocation(line: 57, column: 2, scope: !100)
!170 = !DILocation(line: 57, column: 5, scope: !100)
!171 = !DILocation(line: 57, column: 10, scope: !100)
!172 = !DILocation(line: 58, column: 24, scope: !100)
!173 = !DILocation(line: 58, column: 2, scope: !100)
!174 = !DILocation(line: 58, column: 8, scope: !100)
!175 = !DILocation(line: 58, column: 13, scope: !100)
!176 = !DILocation(line: 58, column: 22, scope: !100)
!177 = !DILocation(line: 60, column: 11, scope: !178)
!178 = distinct !DILexicalBlock(scope: !100, file: !3, line: 60, column: 2)
!179 = !DILocation(line: 60, column: 14, scope: !178)
!180 = !DILocation(line: 60, column: 9, scope: !178)
!181 = !DILocation(line: 60, column: 7, scope: !178)
!182 = !DILocation(line: 60, column: 20, scope: !183)
!183 = distinct !DILexicalBlock(scope: !178, file: !3, line: 60, column: 2)
!184 = !DILocation(line: 60, column: 2, scope: !178)
!185 = !DILocation(line: 61, column: 16, scope: !186)
!186 = distinct !DILexicalBlock(scope: !187, file: !3, line: 61, column: 7)
!187 = distinct !DILexicalBlock(scope: !183, file: !3, line: 60, column: 36)
!188 = !DILocation(line: 61, column: 19, scope: !186)
!189 = !DILocation(line: 61, column: 22, scope: !186)
!190 = !DILocation(line: 61, column: 25, scope: !186)
!191 = !DILocation(line: 61, column: 7, scope: !186)
!192 = !DILocation(line: 61, column: 7, scope: !187)
!193 = !DILocation(line: 62, column: 11, scope: !186)
!194 = !DILocation(line: 62, column: 14, scope: !186)
!195 = !DILocation(line: 62, column: 4, scope: !186)
!196 = !DILocation(line: 63, column: 2, scope: !187)
!197 = !DILocation(line: 60, column: 27, scope: !183)
!198 = !DILocation(line: 60, column: 30, scope: !183)
!199 = !DILocation(line: 60, column: 25, scope: !183)
!200 = !DILocation(line: 60, column: 2, scope: !183)
!201 = distinct !{!201, !184, !202}
!202 = !DILocation(line: 63, column: 2, scope: !178)
!203 = !DILocation(line: 64, column: 2, scope: !100)
!204 = !DILocation(line: 65, column: 1, scope: !100)
!205 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 67, type: !206, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!206 = !DISubroutineType(types: !207)
!207 = !{!11, !11, !208}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!210 = !DILocalVariable(name: "c", arg: 1, scope: !205, file: !3, line: 67, type: !11)
!211 = !DILocation(line: 67, column: 14, scope: !205)
!212 = !DILocalVariable(name: "v", arg: 2, scope: !205, file: !3, line: 67, type: !208)
!213 = !DILocation(line: 67, column: 24, scope: !205)
!214 = !DILocalVariable(name: "i", scope: !205, file: !3, line: 69, type: !11)
!215 = !DILocation(line: 69, column: 6, scope: !205)
!216 = !DILocalVariable(name: "j", scope: !205, file: !3, line: 69, type: !11)
!217 = !DILocation(line: 69, column: 9, scope: !205)
!218 = !DILocalVariable(name: "words", scope: !205, file: !3, line: 70, type: !209)
!219 = !DILocation(line: 70, column: 8, scope: !205)
!220 = !DILocalVariable(name: "st", scope: !205, file: !3, line: 71, type: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !222, line: 46, size: 1152, elements: !223)
!222 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!223 = !{!224, !228, !230, !232, !235, !237, !239, !240, !241, !244, !246, !248, !256, !257, !258}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !221, file: !222, line: 48, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !226, line: 145, baseType: !227)
!226 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!227 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !221, file: !222, line: 53, baseType: !229, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !226, line: 148, baseType: !227)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !221, file: !222, line: 61, baseType: !231, size: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !226, line: 151, baseType: !227)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !221, file: !222, line: 62, baseType: !233, size: 32, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !226, line: 150, baseType: !234)
!234 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !221, file: !222, line: 64, baseType: !236, size: 32, offset: 224)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !226, line: 146, baseType: !234)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !221, file: !222, line: 65, baseType: !238, size: 32, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !226, line: 147, baseType: !234)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !221, file: !222, line: 67, baseType: !11, size: 32, offset: 288)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !221, file: !222, line: 69, baseType: !225, size: 64, offset: 320)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !221, file: !222, line: 74, baseType: !242, size: 64, offset: 384)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !226, line: 152, baseType: !243)
!243 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !221, file: !222, line: 78, baseType: !245, size: 64, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !226, line: 174, baseType: !243)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !221, file: !222, line: 80, baseType: !247, size: 64, offset: 512)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !226, line: 179, baseType: !243)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !221, file: !222, line: 91, baseType: !249, size: 128, offset: 576)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !250, line: 10, size: 128, elements: !251)
!250 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!251 = !{!252, !254}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !249, file: !250, line: 12, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !226, line: 160, baseType: !243)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !249, file: !250, line: 16, baseType: !255, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !226, line: 196, baseType: !243)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !221, file: !222, line: 92, baseType: !249, size: 128, offset: 704)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !221, file: !222, line: 93, baseType: !249, size: 128, offset: 832)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !221, file: !222, line: 106, baseType: !259, size: 192, offset: 960)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 192, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 3)
!262 = !DILocation(line: 71, column: 14, scope: !205)
!263 = !DILocalVariable(name: "fd", scope: !205, file: !3, line: 73, type: !11)
!264 = !DILocation(line: 73, column: 6, scope: !205)
!265 = !DILocation(line: 73, column: 16, scope: !205)
!266 = !DILocation(line: 73, column: 18, scope: !205)
!267 = !DILocation(line: 73, column: 41, scope: !205)
!268 = !DILocation(line: 73, column: 11, scope: !205)
!269 = !DILocation(line: 74, column: 12, scope: !270)
!270 = distinct !DILexicalBlock(scope: !205, file: !3, line: 74, column: 6)
!271 = !DILocation(line: 74, column: 6, scope: !270)
!272 = !DILocation(line: 74, column: 21, scope: !270)
!273 = !DILocation(line: 74, column: 6, scope: !205)
!274 = !DILocation(line: 74, column: 26, scope: !270)
!275 = !DILocation(line: 76, column: 20, scope: !205)
!276 = !DILocation(line: 76, column: 10, scope: !205)
!277 = !DILocation(line: 76, column: 8, scope: !205)
!278 = !DILocation(line: 77, column: 7, scope: !205)
!279 = !DILocation(line: 77, column: 11, scope: !205)
!280 = !DILocation(line: 77, column: 21, scope: !205)
!281 = !DILocation(line: 77, column: 2, scope: !205)
!282 = !DILocation(line: 78, column: 8, scope: !205)
!283 = !DILocation(line: 78, column: 2, scope: !205)
!284 = !DILocalVariable(name: "root", scope: !205, file: !3, line: 80, type: !104)
!285 = !DILocation(line: 80, column: 13, scope: !205)
!286 = !DILocalVariable(name: "cnt", scope: !205, file: !3, line: 81, type: !287)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 208, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 26)
!290 = !DILocation(line: 81, column: 16, scope: !205)
!291 = !DILocalVariable(name: "best_len", scope: !205, file: !3, line: 82, type: !11)
!292 = !DILocation(line: 82, column: 6, scope: !205)
!293 = !DILocalVariable(name: "b1", scope: !205, file: !3, line: 83, type: !14)
!294 = !DILocation(line: 83, column: 14, scope: !205)
!295 = !DILocalVariable(name: "b2", scope: !205, file: !3, line: 83, type: !14)
!296 = !DILocation(line: 83, column: 19, scope: !205)
!297 = !DILocation(line: 85, column: 9, scope: !298)
!298 = distinct !DILexicalBlock(scope: !205, file: !3, line: 85, column: 2)
!299 = !DILocation(line: 85, column: 7, scope: !298)
!300 = !DILocation(line: 85, column: 14, scope: !301)
!301 = distinct !DILexicalBlock(scope: !298, file: !3, line: 85, column: 2)
!302 = !DILocation(line: 85, column: 19, scope: !301)
!303 = !DILocation(line: 85, column: 2, scope: !298)
!304 = !DILocation(line: 86, column: 41, scope: !301)
!305 = !DILocation(line: 86, column: 30, scope: !301)
!306 = !DILocation(line: 86, column: 35, scope: !301)
!307 = !DILocation(line: 86, column: 3, scope: !301)
!308 = !DILocation(line: 86, column: 39, scope: !301)
!309 = !DILocation(line: 85, column: 24, scope: !301)
!310 = !DILocation(line: 85, column: 2, scope: !301)
!311 = distinct !{!311, !303, !312}
!312 = !DILocation(line: 86, column: 41, scope: !298)
!313 = !DILocation(line: 89, column: 13, scope: !314)
!314 = distinct !DILexicalBlock(scope: !205, file: !3, line: 89, column: 2)
!315 = !DILocation(line: 89, column: 9, scope: !314)
!316 = !DILocation(line: 89, column: 7, scope: !314)
!317 = !DILocation(line: 89, column: 18, scope: !318)
!318 = distinct !DILexicalBlock(scope: !314, file: !3, line: 89, column: 2)
!319 = !DILocation(line: 89, column: 25, scope: !318)
!320 = !DILocation(line: 89, column: 20, scope: !318)
!321 = !DILocation(line: 89, column: 2, scope: !314)
!322 = !DILocation(line: 90, column: 7, scope: !323)
!323 = distinct !DILexicalBlock(scope: !324, file: !3, line: 90, column: 7)
!324 = distinct !DILexicalBlock(scope: !318, file: !3, line: 89, column: 39)
!325 = !DILocation(line: 90, column: 13, scope: !323)
