; ModuleID = 'globally-replace-text-in-several-files.c'
source_filename = "globally-replace-text-in-several-files.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [16 x i8] c"Can't open '%s'\00", align 1
@.str.1 = private unnamed_addr constant [16 x i8] c"Can't stat '%s'\00", align 1
@.str.2 = private unnamed_addr constant [17 x i8] c"Can't alloc '%s'\00", align 1
@.str.3 = private unnamed_addr constant [14 x i8] c"Bad read '%s'\00", align 1
@.str.4 = private unnamed_addr constant [17 x i8] c"Goodbye, London!\00", align 1
@.str.5 = private unnamed_addr constant [17 x i8] c"Hello, New York!\00", align 1
@.str.6 = private unnamed_addr constant [10 x i8] c"test1.txt\00", align 1
@.str.7 = private unnamed_addr constant [10 x i8] c"test2.txt\00", align 1
@.str.8 = private unnamed_addr constant [10 x i8] c"test3.txt\00", align 1
@__const.main.files = private unnamed_addr constant [3 x i8*] [i8* getelementptr inbounds ([10 x i8], [10 x i8]* @.str.6, i32 0, i32 0), i8* getelementptr inbounds ([10 x i8], [10 x i8]* @.str.7, i32 0, i32 0), i8* getelementptr inbounds ([10 x i8], [10 x i8]* @.str.8, i32 0, i32 0)], align 16

; Function Attrs: noinline nounwind uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git 078de928eea94413164fbdff5fab7bdcf0f60aa7)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "globally-replace-text-in-several-files.c", directory: "/scratch/yc0769/xstack_benchmark/rosetta/Globally-replace-text-in-several-files")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!6 = !{i32 7, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{!"clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git 078de928eea94413164fbdff5fab7bdcf0f60aa7)"}
!10 = distinct !DISubprogram(name: "find_match", scope: !1, file: !1, line: 12, type: !11, scopeLine: 13, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!11 = !DISubroutineType(types: !12)
!12 = !{!4, !13, !13, !13, !15}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !16, line: 46, baseType: !17)
!16 = !DIFile(filename: "/u/NAS_SCRATCH/yc0769/xstack/llvm-install/lib/clang/10.0.1/include/stddef.h", directory: "")
!17 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!18 = !DILocalVariable(name: "buf", arg: 1, scope: !10, file: !1, line: 12, type: !13)
!19 = !DILocation(line: 12, column: 31, scope: !10)
!20 = !DILocalVariable(name: "buf_end", arg: 2, scope: !10, file: !1, line: 12, type: !13)
!21 = !DILocation(line: 12, column: 49, scope: !10)
!22 = !DILocalVariable(name: "pat", arg: 3, scope: !10, file: !1, line: 12, type: !13)
!23 = !DILocation(line: 12, column: 70, scope: !10)
!24 = !DILocalVariable(name: "len", arg: 4, scope: !10, file: !1, line: 12, type: !15)
!25 = !DILocation(line: 12, column: 82, scope: !10)
!26 = !DILocalVariable(name: "i", scope: !10, file: !1, line: 14, type: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !16, line: 35, baseType: !28)
!28 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!29 = !DILocation(line: 14, column: 12, scope: !10)
!30 = !DILocalVariable(name: "start", scope: !10, file: !1, line: 15, type: !4)
!31 = !DILocation(line: 15, column: 8, scope: !10)
!32 = !DILocation(line: 15, column: 16, scope: !10)
!33 = !DILocation(line: 16, column: 2, scope: !10)
!34 = !DILocation(line: 16, column: 9, scope: !10)
!35 = !DILocation(line: 16, column: 17, scope: !10)
!36 = !DILocation(line: 16, column: 15, scope: !10)
!37 = !DILocation(line: 16, column: 23, scope: !10)
!38 = !DILocation(line: 16, column: 21, scope: !10)
!39 = !DILocation(line: 17, column: 10, scope: !40)
!40 = distinct !DILexicalBlock(scope: !41, file: !1, line: 17, column: 3)
!41 = distinct !DILexicalBlock(scope: !10, file: !1, line: 16, column: 32)
!42 = !DILocation(line: 17, column: 8, scope: !40)
!43 = !DILocation(line: 17, column: 15, scope: !44)
!44 = distinct !DILexicalBlock(scope: !40, file: !1, line: 17, column: 3)
!45 = !DILocation(line: 17, column: 19, scope: !44)
!46 = !DILocation(line: 17, column: 17, scope: !44)
!47 = !DILocation(line: 17, column: 3, scope: !40)
!48 = !DILocation(line: 18, column: 8, scope: !49)
!49 = distinct !DILexicalBlock(scope: !44, file: !1, line: 18, column: 8)
!50 = !DILocation(line: 18, column: 14, scope: !49)
!51 = !DILocation(line: 18, column: 20, scope: !49)
!52 = !DILocation(line: 18, column: 24, scope: !49)
!53 = !DILocation(line: 18, column: 17, scope: !49)
!54 = !DILocation(line: 18, column: 8, scope: !44)
!55 = !{!"if"}
!56 = !DILocation(line: 18, column: 28, scope: !49)
!57 = !DILocation(line: 18, column: 25, scope: !49)
!58 = !DILocation(line: 17, column: 25, scope: !44)
!59 = !DILocation(line: 17, column: 3, scope: !44)
!60 = distinct !{!60, !47, !61}
!61 = !DILocation(line: 18, column: 28, scope: !40)
!62 = !DILocation(line: 20, column: 7, scope: !63)
!63 = distinct !DILexicalBlock(scope: !41, file: !1, line: 20, column: 7)
!64 = !DILocation(line: 20, column: 12, scope: !63)
!65 = !DILocation(line: 20, column: 9, scope: !63)
!66 = !DILocation(line: 20, column: 7, scope: !41)
!67 = !DILocation(line: 20, column: 32, scope: !63)
!68 = !DILocation(line: 20, column: 17, scope: !63)
!69 = !DILocation(line: 21, column: 8, scope: !41)
!70 = distinct !{!70, !33, !71}
!71 = !DILocation(line: 22, column: 2, scope: !10)
!72 = !DILocation(line: 23, column: 2, scope: !10)
!73 = !DILocation(line: 24, column: 1, scope: !10)
!74 = distinct !DISubprogram(name: "replace", scope: !1, file: !1, line: 26, type: !75, scopeLine: 27, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!75 = !DISubroutineType(types: !76)
!76 = !{!77, !13, !13, !13}
!77 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!78 = !DILocalVariable(name: "from", arg: 1, scope: !74, file: !1, line: 26, type: !13)
!79 = !DILocation(line: 26, column: 25, scope: !74)
!80 = !DILocalVariable(name: "to", arg: 2, scope: !74, file: !1, line: 26, type: !13)
!81 = !DILocation(line: 26, column: 43, scope: !74)
!82 = !DILocalVariable(name: "fname", arg: 3, scope: !74, file: !1, line: 26, type: !13)
!83 = !DILocation(line: 26, column: 59, scope: !74)
!84 = !DILocalVariable(name: "st", scope: !74, file: !1, line: 29, type: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !86, line: 46, size: 1152, elements: !87)
!86 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!87 = !{!88, !91, !93, !95, !98, !100, !102, !103, !104, !106, !108, !110, !118, !119, !120}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !85, file: !86, line: 48, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !90, line: 145, baseType: !17)
!90 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!91 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !85, file: !86, line: 53, baseType: !92, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !90, line: 148, baseType: !17)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !85, file: !86, line: 61, baseType: !94, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !90, line: 151, baseType: !17)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !85, file: !86, line: 62, baseType: !96, size: 32, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !90, line: 150, baseType: !97)
!97 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !85, file: !86, line: 64, baseType: !99, size: 32, offset: 224)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !90, line: 146, baseType: !97)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !85, file: !86, line: 65, baseType: !101, size: 32, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !90, line: 147, baseType: !97)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !85, file: !86, line: 67, baseType: !77, size: 32, offset: 288)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !85, file: !86, line: 69, baseType: !89, size: 64, offset: 320)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !85, file: !86, line: 74, baseType: !105, size: 64, offset: 384)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !90, line: 152, baseType: !28)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !85, file: !86, line: 78, baseType: !107, size: 64, offset: 448)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !90, line: 174, baseType: !28)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !85, file: !86, line: 80, baseType: !109, size: 64, offset: 512)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !90, line: 179, baseType: !28)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !85, file: !86, line: 91, baseType: !111, size: 128, offset: 576)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !112, line: 10, size: 128, elements: !113)
!112 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!113 = !{!114, !116}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !111, file: !112, line: 12, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !90, line: 160, baseType: !28)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !111, file: !112, line: 16, baseType: !117, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !90, line: 196, baseType: !28)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !85, file: !86, line: 92, baseType: !111, size: 128, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !85, file: !86, line: 93, baseType: !111, size: 128, offset: 832)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !85, file: !86, line: 106, baseType: !121, size: 192, offset: 960)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 192, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 3)
!124 = !DILocation(line: 29, column: 14, scope: !74)
!125 = !DILocalVariable(name: "ret", scope: !74, file: !1, line: 30, type: !77)
!126 = !DILocation(line: 30, column: 6, scope: !74)
!127 = !DILocalVariable(name: "buf", scope: !74, file: !1, line: 31, type: !4)
!128 = !DILocation(line: 31, column: 8, scope: !74)
!129 = !DILocalVariable(name: "start", scope: !74, file: !1, line: 31, type: !4)
!130 = !DILocation(line: 31, column: 18, scope: !74)
!131 = !DILocalVariable(name: "end", scope: !74, file: !1, line: 31, type: !4)
!132 = !DILocation(line: 31, column: 26, scope: !74)
!133 = !DILocalVariable(name: "len", scope: !74, file: !1, line: 32, type: !15)
!134 = !DILocation(line: 32, column: 9, scope: !74)
!135 = !DILocation(line: 32, column: 22, scope: !74)
!136 = !DILocation(line: 32, column: 15, scope: !74)
!137 = !DILocalVariable(name: "nlen", scope: !74, file: !1, line: 32, type: !15)
!138 = !DILocation(line: 32, column: 29, scope: !74)
!139 = !DILocation(line: 32, column: 43, scope: !74)
!140 = !DILocation(line: 32, column: 36, scope: !74)
!141 = !DILocalVariable(name: "fd", scope: !74, file: !1, line: 33, type: !77)
!142 = !DILocation(line: 33, column: 6, scope: !74)
!143 = !DILocation(line: 33, column: 16, scope: !74)
!144 = !DILocation(line: 33, column: 11, scope: !74)
!145 = !DILocation(line: 35, column: 6, scope: !146)
!146 = distinct !DILexicalBlock(scope: !74, file: !1, line: 35, column: 6)
!147 = !DILocation(line: 35, column: 9, scope: !146)
!148 = !DILocation(line: 35, column: 6, scope: !74)
!149 = !DILocation(line: 35, column: 16, scope: !150)
!150 = distinct !DILexicalBlock(scope: !146, file: !1, line: 35, column: 16)
!151 = !DILocation(line: 36, column: 12, scope: !152)
!152 = distinct !DILexicalBlock(scope: !74, file: !1, line: 36, column: 6)
!153 = !DILocation(line: 36, column: 6, scope: !152)
!154 = !DILocation(line: 36, column: 21, scope: !152)
!155 = !DILocation(line: 36, column: 6, scope: !74)
!156 = !DILocation(line: 36, column: 28, scope: !157)
!157 = distinct !DILexicalBlock(scope: !152, file: !1, line: 36, column: 28)
!158 = !DILocation(line: 37, column: 24, scope: !159)
!159 = distinct !DILexicalBlock(scope: !74, file: !1, line: 37, column: 6)
!160 = !DILocation(line: 37, column: 14, scope: !159)
!161 = !DILocation(line: 37, column: 12, scope: !159)
!162 = !DILocation(line: 37, column: 6, scope: !74)
!163 = !DILocation(line: 37, column: 35, scope: !164)
!164 = distinct !DILexicalBlock(scope: !159, file: !1, line: 37, column: 35)
!165 = !DILocation(line: 38, column: 11, scope: !166)
!166 = distinct !DILexicalBlock(scope: !74, file: !1, line: 38, column: 6)
!167 = !DILocation(line: 38, column: 15, scope: !166)
!168 = !DILocation(line: 38, column: 23, scope: !166)
!169 = !DILocation(line: 38, column: 6, scope: !166)
!170 = !DILocation(line: 38, column: 38, scope: !166)
!171 = !DILocation(line: 38, column: 32, scope: !166)
!172 = !DILocation(line: 38, column: 6, scope: !74)
!173 = !DILocation(line: 38, column: 47, scope: !174)
!174 = distinct !DILexicalBlock(scope: !166, file: !1, line: 38, column: 47)
!175 = !DILocation(line: 40, column: 10, scope: !74)
!176 = !DILocation(line: 40, column: 8, scope: !74)
!177 = !DILocation(line: 41, column: 19, scope: !74)
!178 = !DILocation(line: 41, column: 26, scope: !74)
!179 = !DILocation(line: 41, column: 35, scope: !74)
!180 = !DILocation(line: 41, column: 30, scope: !74)
!181 = !DILocation(line: 41, column: 44, scope: !74)
!182 = !DILocation(line: 41, column: 50, scope: !74)
!183 = !DILocation(line: 41, column: 8, scope: !74)
!184 = !DILocation(line: 41, column: 6, scope: !74)
!185 = !DILocation(line: 42, column: 7, scope: !186)
!186 = distinct !DILexicalBlock(scope: !74, file: !1, line: 42, column: 6)
