; ModuleID = 'benfords-law.ll'
source_filename = "benfords-law.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@benford_distribution.prob = internal global [9 x float] zeroinitializer, align 16, !dbg !0
@.str = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.1 = private unnamed_addr constant [16 x i8] c"Can't open file\00", align 1
@get_actual_distribution.freq = internal global [9 x float] zeroinitializer, align 16, !dbg !12
@.str.2 = private unnamed_addr constant [23 x i8] c"Usage: benford <file>\0A\00", align 1
@.str.3 = private unnamed_addr constant [22 x i8] c"digit\09actual\09expected\00", align 1
@.str.4 = private unnamed_addr constant [14 x i8] c"%d\09%.3f\09%.3f\0A\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local float* @benford_distribution() #0 !dbg !2 {
entry:
  call void @llvm.dbg.value(metadata i32 1, metadata !26, metadata !DIExpression()), !dbg !29
  br label %for.cond, !dbg !30

for.cond:                                         ; preds = %for.inc, %entry

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "prob", scope: !2, file: !3, line: 7, type: !19, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "benford_distribution", scope: !3, file: !3, line: 5, type: !4, scopeLine: 6, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !8, retainedNodes: !9)
!3 = !DIFile(filename: "benfords-law.c", directory: "/scratch/yc0769/xstack_benchmark/rosetta/Benfords-law")
!4 = !DISubroutineType(types: !5)
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!8 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !9, retainedTypes: !10, globals: !11, splitDebugInlining: false, nameTableKind: None)
!9 = !{}
!10 = !{!7}
!11 = !{!0, !12}
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "freq", scope: !14, file: !3, line: 41, type: !19, isLocal: true, isDefinition: true)
!14 = distinct !DISubprogram(name: "get_actual_distribution", scope: !3, file: !3, line: 14, type: !15, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !8, retainedNodes: !9)
!15 = !DISubroutineType(types: !16)
!16 = !{!6, !17}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 288, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 9)
!22 = !{i32 7, !"Dwarf Version", i32 4}
!23 = !{i32 2, !"Debug Info Version", i32 3}
!24 = !{i32 1, !"wchar_size", i32 4}
!25 = !{!"clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!26 = !DILocalVariable(name: "i", scope: !27, file: !3, line: 8, type: !28)
!27 = distinct !DILexicalBlock(scope: !2, file: !3, line: 8, column: 5)
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !DILocation(line: 0, scope: !27)
!30 = !DILocation(line: 8, column: 10, scope: !27)
!31 = !DILocation(line: 8, column: 23, scope: !32)
!32 = distinct !DILexicalBlock(scope: !27, file: !3, line: 8, column: 5)
!33 = !DILocation(line: 8, column: 5, scope: !27)
!34 = !DILocation(line: 9, column: 40, scope: !32)
!35 = !DILocation(line: 9, column: 38, scope: !32)
!36 = !DILocation(line: 9, column: 32, scope: !32)
!37 = !DILocation(line: 9, column: 30, scope: !32)
!38 = !DILocation(line: 9, column: 23, scope: !32)
!39 = !DILocation(line: 9, column: 16, scope: !32)
!40 = !DILocation(line: 9, column: 9, scope: !32)
!41 = !DILocation(line: 9, column: 21, scope: !32)
!42 = !DILocation(line: 8, column: 30, scope: !32)
!43 = !DILocation(line: 8, column: 5, scope: !32)
!44 = distinct !{!44, !33, !45}
!45 = !DILocation(line: 9, column: 41, scope: !27)
!46 = !DILocation(line: 11, column: 5, scope: !2)
!47 = !DILocalVariable(name: "fn", arg: 1, scope: !14, file: !3, line: 14, type: !17)
!48 = !DILocation(line: 0, scope: !14)
!49 = !DILocation(line: 16, column: 19, scope: !14)
!50 = !DILocalVariable(name: "input", scope: !14, file: !3, line: 16, type: !51)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !53, line: 7, baseType: !54)
!53 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !55, line: 49, size: 1728, elements: !56)
!55 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!56 = !{!57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !72, !74, !75, !76, !80, !82, !84, !88, !91, !93, !96, !99, !100, !102, !106, !107}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !54, file: !55, line: 51, baseType: !28, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !54, file: !55, line: 54, baseType: !17, size: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !54, file: !55, line: 55, baseType: !17, size: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !54, file: !55, line: 56, baseType: !17, size: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !54, file: !55, line: 57, baseType: !17, size: 64, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !54, file: !55, line: 58, baseType: !17, size: 64, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !54, file: !55, line: 59, baseType: !17, size: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !54, file: !55, line: 60, baseType: !17, size: 64, offset: 448)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !54, file: !55, line: 61, baseType: !17, size: 64, offset: 512)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !54, file: !55, line: 64, baseType: !17, size: 64, offset: 576)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !54, file: !55, line: 65, baseType: !17, size: 64, offset: 640)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !54, file: !55, line: 66, baseType: !17, size: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !54, file: !55, line: 68, baseType: !70, size: 64, offset: 768)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !55, line: 36, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !54, file: !55, line: 70, baseType: !73, size: 64, offset: 832)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !54, file: !55, line: 72, baseType: !28, size: 32, offset: 896)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !54, file: !55, line: 73, baseType: !28, size: 32, offset: 928)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !54, file: !55, line: 74, baseType: !77, size: 64, offset: 960)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !78, line: 152, baseType: !79)
!78 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!79 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !54, file: !55, line: 77, baseType: !81, size: 16, offset: 1024)
!81 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !54, file: !55, line: 78, baseType: !83, size: 8, offset: 1040)
!83 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !54, file: !55, line: 79, baseType: !85, size: 8, offset: 1048)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 1)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !54, file: !55, line: 81, baseType: !89, size: 64, offset: 1088)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !55, line: 43, baseType: null)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !54, file: !55, line: 89, baseType: !92, size: 64, offset: 1152)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !78, line: 153, baseType: !79)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !54, file: !55, line: 91, baseType: !94, size: 64, offset: 1216)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !55, line: 37, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !54, file: !55, line: 92, baseType: !97, size: 64, offset: 1280)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !55, line: 38, flags: DIFlagFwdDecl)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !54, file: !55, line: 93, baseType: !73, size: 64, offset: 1344)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !54, file: !55, line: 94, baseType: !101, size: 64, offset: 1408)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !54, file: !55, line: 95, baseType: !103, size: 64, offset: 1472)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !104, line: 46, baseType: !105)
!104 = !DIFile(filename: "/u/NAS_SCRATCH/yc0769/xstack/xstack-installs/llvm-install-debug/lib/clang/10.0.1/include/stddef.h", directory: "")
!105 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !54, file: !55, line: 96, baseType: !28, size: 32, offset: 1536)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !54, file: !55, line: 98, baseType: !108, size: 160, offset: 1568)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 160, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 20)
!111 = !DILocation(line: 17, column: 10, scope: !112)
!112 = distinct !DILexicalBlock(scope: !14, file: !3, line: 17, column: 9)
!113 = !DILocation(line: 17, column: 9, scope: !14)
!114 = !DILocation(line: 19, column: 9, scope: !115)
!115 = distinct !DILexicalBlock(scope: !112, file: !3, line: 18, column: 5)
!116 = !DILocation(line: 20, column: 9, scope: !115)
!117 = !DILocalVariable(name: "tally", scope: !14, file: !3, line: 23, type: !118)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 288, elements: !20)
!119 = !DILocation(line: 23, column: 9, scope: !14)
!120 = !DILocalVariable(name: "total", scope: !14, file: !3, line: 25, type: !28)
!121 = !DILocation(line: 26, column: 5, scope: !14)
!122 = !DILocation(line: 26, column: 17, scope: !14)
!123 = !DILocalVariable(name: "c", scope: !14, file: !3, line: 24, type: !18)
!124 = !DILocation(line: 26, column: 12, scope: !14)
!125 = !DILocation(line: 26, column: 30, scope: !14)
!126 = !DILocation(line: 29, column: 9, scope: !127)
!127 = distinct !DILexicalBlock(scope: !14, file: !3, line: 27, column: 5)
!128 = !DILocation(line: 29, column: 16, scope: !127)
!129 = !DILocation(line: 29, column: 18, scope: !127)
!130 = !DILocation(line: 29, column: 24, scope: !127)
!131 = !DILocation(line: 29, column: 27, scope: !127)
!132 = !DILocation(line: 29, column: 29, scope: !127)
!133 = !DILocation(line: 30, column: 17, scope: !127)
!134 = distinct !{!134, !126, !135}
!135 = !DILocation(line: 30, column: 27, scope: !127)
!136 = !DILocation(line: 32, column: 15, scope: !127)
!137 = !DILocation(line: 32, column: 17, scope: !127)
!138 = !DILocation(line: 32, column: 9, scope: !127)
!139 = !DILocation(line: 32, column: 23, scope: !127)
!140 = !DILocation(line: 33, column: 14, scope: !127)
!141 = !DILocation(line: 36, column: 9, scope: !127)
!142 = !DILocation(line: 36, column: 21, scope: !127)
!143 = !DILocation(line: 36, column: 16, scope: !127)
!144 = !DILocation(line: 36, column: 34, scope: !127)
!145 = !DILocation(line: 36, column: 42, scope: !127)
!146 = !DILocation(line: 36, column: 45, scope: !127)
!147 = !DILocation(line: 36, column: 47, scope: !127)
!148 = !DILocation(line: 0, scope: !127)
!149 = distinct !{!149, !141, !150}
!150 = !DILocation(line: 37, column: 13, scope: !127)
!151 = distinct !{!151, !121, !152}
!152 = !DILocation(line: 38, column: 5, scope: !14)
!153 = !DILocation(line: 39, column: 5, scope: !14)
!154 = !DILocalVariable(name: "i", scope: !155, file: !3, line: 42, type: !28)
!155 = distinct !DILexicalBlock(scope: !14, file: !3, line: 42, column: 5)
!156 = !DILocation(line: 0, scope: !155)
!157 = !DILocation(line: 42, column: 10, scope: !155)
!158 = !DILocation(line: 42, column: 23, scope: !159)
!159 = distinct !DILexicalBlock(scope: !155, file: !3, line: 42, column: 5)
!160 = !DILocation(line: 42, column: 5, scope: !155)
!161 = !DILocation(line: 43, column: 19, scope: !159)
!162 = !DILocation(line: 43, column: 30, scope: !159)
!163 = !DILocation(line: 43, column: 28, scope: !159)
!164 = !DILocation(line: 43, column: 9, scope: !159)
!165 = !DILocation(line: 43, column: 17, scope: !159)
!166 = !DILocation(line: 42, column: 29, scope: !159)
!167 = !DILocation(line: 42, column: 5, scope: !159)
!168 = distinct !{!168, !160, !169}
!169 = !DILocation(line: 43, column: 38, scope: !155)
!170 = !DILocation(line: 45, column: 5, scope: !14)
!171 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 48, type: !172, scopeLine: 49, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !8, retainedNodes: !9)
!172 = !DISubroutineType(types: !173)
!173 = !{!28, !28, !174}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
