; ModuleID = 'benfords-law.c'
source_filename = "benfords-law.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@benford_distribution.prob = internal global [9 x float] zeroinitializer, align 16, !dbg !0
@.str = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.1 = private unnamed_addr constant [16 x i8] c"Can't open file\00", align 1
@get_actual_distribution.freq = internal global [9 x float] zeroinitializer, align 16, !dbg !12
@.str.2 = private unnamed_addr constant [23 x i8] c"Usage: benford <file>\0A\00", align 1
@.str.3 = private unnamed_addr constant [22 x i8] c"digit\09actual\09expected\00", align 1
@.str.4 = private unnamed_addr constant [14 x i8] c"%d\09%.3f\09%.3f\0A\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local float* @benford_distribution() #0 !dbg !2 {
entry:
  %i = alloca i32, align 4
  call void @llvm.dbg.declare(metadata i32* %i, metadata !26, metadata !DIExpression()), !dbg !29
  store i32 1, i32* %i, align 4, !dbg !29
  br label %for.cond, !dbg !30


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "prob", scope: !2, file: !3, line: 7, type: !19, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "benford_distribution", scope: !3, file: !3, line: 5, type: !4, scopeLine: 6, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !8, retainedNodes: !9)
!3 = !DIFile(filename: "benfords-law.c", directory: "/scratch/yc0769/xstack_benchmark/rosetta/Benfords-law")
!4 = !DISubroutineType(types: !5)
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!8 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git 078de928eea94413164fbdff5fab7bdcf0f60aa7)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !9, retainedTypes: !10, globals: !11, splitDebugInlining: false, nameTableKind: None)
!9 = !{}
!10 = !{!7}
!11 = !{!0, !12}
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "freq", scope: !14, file: !3, line: 41, type: !19, isLocal: true, isDefinition: true)
!14 = distinct !DISubprogram(name: "get_actual_distribution", scope: !3, file: !3, line: 14, type: !15, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !8, retainedNodes: !9)
!15 = !DISubroutineType(types: !16)
!16 = !{!6, !17}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 288, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 9)
!22 = !{i32 7, !"Dwarf Version", i32 4}
!23 = !{i32 2, !"Debug Info Version", i32 3}
!24 = !{i32 1, !"wchar_size", i32 4}
!25 = !{!"clang version 10.0.1 (https://github.com/SusanTan/llvm-project.git 078de928eea94413164fbdff5fab7bdcf0f60aa7)"}
!26 = !DILocalVariable(name: "i", scope: !27, file: !3, line: 8, type: !28)
!27 = distinct !DILexicalBlock(scope: !2, file: !3, line: 8, column: 5)
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !DILocation(line: 8, column: 14, scope: !27)
!30 = !DILocation(line: 8, column: 10, scope: !27)
!31 = !DILocation(line: 8, column: 21, scope: !32)
!32 = distinct !DILexicalBlock(scope: !27, file: !3, line: 8, column: 5)
!33 = !DILocation(line: 8, column: 23, scope: !32)
!34 = !DILocation(line: 8, column: 5, scope: !27)
!35 = !DILocation(line: 9, column: 40, scope: !32)
!36 = !DILocation(line: 9, column: 38, scope: !32)
!37 = !DILocation(line: 9, column: 32, scope: !32)
!38 = !DILocation(line: 9, column: 30, scope: !32)
!39 = !DILocation(line: 9, column: 23, scope: !32)
!40 = !DILocation(line: 9, column: 14, scope: !32)
!41 = !DILocation(line: 9, column: 16, scope: !32)
!42 = !DILocation(line: 9, column: 9, scope: !32)
!43 = !DILocation(line: 9, column: 21, scope: !32)
!44 = !DILocation(line: 8, column: 30, scope: !32)
!45 = !DILocation(line: 8, column: 5, scope: !32)
!46 = distinct !{!46, !34, !47}
!47 = !DILocation(line: 9, column: 41, scope: !27)
!48 = !DILocation(line: 11, column: 5, scope: !2)
!49 = !DILocalVariable(name: "fn", arg: 1, scope: !14, file: !3, line: 14, type: !17)
!50 = !DILocation(line: 14, column: 38, scope: !14)
!51 = !DILocalVariable(name: "input", scope: !14, file: !3, line: 16, type: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !54, line: 7, baseType: !55)
!54 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !56, line: 49, size: 1728, elements: !57)
!56 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !73, !75, !76, !77, !81, !83, !85, !89, !92, !94, !97, !100, !101, !103, !107, !108}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !55, file: !56, line: 51, baseType: !28, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !55, file: !56, line: 54, baseType: !17, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !55, file: !56, line: 55, baseType: !17, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !55, file: !56, line: 56, baseType: !17, size: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !55, file: !56, line: 57, baseType: !17, size: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !55, file: !56, line: 58, baseType: !17, size: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !55, file: !56, line: 59, baseType: !17, size: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !55, file: !56, line: 60, baseType: !17, size: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !55, file: !56, line: 61, baseType: !17, size: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !55, file: !56, line: 64, baseType: !17, size: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !55, file: !56, line: 65, baseType: !17, size: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !55, file: !56, line: 66, baseType: !17, size: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !55, file: !56, line: 68, baseType: !71, size: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !56, line: 36, flags: DIFlagFwdDecl)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !55, file: !56, line: 70, baseType: !74, size: 64, offset: 832)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !55, file: !56, line: 72, baseType: !28, size: 32, offset: 896)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !55, file: !56, line: 73, baseType: !28, size: 32, offset: 928)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !55, file: !56, line: 74, baseType: !78, size: 64, offset: 960)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !79, line: 152, baseType: !80)
!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!80 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !55, file: !56, line: 77, baseType: !82, size: 16, offset: 1024)
!82 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !55, file: !56, line: 78, baseType: !84, size: 8, offset: 1040)
!84 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !55, file: !56, line: 79, baseType: !86, size: 8, offset: 1048)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 1)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !55, file: !56, line: 81, baseType: !90, size: 64, offset: 1088)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !56, line: 43, baseType: null)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !55, file: !56, line: 89, baseType: !93, size: 64, offset: 1152)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !79, line: 153, baseType: !80)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !55, file: !56, line: 91, baseType: !95, size: 64, offset: 1216)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !56, line: 37, flags: DIFlagFwdDecl)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !55, file: !56, line: 92, baseType: !98, size: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !56, line: 38, flags: DIFlagFwdDecl)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !55, file: !56, line: 93, baseType: !74, size: 64, offset: 1344)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !55, file: !56, line: 94, baseType: !102, size: 64, offset: 1408)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !55, file: !56, line: 95, baseType: !104, size: 64, offset: 1472)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !105, line: 46, baseType: !106)
!105 = !DIFile(filename: "/u/NAS_SCRATCH/yc0769/xstack/llvm-install/lib/clang/10.0.1/include/stddef.h", directory: "")
!106 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !55, file: !56, line: 96, baseType: !28, size: 32, offset: 1536)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !55, file: !56, line: 98, baseType: !109, size: 160, offset: 1568)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 160, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 20)
!112 = !DILocation(line: 16, column: 11, scope: !14)
!113 = !DILocation(line: 16, column: 25, scope: !14)
!114 = !DILocation(line: 16, column: 19, scope: !14)
!115 = !DILocation(line: 17, column: 10, scope: !116)
!116 = distinct !DILexicalBlock(scope: !14, file: !3, line: 17, column: 9)
!117 = !DILocation(line: 17, column: 9, scope: !14)
!118 = !{!"if"}
!119 = !DILocation(line: 19, column: 9, scope: !120)
!120 = distinct !DILexicalBlock(scope: !116, file: !3, line: 18, column: 5)
!121 = !DILocation(line: 20, column: 9, scope: !120)
!122 = !DILocalVariable(name: "tally", scope: !14, file: !3, line: 23, type: !123)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 288, elements: !20)
!124 = !DILocation(line: 23, column: 9, scope: !14)
!125 = !DILocalVariable(name: "c", scope: !14, file: !3, line: 24, type: !18)
!126 = !DILocation(line: 24, column: 10, scope: !14)
!127 = !DILocalVariable(name: "total", scope: !14, file: !3, line: 25, type: !28)
!128 = !DILocation(line: 25, column: 9, scope: !14)
!129 = !DILocation(line: 26, column: 5, scope: !14)
!130 = !DILocation(line: 26, column: 22, scope: !14)
!131 = !DILocation(line: 26, column: 17, scope: !14)
!132 = !DILocation(line: 26, column: 15, scope: !14)
!133 = !DILocation(line: 26, column: 12, scope: !14)
!134 = !DILocation(line: 26, column: 30, scope: !14)
!135 = !DILocation(line: 29, column: 9, scope: !136)
!136 = distinct !DILexicalBlock(scope: !14, file: !3, line: 27, column: 5)
!137 = !DILocation(line: 29, column: 16, scope: !136)
!138 = !DILocation(line: 29, column: 18, scope: !136)
!139 = !DILocation(line: 29, column: 24, scope: !136)
!140 = !DILocation(line: 29, column: 27, scope: !136)
!141 = !DILocation(line: 29, column: 29, scope: !136)
!142 = !DILocation(line: 30, column: 22, scope: !136)
!143 = !DILocation(line: 30, column: 17, scope: !136)
!144 = !DILocation(line: 30, column: 15, scope: !136)
!145 = distinct !{!145, !135, !146}
!146 = !DILocation(line: 30, column: 27, scope: !136)
!147 = !DILocation(line: 32, column: 15, scope: !136)
!148 = !DILocation(line: 32, column: 17, scope: !136)
!149 = !DILocation(line: 32, column: 9, scope: !136)
!150 = !DILocation(line: 32, column: 23, scope: !136)
!151 = !DILocation(line: 33, column: 14, scope: !136)
!152 = !DILocation(line: 36, column: 9, scope: !136)
!153 = !DILocation(line: 36, column: 26, scope: !136)
!154 = !DILocation(line: 36, column: 21, scope: !136)
!155 = !DILocation(line: 36, column: 19, scope: !136)
!156 = !DILocation(line: 36, column: 16, scope: !136)
!157 = !DILocation(line: 36, column: 34, scope: !136)
!158 = !DILocation(line: 36, column: 42, scope: !136)
!159 = !DILocation(line: 36, column: 45, scope: !136)
!160 = !DILocation(line: 36, column: 47, scope: !136)
!161 = !DILocation(line: 0, scope: !136)
!162 = distinct !{!162, !152, !163}
!163 = !DILocation(line: 37, column: 13, scope: !136)
!164 = distinct !{!164, !129, !165}
!165 = !DILocation(line: 38, column: 5, scope: !14)
!166 = !DILocation(line: 39, column: 12, scope: !14)
!167 = !DILocation(line: 39, column: 5, scope: !14)
!168 = !DILocalVariable(name: "i", scope: !169, file: !3, line: 42, type: !28)
!169 = distinct !DILexicalBlock(scope: !14, file: !3, line: 42, column: 5)
!170 = !DILocation(line: 42, column: 14, scope: !169)
!171 = !DILocation(line: 42, column: 10, scope: !169)
!172 = !DILocation(line: 42, column: 21, scope: !173)
!173 = distinct !DILexicalBlock(scope: !169, file: !3, line: 42, column: 5)
!174 = !DILocation(line: 42, column: 23, scope: !173)
!175 = !DILocation(line: 42, column: 5, scope: !169)
!176 = !DILocation(line: 43, column: 25, scope: !173)
!177 = !DILocation(line: 43, column: 19, scope: !173)
!178 = !DILocation(line: 43, column: 38, scope: !173)
