; ModuleID = 'discordian-date.c'
source_filename = "discordian-date.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }

@.str = private unnamed_addr constant [23 x i8] c"St. Tib's Day, YOLD %d\00", align 1
@.str.1 = private unnamed_addr constant [19 x i8] c"%s, %s %d, YOLD %d\00", align 1
@.str.2 = private unnamed_addr constant [10 x i8] c"Sweetmorn\00", align 1
@.str.3 = private unnamed_addr constant [9 x i8] c"Boomtime\00", align 1
@.str.4 = private unnamed_addr constant [10 x i8] c"Pungenday\00", align 1
@.str.5 = private unnamed_addr constant [16 x i8] c"Prickle-Prickle\00", align 1
@.str.6 = private unnamed_addr constant [15 x i8] c"Setting Orange\00", align 1
@.str.7 = private unnamed_addr constant [6 x i8] c"Chaos\00", align 1
@.str.8 = private unnamed_addr constant [8 x i8] c"Discord\00", align 1
@.str.9 = private unnamed_addr constant [10 x i8] c"Confusion\00", align 1
@.str.10 = private unnamed_addr constant [12 x i8] c"Bureaucracy\00", align 1
@.str.11 = private unnamed_addr constant [14 x i8] c"The Aftermath\00", align 1
@__const.day_of_year.month_lengths = private unnamed_addr constant [12 x i32] [i32 31, i32 28, i32 31, i32 30, i32 31, i32 30, i32 31, i32 31, i32 30, i32 31, i32 30, i32 31], align 16

; Function Attrs: noinline nounwind uwtable

!22 = !DILocation(line: 23, column: 10, scope: !7)
!23 = !DILocation(line: 23, column: 19, scope: !7)
!24 = !DILocation(line: 25, column: 7, scope: !25)
!25 = distinct !DILexicalBlock(scope: !7, file: !1, line: 25, column: 7)
!26 = !{!"if"}
!27 = !DILocation(line: 25, column: 7, scope: !7)
!28 = !DILocation(line: 26, column: 9, scope: !29)
!29 = distinct !DILexicalBlock(scope: !30, file: !1, line: 26, column: 9)
!30 = distinct !DILexicalBlock(scope: !25, file: !1, line: 25, column: 23)
!31 = !DILocation(line: 26, column: 11, scope: !29)
!32 = !DILocation(line: 26, column: 9, scope: !30)
!33 = !DILocation(line: 27, column: 16, scope: !34)
!34 = distinct !DILexicalBlock(scope: !29, file: !1, line: 26, column: 18)
!35 = !DILocation(line: 27, column: 50, scope: !34)
!36 = !DILocation(line: 27, column: 7, scope: !34)
!37 = !DILocation(line: 28, column: 14, scope: !34)
!38 = !DILocation(line: 28, column: 7, scope: !34)
!39 = !DILocation(line: 29, column: 16, scope: !40)
!40 = distinct !DILexicalBlock(scope: !29, file: !1, line: 29, column: 16)
!41 = !DILocation(line: 29, column: 18, scope: !40)
!42 = !DILocation(line: 29, column: 16, scope: !29)
!43 = !DILocation(line: 30, column: 7, scope: !44)
!44 = distinct !DILexicalBlock(scope: !40, file: !1, line: 29, column: 25)
!45 = !DILocation(line: 31, column: 5, scope: !44)
!46 = !DILocation(line: 32, column: 3, scope: !30)
!47 = !DILocation(line: 34, column: 12, scope: !7)
!48 = !DILocation(line: 35, column: 12, scope: !7)
!49 = !DILocation(line: 35, column: 30, scope: !7)
!50 = !DILocation(line: 35, column: 61, scope: !7)
!51 = !DILocation(line: 35, column: 72, scope: !7)
!52 = !DILocation(line: 34, column: 3, scope: !7)
!53 = !DILocation(line: 37, column: 10, scope: !7)
!54 = !DILocation(line: 37, column: 3, scope: !7)
!55 = !DILocation(line: 38, column: 1, scope: !7)
!56 = distinct !DISubprogram(name: "day_of_year", scope: !1, file: !1, line: 41, type: !57, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!57 = !DISubroutineType(types: !58)
!58 = !{!12, !12, !12, !12}
!59 = !DILocalVariable(name: "y", arg: 1, scope: !56, file: !1, line: 41, type: !12)
!60 = !DILocation(line: 41, column: 22, scope: !56)
!61 = !DILocalVariable(name: "m", arg: 2, scope: !56, file: !1, line: 41, type: !12)
!62 = !DILocation(line: 41, column: 29, scope: !56)
!63 = !DILocalVariable(name: "d", arg: 3, scope: !56, file: !1, line: 41, type: !12)
!64 = !DILocation(line: 41, column: 36, scope: !56)
!65 = !DILocalVariable(name: "month_lengths", scope: !56, file: !1, line: 42, type: !66)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 384, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 12)
!69 = !DILocation(line: 42, column: 7, scope: !56)
!70 = !DILocation(line: 44, column: 3, scope: !56)
!71 = !DILocation(line: 44, column: 10, scope: !72)
!72 = distinct !DILexicalBlock(scope: !73, file: !1, line: 44, column: 3)
!73 = distinct !DILexicalBlock(scope: !56, file: !1, line: 44, column: 3)
!74 = !DILocation(line: 44, column: 12, scope: !72)
!75 = !DILocation(line: 44, column: 3, scope: !73)
!76 = !DILocation(line: 45, column: 25, scope: !77)
!77 = distinct !DILexicalBlock(scope: !72, file: !1, line: 44, column: 23)
!78 = !DILocation(line: 45, column: 27, scope: !77)
!79 = !DILocation(line: 45, column: 10, scope: !77)
!80 = !DILocation(line: 45, column: 7, scope: !77)
!81 = !DILocation(line: 46, column: 9, scope: !82)
!82 = distinct !DILexicalBlock(scope: !77, file: !1, line: 46, column: 9)
!83 = !DILocation(line: 46, column: 11, scope: !82)
!84 = !DILocation(line: 46, column: 16, scope: !82)
!85 = !DILocation(line: 46, column: 19, scope: !82)
!86 = !DILocation(line: 46, column: 9, scope: !77)
!87 = !DILocation(line: 47, column: 7, scope: !88)
!88 = distinct !DILexicalBlock(scope: !82, file: !1, line: 46, column: 35)
!89 = !DILocation(line: 48, column: 5, scope: !88)
!90 = !DILocation(line: 49, column: 3, scope: !77)
!91 = !DILocation(line: 44, column: 19, scope: !72)
!92 = !DILocation(line: 44, column: 3, scope: !72)
!93 = distinct !{!93, !75, !94}
!94 = !DILocation(line: 49, column: 3, scope: !73)
!95 = !DILocation(line: 50, column: 10, scope: !56)
!96 = !DILocation(line: 50, column: 3, scope: !56)
!97 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 54, type: !98, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!98 = !DISubroutineType(types: !99)
!99 = !{!12, !12, !100}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!101 = !DILocalVariable(name: "argc", arg: 1, scope: !97, file: !1, line: 54, type: !12)
!102 = !DILocation(line: 54, column: 15, scope: !97)
!103 = !DILocalVariable(name: "argv", arg: 2, scope: !97, file: !1, line: 54, type: !100)
!104 = !DILocation(line: 54, column: 28, scope: !97)
!105 = !DILocalVariable(name: "now", scope: !97, file: !1, line: 55, type: !106)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !107, line: 7, baseType: !108)
!107 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !109, line: 160, baseType: !110)
!109 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!110 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!111 = !DILocation(line: 55, column: 10, scope: !97)
!112 = !DILocalVariable(name: "now_time", scope: !97, file: !1, line: 56, type: !113)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !115, line: 7, size: 448, elements: !116)
!115 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "")
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !114, file: !115, line: 9, baseType: !12, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !114, file: !115, line: 10, baseType: !12, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !114, file: !115, line: 11, baseType: !12, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !114, file: !115, line: 12, baseType: !12, size: 32, offset: 96)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !114, file: !115, line: 13, baseType: !12, size: 32, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !114, file: !115, line: 14, baseType: !12, size: 32, offset: 160)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !114, file: !115, line: 15, baseType: !12, size: 32, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !114, file: !115, line: 16, baseType: !12, size: 32, offset: 224)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !114, file: !115, line: 17, baseType: !12, size: 32, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !114, file: !115, line: 20, baseType: !110, size: 64, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !114, file: !115, line: 21, baseType: !128, size: 64, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!130 = !DILocation(line: 56, column: 15, scope: !97)
!131 = !DILocalVariable(name: "year", scope: !97, file: !1, line: 57, type: !12)
!132 = !DILocation(line: 57, column: 7, scope: !97)
!133 = !DILocalVariable(name: "doy", scope: !97, file: !1, line: 57, type: !12)
!134 = !DILocation(line: 57, column: 13, scope: !97)
!135 = !DILocation(line: 59, column: 7, scope: !136)
!136 = distinct !DILexicalBlock(scope: !97, file: !1, line: 59, column: 7)
!137 = !DILocation(line: 59, column: 12, scope: !136)
!138 = !DILocation(line: 59, column: 7, scope: !97)
!139 = !DILocation(line: 60, column: 11, scope: !140)
!140 = distinct !DILexicalBlock(scope: !136, file: !1, line: 59, column: 18)
!141 = !DILocation(line: 60, column: 9, scope: !140)
!142 = !DILocation(line: 61, column: 16, scope: !140)
!143 = !DILocation(line: 61, column: 14, scope: !140)
!144 = !DILocation(line: 62, column: 12, scope: !140)
!145 = !DILocation(line: 62, column: 22, scope: !140)
!146 = !DILocation(line: 62, column: 30, scope: !140)
!147 = !DILocation(line: 62, column: 10, scope: !140)
!148 = !DILocation(line: 62, column: 44, scope: !140)
!149 = !DILocation(line: 62, column: 54, scope: !140)
!150 = !DILocation(line: 62, column: 62, scope: !140)
!151 = !DILocation(line: 62, column: 42, scope: !140)
!152 = !DILocation(line: 63, column: 3, scope: !140)
!153 = !DILocation(line: 63, column: 14, scope: !154)
!154 = distinct !DILexicalBlock(scope: !136, file: !1, line: 63, column: 14)
!155 = !DILocation(line: 63, column: 19, scope: !154)
!156 = !DILocation(line: 63, column: 14, scope: !136)
!157 = !DILocation(line: 64, column: 18, scope: !158)
!158 = distinct !DILexicalBlock(scope: !154, file: !1, line: 63, column: 25)
!159 = !DILocation(line: 64, column: 12, scope: !158)
!160 = !DILocation(line: 64, column: 10, scope: !158)
!161 = !DILocation(line: 64, column: 56, scope: !158)
!162 = !DILocation(line: 64, column: 50, scope: !158)
!163 = !DILocation(line: 64, column: 75, scope: !158)
!164 = !DILocation(line: 64, column: 69, scope: !158)
!165 = !DILocation(line: 64, column: 94, scope: !158)
!166 = !DILocation(line: 64, column: 88, scope: !158)
!167 = !DILocation(line: 64, column: 37, scope: !158)
!168 = !DILocation(line: 64, column: 35, scope: !158)
!169 = !DILocation(line: 65, column: 3, scope: !158)
!170 = !DILocalVariable(name: "result", scope: !97, file: !1, line: 67, type: !10)
!171 = !DILocation(line: 67, column: 10, scope: !97)
!172 = !DILocation(line: 67, column: 26, scope: !97)
!173 = !DILocation(line: 67, column: 32, scope: !97)
!174 = !DILocation(line: 67, column: 19, scope: !97)
!175 = !DILocation(line: 68, column: 9, scope: !97)
!176 = !DILocation(line: 68, column: 3, scope: !97)
!177 = !DILocation(line: 69, column: 9, scope: !97)
!178 = !DILocation(line: 69, column: 3, scope: !97)
!179 = !DILocation(line: 71, column: 3, scope: !97)
