; ModuleID = 'discordian-date.bc'
source_filename = "discordian-date.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }

@.str = private unnamed_addr constant [23 x i8] c"St. Tib's Day, YOLD %d\00", align 1
@.str.1 = private unnamed_addr constant [19 x i8] c"%s, %s %d, YOLD %d\00", align 1
@.str.2 = private unnamed_addr constant [10 x i8] c"Sweetmorn\00", align 1
@.str.3 = private unnamed_addr constant [9 x i8] c"Boomtime\00", align 1
@.str.4 = private unnamed_addr constant [10 x i8] c"Pungenday\00", align 1
@.str.5 = private unnamed_addr constant [16 x i8] c"Prickle-Prickle\00", align 1
@.str.6 = private unnamed_addr constant [15 x i8] c"Setting Orange\00", align 1
@.str.7 = private unnamed_addr constant [6 x i8] c"Chaos\00", align 1
@.str.8 = private unnamed_addr constant [8 x i8] c"Discord\00", align 1
@.str.9 = private unnamed_addr constant [10 x i8] c"Confusion\00", align 1
@.str.10 = private unnamed_addr constant [12 x i8] c"Bureaucracy\00", align 1
@.str.11 = private unnamed_addr constant [14 x i8] c"The Aftermath\00", align 1
@__const.day_of_year.month_lengths = private unnamed_addr constant [12 x i32] [i32 31, i32 28, i32 31, i32 30, i32 31, i32 30, i32 31, i32 31, i32 30, i32 31, i32 30, i32 31], align 16

; Function Attrs: noinline nounwind uwtable

!22 = !DILocation(line: 23, column: 10, scope: !7)
!23 = !DILocation(line: 23, column: 19, scope: !7)
!24 = !DILocation(line: 25, column: 7, scope: !25)
!25 = distinct !DILexicalBlock(scope: !7, file: !1, line: 25, column: 7)
!26 = !DILocation(line: 25, column: 7, scope: !7)
!27 = !DILocation(line: 26, column: 9, scope: !28)
!28 = distinct !DILexicalBlock(scope: !29, file: !1, line: 26, column: 9)
!29 = distinct !DILexicalBlock(scope: !25, file: !1, line: 25, column: 23)
!30 = !DILocation(line: 26, column: 11, scope: !28)
!31 = !DILocation(line: 26, column: 9, scope: !29)
!32 = !DILocation(line: 27, column: 16, scope: !33)
!33 = distinct !DILexicalBlock(scope: !28, file: !1, line: 26, column: 18)
!34 = !DILocation(line: 27, column: 50, scope: !33)
!35 = !DILocation(line: 27, column: 7, scope: !33)
!36 = !DILocation(line: 28, column: 14, scope: !33)
!37 = !DILocation(line: 28, column: 7, scope: !33)
!38 = !DILocation(line: 29, column: 16, scope: !39)
!39 = distinct !DILexicalBlock(scope: !28, file: !1, line: 29, column: 16)
!40 = !DILocation(line: 29, column: 18, scope: !39)
!41 = !DILocation(line: 29, column: 16, scope: !28)
!42 = !DILocation(line: 30, column: 7, scope: !43)
!43 = distinct !DILexicalBlock(scope: !39, file: !1, line: 29, column: 25)
!44 = !DILocation(line: 31, column: 5, scope: !43)
!45 = !DILocation(line: 32, column: 3, scope: !29)
!46 = !DILocation(line: 34, column: 12, scope: !7)
!47 = !DILocation(line: 35, column: 12, scope: !7)
!48 = !DILocation(line: 35, column: 30, scope: !7)
!49 = !DILocation(line: 35, column: 61, scope: !7)
!50 = !DILocation(line: 35, column: 72, scope: !7)
!51 = !DILocation(line: 34, column: 3, scope: !7)
!52 = !DILocation(line: 37, column: 10, scope: !7)
!53 = !DILocation(line: 37, column: 3, scope: !7)
!54 = !DILocation(line: 38, column: 1, scope: !7)
!55 = distinct !DISubprogram(name: "day_of_year", scope: !1, file: !1, line: 41, type: !56, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!56 = !DISubroutineType(types: !57)
!57 = !{!12, !12, !12, !12}
!58 = !DILocalVariable(name: "y", arg: 1, scope: !55, file: !1, line: 41, type: !12)
!59 = !DILocation(line: 41, column: 22, scope: !55)
!60 = !DILocalVariable(name: "m", arg: 2, scope: !55, file: !1, line: 41, type: !12)
!61 = !DILocation(line: 41, column: 29, scope: !55)
!62 = !DILocalVariable(name: "d", arg: 3, scope: !55, file: !1, line: 41, type: !12)
!63 = !DILocation(line: 41, column: 36, scope: !55)
!64 = !DILocalVariable(name: "month_lengths", scope: !55, file: !1, line: 42, type: !65)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 384, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 12)
!68 = !DILocation(line: 42, column: 7, scope: !55)
!69 = !DILocation(line: 44, column: 3, scope: !55)
!70 = !DILocation(line: 44, column: 10, scope: !71)
!71 = distinct !DILexicalBlock(scope: !72, file: !1, line: 44, column: 3)
!72 = distinct !DILexicalBlock(scope: !55, file: !1, line: 44, column: 3)
!73 = !DILocation(line: 44, column: 12, scope: !71)
!74 = !DILocation(line: 44, column: 3, scope: !72)
!75 = !DILocation(line: 45, column: 25, scope: !76)
!76 = distinct !DILexicalBlock(scope: !71, file: !1, line: 44, column: 23)
!77 = !DILocation(line: 45, column: 27, scope: !76)
!78 = !DILocation(line: 45, column: 10, scope: !76)
!79 = !DILocation(line: 45, column: 7, scope: !76)
!80 = !DILocation(line: 46, column: 9, scope: !81)
!81 = distinct !DILexicalBlock(scope: !76, file: !1, line: 46, column: 9)
!82 = !DILocation(line: 46, column: 11, scope: !81)
!83 = !DILocation(line: 46, column: 16, scope: !81)
!84 = !DILocation(line: 46, column: 19, scope: !81)
!85 = !DILocation(line: 46, column: 9, scope: !76)
!86 = !DILocation(line: 47, column: 7, scope: !87)
!87 = distinct !DILexicalBlock(scope: !81, file: !1, line: 46, column: 35)
!88 = !DILocation(line: 48, column: 5, scope: !87)
!89 = !DILocation(line: 49, column: 3, scope: !76)
!90 = !DILocation(line: 44, column: 19, scope: !71)
!91 = !DILocation(line: 44, column: 3, scope: !71)
!92 = distinct !{!92, !74, !93}
!93 = !DILocation(line: 49, column: 3, scope: !72)
!94 = !DILocation(line: 50, column: 10, scope: !55)
!95 = !DILocation(line: 50, column: 3, scope: !55)
!96 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 54, type: !97, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!97 = !DISubroutineType(types: !98)
!98 = !{!12, !12, !99}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!100 = !DILocalVariable(name: "argc", arg: 1, scope: !96, file: !1, line: 54, type: !12)
!101 = !DILocation(line: 54, column: 15, scope: !96)
!102 = !DILocalVariable(name: "argv", arg: 2, scope: !96, file: !1, line: 54, type: !99)
!103 = !DILocation(line: 54, column: 28, scope: !96)
!104 = !DILocalVariable(name: "now", scope: !96, file: !1, line: 55, type: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !106, line: 7, baseType: !107)
!106 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !108, line: 160, baseType: !109)
!108 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!109 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!110 = !DILocation(line: 55, column: 10, scope: !96)
!111 = !DILocalVariable(name: "now_time", scope: !96, file: !1, line: 56, type: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !114, line: 7, size: 448, elements: !115)
!114 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "")
!115 = !{!116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !113, file: !114, line: 9, baseType: !12, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !113, file: !114, line: 10, baseType: !12, size: 32, offset: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !113, file: !114, line: 11, baseType: !12, size: 32, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !113, file: !114, line: 12, baseType: !12, size: 32, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !113, file: !114, line: 13, baseType: !12, size: 32, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !113, file: !114, line: 14, baseType: !12, size: 32, offset: 160)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !113, file: !114, line: 15, baseType: !12, size: 32, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !113, file: !114, line: 16, baseType: !12, size: 32, offset: 224)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !113, file: !114, line: 17, baseType: !12, size: 32, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !113, file: !114, line: 20, baseType: !109, size: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !113, file: !114, line: 21, baseType: !127, size: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!129 = !DILocation(line: 56, column: 15, scope: !96)
!130 = !DILocalVariable(name: "year", scope: !96, file: !1, line: 57, type: !12)
!131 = !DILocation(line: 57, column: 7, scope: !96)
!132 = !DILocalVariable(name: "doy", scope: !96, file: !1, line: 57, type: !12)
!133 = !DILocation(line: 57, column: 13, scope: !96)
!134 = !DILocation(line: 59, column: 7, scope: !135)
!135 = distinct !DILexicalBlock(scope: !96, file: !1, line: 59, column: 7)
!136 = !DILocation(line: 59, column: 12, scope: !135)
!137 = !DILocation(line: 59, column: 7, scope: !96)
!138 = !DILocation(line: 60, column: 11, scope: !139)
!139 = distinct !DILexicalBlock(scope: !135, file: !1, line: 59, column: 18)
!140 = !DILocation(line: 60, column: 9, scope: !139)
!141 = !DILocation(line: 61, column: 16, scope: !139)
!142 = !DILocation(line: 61, column: 14, scope: !139)
!143 = !DILocation(line: 62, column: 12, scope: !139)
!144 = !DILocation(line: 62, column: 22, scope: !139)
!145 = !DILocation(line: 62, column: 30, scope: !139)
!146 = !DILocation(line: 62, column: 10, scope: !139)
!147 = !DILocation(line: 62, column: 44, scope: !139)
!148 = !DILocation(line: 62, column: 54, scope: !139)
!149 = !DILocation(line: 62, column: 62, scope: !139)
!150 = !DILocation(line: 62, column: 42, scope: !139)
!151 = !DILocation(line: 63, column: 3, scope: !139)
!152 = !DILocation(line: 63, column: 14, scope: !153)
!153 = distinct !DILexicalBlock(scope: !135, file: !1, line: 63, column: 14)
!154 = !DILocation(line: 63, column: 19, scope: !153)
!155 = !DILocation(line: 63, column: 14, scope: !135)
!156 = !DILocation(line: 64, column: 18, scope: !157)
!157 = distinct !DILexicalBlock(scope: !153, file: !1, line: 63, column: 25)
!158 = !DILocation(line: 64, column: 12, scope: !157)
!159 = !DILocation(line: 64, column: 10, scope: !157)
!160 = !DILocation(line: 64, column: 56, scope: !157)
!161 = !DILocation(line: 64, column: 50, scope: !157)
!162 = !DILocation(line: 64, column: 75, scope: !157)
!163 = !DILocation(line: 64, column: 69, scope: !157)
!164 = !DILocation(line: 64, column: 94, scope: !157)
!165 = !DILocation(line: 64, column: 88, scope: !157)
!166 = !DILocation(line: 64, column: 37, scope: !157)
!167 = !DILocation(line: 64, column: 35, scope: !157)
!168 = !DILocation(line: 65, column: 3, scope: !157)
!169 = !DILocalVariable(name: "result", scope: !96, file: !1, line: 67, type: !10)
!170 = !DILocation(line: 67, column: 10, scope: !96)
!171 = !DILocation(line: 67, column: 26, scope: !96)
!172 = !DILocation(line: 67, column: 32, scope: !96)
!173 = !DILocation(line: 67, column: 19, scope: !96)
!174 = !DILocation(line: 68, column: 9, scope: !96)
!175 = !DILocation(line: 68, column: 3, scope: !96)
!176 = !DILocation(line: 69, column: 9, scope: !96)
!177 = !DILocation(line: 69, column: 3, scope: !96)
!178 = !DILocation(line: 71, column: 3, scope: !96)
