; ModuleID = 'discordian-date.ll'
source_filename = "discordian-date.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }

@.str = private unnamed_addr constant [23 x i8] c"St. Tib's Day, YOLD %d\00", align 1
@.str.1 = private unnamed_addr constant [19 x i8] c"%s, %s %d, YOLD %d\00", align 1
@.str.2 = private unnamed_addr constant [10 x i8] c"Sweetmorn\00", align 1
@.str.3 = private unnamed_addr constant [9 x i8] c"Boomtime\00", align 1
@.str.4 = private unnamed_addr constant [10 x i8] c"Pungenday\00", align 1
@.str.5 = private unnamed_addr constant [16 x i8] c"Prickle-Prickle\00", align 1
@.str.6 = private unnamed_addr constant [15 x i8] c"Setting Orange\00", align 1
@.str.7 = private unnamed_addr constant [6 x i8] c"Chaos\00", align 1
@.str.8 = private unnamed_addr constant [8 x i8] c"Discord\00", align 1
@.str.9 = private unnamed_addr constant [10 x i8] c"Confusion\00", align 1
@.str.10 = private unnamed_addr constant [12 x i8] c"Bureaucracy\00", align 1
@.str.11 = private unnamed_addr constant [14 x i8] c"The Aftermath\00", align 1
@__const.day_of_year.month_lengths = private unnamed_addr constant [12 x i32] [i32 31, i32 28, i32 31, i32 30, i32 31, i32 30, i32 31, i32 31, i32 30, i32 31, i32 30, i32 31], align 16

; Function Attrs: noinline nounwind uwtable

!13 = !DILocalVariable(name: "y", arg: 1, scope: !7, file: !1, line: 21, type: !12)
!14 = !DILocation(line: 0, scope: !7)
!15 = !DILocalVariable(name: "d", arg: 2, scope: !7, file: !1, line: 21, type: !12)
!16 = !DILocation(line: 22, column: 20, scope: !7)
!17 = !DILocalVariable(name: "dyear", scope: !7, file: !1, line: 22, type: !12)
!18 = !DILocation(line: 23, column: 19, scope: !7)
!19 = !DILocalVariable(name: "result", scope: !7, file: !1, line: 23, type: !10)
!20 = !DILocation(line: 25, column: 7, scope: !21)
!21 = distinct !DILexicalBlock(scope: !7, file: !1, line: 25, column: 7)
!22 = !DILocation(line: 25, column: 7, scope: !7)
!23 = !DILocation(line: 26, column: 11, scope: !24)
!24 = distinct !DILexicalBlock(scope: !25, file: !1, line: 26, column: 9)
!25 = distinct !DILexicalBlock(scope: !21, file: !1, line: 25, column: 23)
!26 = !DILocation(line: 26, column: 9, scope: !25)
!27 = !DILocation(line: 27, column: 7, scope: !28)
!28 = distinct !DILexicalBlock(scope: !24, file: !1, line: 26, column: 18)
!29 = !DILocation(line: 28, column: 7, scope: !28)
!30 = !DILocation(line: 29, column: 18, scope: !31)
!31 = distinct !DILexicalBlock(scope: !24, file: !1, line: 29, column: 16)
!32 = !DILocation(line: 29, column: 16, scope: !24)
!33 = !DILocation(line: 30, column: 7, scope: !34)
!34 = distinct !DILexicalBlock(scope: !31, file: !1, line: 29, column: 25)
!35 = !DILocation(line: 31, column: 5, scope: !34)
!36 = !DILocation(line: 32, column: 3, scope: !25)
!37 = !DILocation(line: 35, column: 12, scope: !7)
!38 = !DILocation(line: 35, column: 30, scope: !7)
!39 = !DILocation(line: 35, column: 61, scope: !7)
!40 = !DILocation(line: 34, column: 3, scope: !7)
!41 = !DILocation(line: 37, column: 3, scope: !7)
!42 = !DILocation(line: 38, column: 1, scope: !7)
!43 = distinct !DISubprogram(name: "day_of_year", scope: !1, file: !1, line: 41, type: !44, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!44 = !DISubroutineType(types: !45)
!45 = !{!12, !12, !12, !12}
!46 = !DILocalVariable(name: "y", arg: 1, scope: !43, file: !1, line: 41, type: !12)
!47 = !DILocation(line: 0, scope: !43)
!48 = !DILocalVariable(name: "m", arg: 2, scope: !43, file: !1, line: 41, type: !12)
!49 = !DILocalVariable(name: "d", arg: 3, scope: !43, file: !1, line: 41, type: !12)
!50 = !DILocalVariable(name: "month_lengths", scope: !43, file: !1, line: 42, type: !51)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 384, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 12)
!54 = !DILocation(line: 42, column: 7, scope: !43)
!55 = !DILocation(line: 44, column: 3, scope: !43)
!56 = !DILocation(line: 44, column: 12, scope: !57)
!57 = distinct !DILexicalBlock(scope: !58, file: !1, line: 44, column: 3)
!58 = distinct !DILexicalBlock(scope: !43, file: !1, line: 44, column: 3)
!59 = !DILocation(line: 44, column: 3, scope: !58)
!60 = !DILocation(line: 45, column: 27, scope: !61)
!61 = distinct !DILexicalBlock(scope: !57, file: !1, line: 44, column: 23)
!62 = !DILocation(line: 45, column: 10, scope: !61)
!63 = !DILocation(line: 45, column: 7, scope: !61)
!64 = !DILocation(line: 46, column: 11, scope: !65)
!65 = distinct !DILexicalBlock(scope: !61, file: !1, line: 46, column: 9)
!66 = !DILocation(line: 46, column: 16, scope: !65)
!67 = !DILocation(line: 46, column: 19, scope: !65)
!68 = !DILocation(line: 46, column: 9, scope: !61)
!69 = !DILocation(line: 47, column: 7, scope: !70)
!70 = distinct !DILexicalBlock(scope: !65, file: !1, line: 46, column: 35)
!71 = !DILocation(line: 48, column: 5, scope: !70)
!72 = !DILocation(line: 0, scope: !61)
!73 = !DILocation(line: 49, column: 3, scope: !61)
!74 = !DILocation(line: 44, column: 19, scope: !57)
!75 = !DILocation(line: 44, column: 3, scope: !57)
!76 = distinct !{!76, !59, !77}
!77 = !DILocation(line: 49, column: 3, scope: !58)
!78 = !DILocation(line: 50, column: 3, scope: !43)
!79 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 54, type: !80, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!80 = !DISubroutineType(types: !81)
!81 = !{!12, !12, !82}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!83 = !DILocalVariable(name: "argc", arg: 1, scope: !79, file: !1, line: 54, type: !12)
!84 = !DILocation(line: 0, scope: !79)
!85 = !DILocalVariable(name: "argv", arg: 2, scope: !79, file: !1, line: 54, type: !82)
!86 = !DILocalVariable(name: "now", scope: !79, file: !1, line: 55, type: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !88, line: 7, baseType: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !90, line: 160, baseType: !91)
!90 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!91 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!92 = !DILocation(line: 55, column: 10, scope: !79)
!93 = !DILocation(line: 59, column: 12, scope: !94)
!94 = distinct !DILexicalBlock(scope: !79, file: !1, line: 59, column: 7)
!95 = !DILocation(line: 59, column: 7, scope: !79)
!96 = !DILocation(line: 60, column: 11, scope: !97)
!97 = distinct !DILexicalBlock(scope: !94, file: !1, line: 59, column: 18)
!98 = !DILocation(line: 60, column: 9, scope: !97)
!99 = !DILocation(line: 61, column: 16, scope: !97)
!100 = !DILocalVariable(name: "now_time", scope: !79, file: !1, line: 56, type: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !103, line: 7, size: 448, elements: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "")
!104 = !{!105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !102, file: !103, line: 9, baseType: !12, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !102, file: !103, line: 10, baseType: !12, size: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !102, file: !103, line: 11, baseType: !12, size: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !102, file: !103, line: 12, baseType: !12, size: 32, offset: 96)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !102, file: !103, line: 13, baseType: !12, size: 32, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !102, file: !103, line: 14, baseType: !12, size: 32, offset: 160)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !102, file: !103, line: 15, baseType: !12, size: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !102, file: !103, line: 16, baseType: !12, size: 32, offset: 224)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !102, file: !103, line: 17, baseType: !12, size: 32, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !102, file: !103, line: 20, baseType: !91, size: 64, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !102, file: !103, line: 21, baseType: !116, size: 64, offset: 384)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!118 = !DILocation(line: 62, column: 22, scope: !97)
!119 = !DILocation(line: 62, column: 30, scope: !97)
!120 = !DILocalVariable(name: "year", scope: !79, file: !1, line: 57, type: !12)
!121 = !DILocation(line: 62, column: 54, scope: !97)
!122 = !DILocation(line: 62, column: 62, scope: !97)
!123 = !DILocalVariable(name: "doy", scope: !79, file: !1, line: 57, type: !12)
!124 = !DILocation(line: 63, column: 3, scope: !97)
!125 = !DILocation(line: 63, column: 19, scope: !126)
!126 = distinct !DILexicalBlock(scope: !94, file: !1, line: 63, column: 14)
!127 = !DILocation(line: 63, column: 14, scope: !94)
!128 = !DILocation(line: 64, column: 18, scope: !129)
!129 = distinct !DILexicalBlock(scope: !126, file: !1, line: 63, column: 25)
!130 = !DILocation(line: 64, column: 12, scope: !129)
!131 = !DILocation(line: 64, column: 56, scope: !129)
!132 = !DILocation(line: 64, column: 50, scope: !129)
!133 = !DILocation(line: 64, column: 75, scope: !129)
!134 = !DILocation(line: 64, column: 69, scope: !129)
!135 = !DILocation(line: 64, column: 94, scope: !129)
!136 = !DILocation(line: 64, column: 88, scope: !129)
!137 = !DILocation(line: 64, column: 37, scope: !129)
!138 = !DILocation(line: 65, column: 3, scope: !129)
!139 = !DILocation(line: 0, scope: !94)
!140 = !DILocation(line: 67, column: 19, scope: !79)
!141 = !DILocalVariable(name: "result", scope: !79, file: !1, line: 67, type: !10)
!142 = !DILocation(line: 68, column: 3, scope: !79)
!143 = !DILocation(line: 69, column: 3, scope: !79)
!144 = !DILocation(line: 71, column: 3, scope: !79)
